/* automatically generated by rust-bindgen 0.71.1 */

pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __int_least8_t = __int8_t;
pub type __uint_least8_t = __uint8_t;
pub type __int_least16_t = __int16_t;
pub type __uint_least16_t = __uint16_t;
pub type __int_least32_t = __int32_t;
pub type __uint_least32_t = __uint32_t;
pub type __int_least64_t = __int64_t;
pub type __uint_least64_t = __uint64_t;
pub type __quad_t = ::std::os::raw::c_long;
pub type __u_quad_t = ::std::os::raw::c_ulong;
pub type __intmax_t = ::std::os::raw::c_long;
pub type __uintmax_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_ulong;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;

pub const XFGRP_EVT_DRR_INSTRUMENT: u64 = 312015063223369728;
pub const XFGRP_EVT_DRR_LEG: u64 = 312015058928402432;
pub const XFGRP_EVT_DRR_LEG_V3_8: u64 = 312015041748533248;
pub const XFGRP_EVT_DRR_MATCH: u64 = 312015028863631360;
pub const XFGRP_EVT_DRR_PRODUCT: u64 = 312015067518337024;
pub const XFGRP_EVT_DRR_SIZE_RULE: u64 = 312015054633435136;
pub const XFGRP_EVT_DRR_TICK: u64 = 312015024568664064;
pub const XFGRP_EVT_DRR_UNDERLYING: u64 = 312015046043500544;
pub const XFGRP_EVT_DRR_V3_8: u64 = 312015020273696768;
pub const XFGRP_EVT_OOB: u64 = 312296495250407424;
pub const XFGRP_EVT_OOB_COMMON: u64 = 312296490955440128;
pub const XFGRP_EVT_OOB_ENTRY: u64 = 312296499545374720;
pub const XFGRP_EVT_OOB_PARTY: u64 = 312296503840342016;
pub const XFGRP_EVT_FXSPOT_REFR_ALL: u64 = 312577965932150784;
pub const XFGRP_EVT_FXSPOT_QUO_ALL: u64 = 312859440908861440;
pub const XFGRP_EVT_FXFWD_REFR_ALL: u64 = 313140915885572096;
pub const XFGRP_EVT_FXFWD_QUO_ALL: u64 = 313422390862282752;
pub const XFGRP_EVT_FXSWAP_REFR_ALL: u64 = 313703865838993408;
pub const XFGRP_EVT_FXSWAP_QUO_ALL: u64 = 313985340815704064;
pub const XFGRP_EVT_TPSUMR: u64 = 314266815792414720;
pub const XFGRP_EVT_TPLATR: u64 = 314548290769125376;
pub const XFGRP_EVT_TPCRR: u64 = 314829765745836032;
pub const XFGRP_EVT_TPSRR: u64 = 315111240722546688;
pub const XFGRP_EVT_ST_TPSUMR: u64 = 315392715699257344;
pub const XFGRP_EVT_ST_TPLATR: u64 = 315674190675968000;
pub const XFGRP_EVT_ST_TPCRR: u64 = 315955665652678656;
pub const XFGRP_EVT_ST_TPSRR: u64 = 316237140629389312;
pub const XFGRP_EVT_TPMWCBU: u64 = 316518615606099968;
pub const XFGRP_EVT_TPSERR: u64 = 317363040536231936;
pub const XFGRP_EVT_ST_TPSERR: u64 = 317644515512942592;
pub const XFGRP_EVT_TPSESR: u64 = 317925990489653248;
pub const XFGRP_EVT_ST_TPSESR: u64 = 318207465466363904;
pub const XFGRP_EVT_RFQ: u64 = 319051890396495872;
pub const XFGRP_EVT_RFQ_ALL: u64 = 319051894691463168;
pub const XFGRP_EVT_INDPR: u64 = 319333369668173824;
pub const XFGRP_EVT_INDPR_COMMON: u64 = 319333365373206528;
pub const XFGRP_EVT_INSTGRP_REFR: u64 = 319614840349917184;
pub const XFGRP_EVT_INSTGRP_UPDATE: u64 = 319896315326627840;
pub const XFGRP_EVT_VOLREF_VOLATILITY_BBO: u64 = 343258742688579584;
pub const XFGRP_EVT_VOLREF_VOLATILITY_MISC: u64 = 343258738393612288;
pub const XFGRP_EVT_VOLREF_VOLATILITY_TRADE: u64 = 343258751278514176;
pub const XFGRP_EVT_VOLREF_VOLATILITY_UNDERLYING: u64 = 343258746983546880;
pub const XFGRP_EVT_VOLQR_VOLATILITY_BBO: u64 = 343540217665290240;
pub const XFGRP_EVT_VOLQR_VOLATILITY_MISC: u64 = 343540213370322944;
pub const XFGRP_EVT_VOLQR_VOLATILITY_UNDERLYING: u64 = 343540221960257536;
pub const XFGRP_EVT_VOLTR_VOLATILITY_BBO: u64 = 343821692642000896;
pub const XFGRP_EVT_VOLTR_VOLATILITY_MISC: u64 = 343821688347033600;
pub const XFGRP_EVT_VOLTR_VOLATILITY_TRADE: u64 = 343821701231935488;
pub const XFGRP_EVT_VOLTR_VOLATILITY_UNDERLYING: u64 = 343821696936968192;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __fsid_t"][::std::mem::size_of::<__fsid_t>() - 8usize];
    ["Alignment of __fsid_t"][::std::mem::align_of::<__fsid_t>() - 4usize];
    ["Offset of field: __fsid_t::__val"][::std::mem::offset_of!(__fsid_t, __val) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of max_align_t"][::std::mem::size_of::<max_align_t>() - 32usize];
    ["Alignment of max_align_t"][::std::mem::align_of::<max_align_t>() - 16usize];
    ["Offset of field: max_align_t::__clang_max_align_nonce1"]
        [::std::mem::offset_of!(max_align_t, __clang_max_align_nonce1) - 0usize];
    ["Offset of field: max_align_t::__clang_max_align_nonce2"]
        [::std::mem::offset_of!(max_align_t, __clang_max_align_nonce2) - 16usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XM_DATA_TYPE_INFO"][::std::mem::size_of::<XM_DATA_TYPE_INFO>() - 72usize];
    ["Alignment of XM_DATA_TYPE_INFO"][::std::mem::align_of::<XM_DATA_TYPE_INFO>() - 4usize];
    ["Offset of field: XM_DATA_TYPE_INFO::xdti_datatype"]
        [::std::mem::offset_of!(XM_DATA_TYPE_INFO, xdti_datatype) - 0usize];
    ["Offset of field: XM_DATA_TYPE_INFO::xdti_type"]
        [::std::mem::offset_of!(XM_DATA_TYPE_INFO, xdti_type) - 2usize];
    ["Offset of field: XM_DATA_TYPE_INFO::xdti_bitsize"]
        [::std::mem::offset_of!(XM_DATA_TYPE_INFO, xdti_bitsize) - 4usize];
    ["Offset of field: XM_DATA_TYPE_INFO::xdti_name"]
        [::std::mem::offset_of!(XM_DATA_TYPE_INFO, xdti_name) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XM_STRUCTFIELD_INFO"][::std::mem::size_of::<XM_STRUCTFIELD_INFO>() - 80usize];
    ["Alignment of XM_STRUCTFIELD_INFO"][::std::mem::align_of::<XM_STRUCTFIELD_INFO>() - 4usize];
    ["Offset of field: XM_STRUCTFIELD_INFO::xsfi_datatype"]
        [::std::mem::offset_of!(XM_STRUCTFIELD_INFO, xsfi_datatype) - 0usize];
    ["Offset of field: XM_STRUCTFIELD_INFO::xsfi_struct_datatype"]
        [::std::mem::offset_of!(XM_STRUCTFIELD_INFO, xsfi_struct_datatype) - 2usize];
    ["Offset of field: XM_STRUCTFIELD_INFO::xsfi_bitsize"]
        [::std::mem::offset_of!(XM_STRUCTFIELD_INFO, xsfi_bitsize) - 4usize];
    ["Offset of field: XM_STRUCTFIELD_INFO::xsfi_bitoffset"]
        [::std::mem::offset_of!(XM_STRUCTFIELD_INFO, xsfi_bitoffset) - 8usize];
    ["Offset of field: XM_STRUCTFIELD_INFO::xsfi_prefix_len"]
        [::std::mem::offset_of!(XM_STRUCTFIELD_INFO, xsfi_prefix_len) - 10usize];
    ["Offset of field: XM_STRUCTFIELD_INFO::xsfi_array_count"]
        [::std::mem::offset_of!(XM_STRUCTFIELD_INFO, xsfi_array_count) - 12usize];
    ["Offset of field: XM_STRUCTFIELD_INFO::XSFI_RESERVED_01"]
        [::std::mem::offset_of!(XM_STRUCTFIELD_INFO, XSFI_RESERVED_01) - 14usize];
    ["Offset of field: XM_STRUCTFIELD_INFO::xsfi_name"]
        [::std::mem::offset_of!(XM_STRUCTFIELD_INFO, xsfi_name) - 16usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XM_ENUM_VALUE_INFO"][::std::mem::size_of::<XM_ENUM_VALUE_INFO>() - 80usize];
    ["Alignment of XM_ENUM_VALUE_INFO"][::std::mem::align_of::<XM_ENUM_VALUE_INFO>() - 8usize];
    ["Offset of field: XM_ENUM_VALUE_INFO::xevi_datatype"]
        [::std::mem::offset_of!(XM_ENUM_VALUE_INFO, xevi_datatype) - 0usize];
    ["Offset of field: XM_ENUM_VALUE_INFO::xevi_prefix_len"]
        [::std::mem::offset_of!(XM_ENUM_VALUE_INFO, xevi_prefix_len) - 2usize];
    ["Offset of field: XM_ENUM_VALUE_INFO::XEVI_RESERVED_00"]
        [::std::mem::offset_of!(XM_ENUM_VALUE_INFO, XEVI_RESERVED_00) - 3usize];
    ["Offset of field: XM_ENUM_VALUE_INFO::XEVI_RESERVED_01"]
        [::std::mem::offset_of!(XM_ENUM_VALUE_INFO, XEVI_RESERVED_01) - 4usize];
    ["Offset of field: XM_ENUM_VALUE_INFO::xevi_value"]
        [::std::mem::offset_of!(XM_ENUM_VALUE_INFO, xevi_value) - 8usize];
    ["Offset of field: XM_ENUM_VALUE_INFO::xevi_name"]
        [::std::mem::offset_of!(XM_ENUM_VALUE_INFO, xevi_name) - 16usize];
};
pub const XC_EXTIME_OLDEST_POSSIBLE: XC_EXTIME = -9223372036854775808;
pub const XC_TIME_DATE_CUTOFF: XC_TIME = -2145386496;
pub const XC_TIME_DAYSBACK_CUTOFF: XC_TIME = -2143289344;
pub const XC_EXTIME_DATE_CUTOFF: XC_EXTIME = -140735338774528;
pub const XC_EXTIME_MSECSBACK_CUTOFF: XC_EXTIME = -70368744177664;
pub const XC_DATE_ID_PATTERN: xuint32 = 1024;
pub const XC_DAYSBACK_ID_PATTERN: xuint32 = 1025;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_DATE__bindgen_ty_1"][::std::mem::size_of::<XC_DATE__bindgen_ty_1>() - 4usize];
    ["Alignment of XC_DATE__bindgen_ty_1"]
        [::std::mem::align_of::<XC_DATE__bindgen_ty_1>() - 1usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_DATE"][::std::mem::size_of::<XC_DATE>() - 4usize];
    ["Alignment of XC_DATE"][::std::mem::align_of::<XC_DATE>() - 1usize];
    ["Offset of field: XC_DATE::xdt_raw"][::std::mem::offset_of!(XC_DATE, xdt_raw) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_DAYSBACK"][::std::mem::size_of::<XC_DAYSBACK>() - 4usize];
    ["Alignment of XC_DAYSBACK"][::std::mem::align_of::<XC_DAYSBACK>() - 1usize];
};
pub const XC_MAX_DAYSBACK: xuint32 = 2048;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_DATETIME"][::std::mem::size_of::<XC_DATETIME>() - 8usize];
    ["Alignment of XC_DATETIME"][::std::mem::align_of::<XC_DATETIME>() - 1usize];
    ["Offset of field: XC_DATETIME::xdtm_time"]
        [::std::mem::offset_of!(XC_DATETIME, xdtm_time) - 0usize];
    ["Offset of field: XC_DATETIME::xdtm_date"]
        [::std::mem::offset_of!(XC_DATETIME, xdtm_date) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_IPV4_ADDRESS"][::std::mem::size_of::<XC_IPV4_ADDRESS>() - 4usize];
    ["Alignment of XC_IPV4_ADDRESS"][::std::mem::align_of::<XC_IPV4_ADDRESS>() - 1usize];
    ["Offset of field: XC_IPV4_ADDRESS::xip_u32"]
        [::std::mem::offset_of!(XC_IPV4_ADDRESS, xip_u32) - 0usize];
    ["Offset of field: XC_IPV4_ADDRESS::xip_octets"]
        [::std::mem::offset_of!(XC_IPV4_ADDRESS, xip_octets) - 0usize];
};
pub const XC_BLANK_PRICE: xint32 = -2147483648;
pub const XC_BLANK_PRICE_HIGH: xint32 = 2147483647;
pub const XC_MARKET_PRICE: xint32 = 2147483646;
pub const XC_OVERFLOW_PRICE: xint32 = 2147483645;
pub const XC_UNDERFLOW_PRICE: xint32 = -2147483646;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_PRICE_DESC"][::std::mem::size_of::<XC_PRICE_DESC>() - 8usize];
    ["Alignment of XC_PRICE_DESC"][::std::mem::align_of::<XC_PRICE_DESC>() - 1usize];
    ["Offset of field: XC_PRICE_DESC::xpd_price"]
        [::std::mem::offset_of!(XC_PRICE_DESC, xpd_price) - 0usize];
    ["Offset of field: XC_PRICE_DESC::XPD_RESERVED_01"]
        [::std::mem::offset_of!(XC_PRICE_DESC, XPD_RESERVED_01) - 5usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_EXCHANGE_ID"][::std::mem::size_of::<XC_EXCHANGE_ID>() - 2usize];
    ["Alignment of XC_EXCHANGE_ID"][::std::mem::align_of::<XC_EXCHANGE_ID>() - 1usize];
    ["Offset of field: XC_EXCHANGE_ID::xex_ch"]
        [::std::mem::offset_of!(XC_EXCHANGE_ID, xex_ch) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_COUNTRY_ID"][::std::mem::size_of::<XC_COUNTRY_ID>() - 2usize];
    ["Alignment of XC_COUNTRY_ID"][::std::mem::align_of::<XC_COUNTRY_ID>() - 1usize];
    ["Offset of field: XC_COUNTRY_ID::xcc_ch"]
        [::std::mem::offset_of!(XC_COUNTRY_ID, xcc_ch) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_CURRENCY_ID"][::std::mem::size_of::<XC_CURRENCY_ID>() - 3usize];
    ["Alignment of XC_CURRENCY_ID"][::std::mem::align_of::<XC_CURRENCY_ID>() - 1usize];
    ["Offset of field: XC_CURRENCY_ID::xcur_ch"]
        [::std::mem::offset_of!(XC_CURRENCY_ID, xcur_ch) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_AUTHORIZATION"][::std::mem::size_of::<XC_AUTHORIZATION>() - 4usize];
    ["Alignment of XC_AUTHORIZATION"][::std::mem::align_of::<XC_AUTHORIZATION>() - 1usize];
    ["Offset of field: XC_AUTHORIZATION::authorization"]
        [::std::mem::offset_of!(XC_AUTHORIZATION, authorization) - 0usize];
    ["Offset of field: XC_AUTHORIZATION::u32_"]
        [::std::mem::offset_of!(XC_AUTHORIZATION, u32_) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_ALTERNATE_ID"][::std::mem::size_of::<XC_ALTERNATE_ID>() - 16usize];
    ["Alignment of XC_ALTERNATE_ID"][::std::mem::align_of::<XC_ALTERNATE_ID>() - 1usize];
    ["Offset of field: XC_ALTERNATE_ID::xalt_ch"]
        [::std::mem::offset_of!(XC_ALTERNATE_ID, xalt_ch) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_REFERENCE_STRING"][::std::mem::size_of::<XC_REFERENCE_STRING>() - 72usize];
    ["Alignment of XC_REFERENCE_STRING"][::std::mem::align_of::<XC_REFERENCE_STRING>() - 1usize];
    ["Offset of field: XC_REFERENCE_STRING::str_"]
        [::std::mem::offset_of!(XC_REFERENCE_STRING, str_) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_MMID"][::std::mem::size_of::<XC_MMID>() - 6usize];
    ["Alignment of XC_MMID"][::std::mem::align_of::<XC_MMID>() - 1usize];
    ["Offset of field: XC_MMID::xmmid_ch"][::std::mem::offset_of!(XC_MMID, xmmid_ch) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_TRADE_VENUE"][::std::mem::size_of::<XC_TRADE_VENUE>() - 4usize];
    ["Alignment of XC_TRADE_VENUE"][::std::mem::align_of::<XC_TRADE_VENUE>() - 1usize];
    ["Offset of field: XC_TRADE_VENUE::ch"][::std::mem::offset_of!(XC_TRADE_VENUE, ch) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_ORDER_REF_ID__bindgen_ty_1"]
        [::std::mem::size_of::<XC_ORDER_REF_ID__bindgen_ty_1>() - 12usize];
    ["Alignment of XC_ORDER_REF_ID__bindgen_ty_1"]
        [::std::mem::align_of::<XC_ORDER_REF_ID__bindgen_ty_1>() - 1usize];
    ["Offset of field: XC_ORDER_REF_ID__bindgen_ty_1::xoid_ch"]
        [::std::mem::offset_of!(XC_ORDER_REF_ID__bindgen_ty_1, xoid_ch) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_ORDER_REF_ID__bindgen_ty_2"]
        [::std::mem::size_of::<XC_ORDER_REF_ID__bindgen_ty_2>() - 12usize];
    ["Alignment of XC_ORDER_REF_ID__bindgen_ty_2"]
        [::std::mem::align_of::<XC_ORDER_REF_ID__bindgen_ty_2>() - 1usize];
    ["Offset of field: XC_ORDER_REF_ID__bindgen_ty_2::xoid_bcd_pair"]
        [::std::mem::offset_of!(XC_ORDER_REF_ID__bindgen_ty_2, xoid_bcd_pair) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_ORDER_REF_ID__bindgen_ty_3"]
        [::std::mem::size_of::<XC_ORDER_REF_ID__bindgen_ty_3>() - 8usize];
    ["Alignment of XC_ORDER_REF_ID__bindgen_ty_3"]
        [::std::mem::align_of::<XC_ORDER_REF_ID__bindgen_ty_3>() - 1usize];
    ["Offset of field: XC_ORDER_REF_ID__bindgen_ty_3::xoid_uint1"]
        [::std::mem::offset_of!(XC_ORDER_REF_ID__bindgen_ty_3, xoid_uint1) - 0usize];
    ["Offset of field: XC_ORDER_REF_ID__bindgen_ty_3::xoid_uint2"]
        [::std::mem::offset_of!(XC_ORDER_REF_ID__bindgen_ty_3, xoid_uint2) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_ORDER_REF_ID__bindgen_ty_4"]
        [::std::mem::size_of::<XC_ORDER_REF_ID__bindgen_ty_4>() - 8usize];
    ["Alignment of XC_ORDER_REF_ID__bindgen_ty_4"]
        [::std::mem::align_of::<XC_ORDER_REF_ID__bindgen_ty_4>() - 1usize];
    ["Offset of field: XC_ORDER_REF_ID__bindgen_ty_4::xoid_alpha36"]
        [::std::mem::offset_of!(XC_ORDER_REF_ID__bindgen_ty_4, xoid_alpha36) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_ORDER_REF_ID__bindgen_ty_5"]
        [::std::mem::size_of::<XC_ORDER_REF_ID__bindgen_ty_5>() - 8usize];
    ["Alignment of XC_ORDER_REF_ID__bindgen_ty_5"]
        [::std::mem::align_of::<XC_ORDER_REF_ID__bindgen_ty_5>() - 1usize];
    ["Offset of field: XC_ORDER_REF_ID__bindgen_ty_5::xoid_raw64"]
        [::std::mem::offset_of!(XC_ORDER_REF_ID__bindgen_ty_5, xoid_raw64) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_ORDER_REF_ID__bindgen_ty_6"]
        [::std::mem::size_of::<XC_ORDER_REF_ID__bindgen_ty_6>() - 12usize];
    ["Alignment of XC_ORDER_REF_ID__bindgen_ty_6"]
        [::std::mem::align_of::<XC_ORDER_REF_ID__bindgen_ty_6>() - 1usize];
    ["Offset of field: XC_ORDER_REF_ID__bindgen_ty_6::xoid_sym_uint_symbol"]
        [::std::mem::offset_of!(XC_ORDER_REF_ID__bindgen_ty_6, xoid_sym_uint_symbol) - 0usize];
    ["Offset of field: XC_ORDER_REF_ID__bindgen_ty_6::xoid_sym_uint_refid"]
        [::std::mem::offset_of!(XC_ORDER_REF_ID__bindgen_ty_6, xoid_sym_uint_refid) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_ORDER_REF_ID"][::std::mem::size_of::<XC_ORDER_REF_ID>() - 12usize];
    ["Alignment of XC_ORDER_REF_ID"][::std::mem::align_of::<XC_ORDER_REF_ID>() - 1usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_SYMBOL"][::std::mem::size_of::<XC_SYMBOL>() - 20usize];
    ["Alignment of XC_SYMBOL"][::std::mem::align_of::<XC_SYMBOL>() - 1usize];
    ["Offset of field: XC_SYMBOL::xsym_ch"][::std::mem::offset_of!(XC_SYMBOL, xsym_ch) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_KEY"][::std::mem::size_of::<XC_KEY>() - 24usize];
    ["Alignment of XC_KEY"][::std::mem::align_of::<XC_KEY>() - 1usize];
    ["Offset of field: XC_KEY::xk_exchange"][::std::mem::offset_of!(XC_KEY, xk_exchange) - 0usize];
    ["Offset of field: XC_KEY::xk_country"][::std::mem::offset_of!(XC_KEY, xk_country) - 2usize];
    ["Offset of field: XC_KEY::xk_symbol"][::std::mem::offset_of!(XC_KEY, xk_symbol) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_KEY_DESC"][::std::mem::size_of::<XC_KEY_DESC>() - 32usize];
    ["Alignment of XC_KEY_DESC"][::std::mem::align_of::<XC_KEY_DESC>() - 1usize];
    ["Offset of field: XC_KEY_DESC::xkd_key"]
        [::std::mem::offset_of!(XC_KEY_DESC, xkd_key) - 0usize];
    ["Offset of field: XC_KEY_DESC::XKD_RESERVED_01"]
        [::std::mem::offset_of!(XC_KEY_DESC, XKD_RESERVED_01) - 25usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_FIELD_DESC__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<XC_FIELD_DESC__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Alignment of XC_FIELD_DESC__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<XC_FIELD_DESC__bindgen_ty_1__bindgen_ty_1>() - 1usize];
    ["Offset of field: XC_FIELD_DESC__bindgen_ty_1__bindgen_ty_1::xfds_string_type"][::std::mem::offset_of!(
        XC_FIELD_DESC__bindgen_ty_1__bindgen_ty_1,
        xfds_string_type
    ) - 0usize];
    ["Offset of field: XC_FIELD_DESC__bindgen_ty_1__bindgen_ty_1::xfds_field_width"][::std::mem::offset_of!(
        XC_FIELD_DESC__bindgen_ty_1__bindgen_ty_1,
        xfds_field_width
    ) - 2usize];
    ["Offset of field: XC_FIELD_DESC__bindgen_ty_1__bindgen_ty_1::xfds_options"]
        [::std::mem::offset_of!(XC_FIELD_DESC__bindgen_ty_1__bindgen_ty_1, xfds_options) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_FIELD_DESC__bindgen_ty_1__bindgen_ty_2"]
        [::std::mem::size_of::<XC_FIELD_DESC__bindgen_ty_1__bindgen_ty_2>() - 2usize];
    ["Alignment of XC_FIELD_DESC__bindgen_ty_1__bindgen_ty_2"]
        [::std::mem::align_of::<XC_FIELD_DESC__bindgen_ty_1__bindgen_ty_2>() - 1usize];
    ["Offset of field: XC_FIELD_DESC__bindgen_ty_1__bindgen_ty_2::xfdb_convert_type"][::std::mem::offset_of!(
        XC_FIELD_DESC__bindgen_ty_1__bindgen_ty_2,
        xfdb_convert_type
    ) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_FIELD_DESC__bindgen_ty_1"]
        [::std::mem::size_of::<XC_FIELD_DESC__bindgen_ty_1>() - 12usize];
    ["Alignment of XC_FIELD_DESC__bindgen_ty_1"]
        [::std::mem::align_of::<XC_FIELD_DESC__bindgen_ty_1>() - 1usize];
    ["Offset of field: XC_FIELD_DESC__bindgen_ty_1::RESERVED_02"]
        [::std::mem::offset_of!(XC_FIELD_DESC__bindgen_ty_1, RESERVED_02) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_FIELD_DESC"][::std::mem::size_of::<XC_FIELD_DESC>() - 48usize];
    ["Alignment of XC_FIELD_DESC"][::std::mem::align_of::<XC_FIELD_DESC>() - 1usize];
    ["Offset of field: XC_FIELD_DESC::xfd_id"]
        [::std::mem::offset_of!(XC_FIELD_DESC, xfd_id) - 0usize];
    ["Offset of field: XC_FIELD_DESC::xfd_buffer_address"]
        [::std::mem::offset_of!(XC_FIELD_DESC, xfd_buffer_address) - 8usize];
    ["Offset of field: XC_FIELD_DESC::xfd_elmsiz"]
        [::std::mem::offset_of!(XC_FIELD_DESC, xfd_elmsiz) - 16usize];
    ["Offset of field: XC_FIELD_DESC::xfd_in_count"]
        [::std::mem::offset_of!(XC_FIELD_DESC, xfd_in_count) - 20usize];
    ["Offset of field: XC_FIELD_DESC::xfd_out_count"]
        [::std::mem::offset_of!(XC_FIELD_DESC, xfd_out_count) - 24usize];
    ["Offset of field: XC_FIELD_DESC::xfd_status"]
        [::std::mem::offset_of!(XC_FIELD_DESC, xfd_status) - 28usize];
    ["Offset of field: XC_FIELD_DESC::xfd_desc_size"]
        [::std::mem::offset_of!(XC_FIELD_DESC, xfd_desc_size) - 32usize];
    ["Offset of field: XC_FIELD_DESC::XFD_RESERVED_00"]
        [::std::mem::offset_of!(XC_FIELD_DESC, XFD_RESERVED_00) - 33usize];
    ["Offset of field: XC_FIELD_DESC::XFD_RESERVED_01"]
        [::std::mem::offset_of!(XC_FIELD_DESC, XFD_RESERVED_01) - 34usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_EVENT_DESC"][::std::mem::size_of::<XC_EVENT_DESC>() - 32usize];
    ["Alignment of XC_EVENT_DESC"][::std::mem::align_of::<XC_EVENT_DESC>() - 1usize];
    ["Offset of field: XC_EVENT_DESC::xvi_type"]
        [::std::mem::offset_of!(XC_EVENT_DESC, xvi_type) - 0usize];
    ["Offset of field: XC_EVENT_DESC::XVI_RESERVED_00"]
        [::std::mem::offset_of!(XC_EVENT_DESC, XVI_RESERVED_00) - 2usize];
    ["Offset of field: XC_EVENT_DESC::xvi_status"]
        [::std::mem::offset_of!(XC_EVENT_DESC, xvi_status) - 4usize];
    ["Offset of field: XC_EVENT_DESC::xvi_event"]
        [::std::mem::offset_of!(XC_EVENT_DESC, xvi_event) - 8usize];
    ["Offset of field: XC_EVENT_DESC::XVI_RESERVED_01"]
        [::std::mem::offset_of!(XC_EVENT_DESC, XVI_RESERVED_01) - 16usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_SLOT_CONTEXT"][::std::mem::size_of::<XC_SLOT_CONTEXT>() - 48usize];
    ["Alignment of XC_SLOT_CONTEXT"][::std::mem::align_of::<XC_SLOT_CONTEXT>() - 1usize];
    ["Offset of field: XC_SLOT_CONTEXT::xcreq_key"]
        [::std::mem::offset_of!(XC_SLOT_CONTEXT, xcreq_key) - 0usize];
    ["Offset of field: XC_SLOT_CONTEXT::XCREQ_RESERVED_01"]
        [::std::mem::offset_of!(XC_SLOT_CONTEXT, XCREQ_RESERVED_01) - 25usize];
    ["Offset of field: XC_SLOT_CONTEXT::XCREQ_RESERVED_02"]
        [::std::mem::offset_of!(XC_SLOT_CONTEXT, XCREQ_RESERVED_02) - 28usize];
    ["Offset of field: XC_SLOT_CONTEXT::xcreq_turnkey"]
        [::std::mem::offset_of!(XC_SLOT_CONTEXT, xcreq_turnkey) - 32usize];
    ["Offset of field: XC_SLOT_CONTEXT::XCREQ_RESERVED_03"]
        [::std::mem::offset_of!(XC_SLOT_CONTEXT, XCREQ_RESERVED_03) - 40usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_LIST_UPDATE__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<XC_LIST_UPDATE__bindgen_ty_1__bindgen_ty_1>() - 4usize];
    ["Alignment of XC_LIST_UPDATE__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<XC_LIST_UPDATE__bindgen_ty_1__bindgen_ty_1>() - 1usize];
    ["Offset of field: XC_LIST_UPDATE__bindgen_ty_1__bindgen_ty_1::xlu_index"]
        [::std::mem::offset_of!(XC_LIST_UPDATE__bindgen_ty_1__bindgen_ty_1, xlu_index) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_LIST_UPDATE__bindgen_ty_1__bindgen_ty_2"]
        [::std::mem::size_of::<XC_LIST_UPDATE__bindgen_ty_1__bindgen_ty_2>() - 4usize];
    ["Alignment of XC_LIST_UPDATE__bindgen_ty_1__bindgen_ty_2"]
        [::std::mem::align_of::<XC_LIST_UPDATE__bindgen_ty_1__bindgen_ty_2>() - 1usize];
    ["Offset of field: XC_LIST_UPDATE__bindgen_ty_1__bindgen_ty_2::xlu_key_offset"][::std::mem::offset_of!(
        XC_LIST_UPDATE__bindgen_ty_1__bindgen_ty_2,
        xlu_key_offset
    ) - 0usize];
    ["Offset of field: XC_LIST_UPDATE__bindgen_ty_1__bindgen_ty_2::xlu_key_size"]
        [::std::mem::offset_of!(XC_LIST_UPDATE__bindgen_ty_1__bindgen_ty_2, xlu_key_size) - 2usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_LIST_UPDATE__bindgen_ty_1"]
        [::std::mem::size_of::<XC_LIST_UPDATE__bindgen_ty_1>() - 4usize];
    ["Alignment of XC_LIST_UPDATE__bindgen_ty_1"]
        [::std::mem::align_of::<XC_LIST_UPDATE__bindgen_ty_1>() - 1usize];
    ["Offset of field: XC_LIST_UPDATE__bindgen_ty_1::pos"]
        [::std::mem::offset_of!(XC_LIST_UPDATE__bindgen_ty_1, pos) - 0usize];
    ["Offset of field: XC_LIST_UPDATE__bindgen_ty_1::key"]
        [::std::mem::offset_of!(XC_LIST_UPDATE__bindgen_ty_1, key) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_LIST_UPDATE"][::std::mem::size_of::<XC_LIST_UPDATE>() - 8usize];
    ["Alignment of XC_LIST_UPDATE"][::std::mem::align_of::<XC_LIST_UPDATE>() - 1usize];
    ["Offset of field: XC_LIST_UPDATE::XLU_RESERVED_01"]
        [::std::mem::offset_of!(XC_LIST_UPDATE, XLU_RESERVED_01) - 1usize];
    ["Offset of field: XC_LIST_UPDATE::var"][::std::mem::offset_of!(XC_LIST_UPDATE, var) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_TRADING_STATE_FILTER__bindgen_ty_1"]
        [::std::mem::size_of::<XC_TRADING_STATE_FILTER__bindgen_ty_1>() - 1usize];
    ["Alignment of XC_TRADING_STATE_FILTER__bindgen_ty_1"]
        [::std::mem::align_of::<XC_TRADING_STATE_FILTER__bindgen_ty_1>() - 1usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_TRADING_STATE_FILTER"][::std::mem::size_of::<XC_TRADING_STATE_FILTER>() - 1usize];
    ["Alignment of XC_TRADING_STATE_FILTER"]
        [::std::mem::align_of::<XC_TRADING_STATE_FILTER>() - 1usize];
    ["Offset of field: XC_TRADING_STATE_FILTER::xtsf_u8"]
        [::std::mem::offset_of!(XC_TRADING_STATE_FILTER, xtsf_u8) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_FEED_ID"][::std::mem::size_of::<XC_FEED_ID>() - 8usize];
    ["Alignment of XC_FEED_ID"][::std::mem::align_of::<XC_FEED_ID>() - 1usize];
    ["Offset of field: XC_FEED_ID::xfeed_handle"]
        [::std::mem::offset_of!(XC_FEED_ID, xfeed_handle) - 0usize];
    ["Offset of field: XC_FEED_ID::xfeed_id"]
        [::std::mem::offset_of!(XC_FEED_ID, xfeed_id) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_INSTRUMENT_GROUP_ID__bindgen_ty_1"]
        [::std::mem::size_of::<XC_INSTRUMENT_GROUP_ID__bindgen_ty_1>() - 24usize];
    ["Alignment of XC_INSTRUMENT_GROUP_ID__bindgen_ty_1"]
        [::std::mem::align_of::<XC_INSTRUMENT_GROUP_ID__bindgen_ty_1>() - 1usize];
    ["Offset of field: XC_INSTRUMENT_GROUP_ID__bindgen_ty_1::group_id_integer"]
        [::std::mem::offset_of!(XC_INSTRUMENT_GROUP_ID__bindgen_ty_1, group_id_integer) - 0usize];
    ["Offset of field: XC_INSTRUMENT_GROUP_ID__bindgen_ty_1::group_id_ascii"]
        [::std::mem::offset_of!(XC_INSTRUMENT_GROUP_ID__bindgen_ty_1, group_id_ascii) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_INSTRUMENT_GROUP_ID"][::std::mem::size_of::<XC_INSTRUMENT_GROUP_ID>() - 32usize];
    ["Alignment of XC_INSTRUMENT_GROUP_ID"]
        [::std::mem::align_of::<XC_INSTRUMENT_GROUP_ID>() - 1usize];
    ["Offset of field: XC_INSTRUMENT_GROUP_ID::country"]
        [::std::mem::offset_of!(XC_INSTRUMENT_GROUP_ID, country) - 0usize];
    ["Offset of field: XC_INSTRUMENT_GROUP_ID::exchange"]
        [::std::mem::offset_of!(XC_INSTRUMENT_GROUP_ID, exchange) - 2usize];
    ["Offset of field: XC_INSTRUMENT_GROUP_ID::type_"]
        [::std::mem::offset_of!(XC_INSTRUMENT_GROUP_ID, type_) - 4usize];
    ["Offset of field: XC_INSTRUMENT_GROUP_ID::priority"]
        [::std::mem::offset_of!(XC_INSTRUMENT_GROUP_ID, priority) - 5usize];
    ["Offset of field: XC_INSTRUMENT_GROUP_ID::RESERVED_00"]
        [::std::mem::offset_of!(XC_INSTRUMENT_GROUP_ID, RESERVED_00) - 6usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_EVENT_ID"][::std::mem::size_of::<XC_EVENT_ID>() - 32usize];
    ["Alignment of XC_EVENT_ID"][::std::mem::align_of::<XC_EVENT_ID>() - 1usize];
    ["Offset of field: XC_EVENT_ID::xei_ch"][::std::mem::offset_of!(XC_EVENT_ID, xei_ch) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_EQUITY_TRADE_UPDATE_FLAGS"]
        [::std::mem::size_of::<XC_EQUITY_TRADE_UPDATE_FLAGS>() - 2usize];
    ["Alignment of XC_EQUITY_TRADE_UPDATE_FLAGS"]
        [::std::mem::align_of::<XC_EQUITY_TRADE_UPDATE_FLAGS>() - 1usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_COMMODITY_TRADE_UPDATE_FLAGS"]
        [::std::mem::size_of::<XC_COMMODITY_TRADE_UPDATE_FLAGS>() - 1usize];
    ["Alignment of XC_COMMODITY_TRADE_UPDATE_FLAGS"]
        [::std::mem::align_of::<XC_COMMODITY_TRADE_UPDATE_FLAGS>() - 1usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_DFLOAT_64__bindgen_ty_1"]
        [::std::mem::size_of::<XC_DFLOAT_64__bindgen_ty_1>() - 8usize];
    ["Alignment of XC_DFLOAT_64__bindgen_ty_1"]
        [::std::mem::align_of::<XC_DFLOAT_64__bindgen_ty_1>() - 1usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_DFLOAT_64"][::std::mem::size_of::<XC_DFLOAT_64>() - 8usize];
    ["Alignment of XC_DFLOAT_64"][::std::mem::align_of::<XC_DFLOAT_64>() - 1usize];
    ["Offset of field: XC_DFLOAT_64::s64"][::std::mem::offset_of!(XC_DFLOAT_64, s64) - 0usize];
};
pub const XC_BLANK_DFLOAT_64_LOW_MANTISSA: xint64 = -576460752303423486;
pub const XC_BLANK_DFLOAT_64_LOW: xint64 = -9223372036854775761;
pub const XC_BLANK_DFLOAT_64_HIGH_MANTISSA: xint64 = 576460752303423486;
pub const XC_BLANK_DFLOAT_64_HIGH: xint64 = 9223372036854775791;
pub const XC_MARKET_DFLOAT_64_LOW_MANTISSA: xint64 = -576460752303423487;
pub const XC_MARKET_DFLOAT_64_LOW: xint64 = -9223372036854775777;
pub const XC_MARKET_DFLOAT_64_HIGH_MANTISSA: xint64 = 576460752303423487;
pub const XC_MARKET_DFLOAT_64_HIGH: xint64 = 9223372036854775807;
pub const XC_OVERFLOW_DFLOAT_64_MANTISSA: xint64 = 576460752303423482;
pub const XC_OVERFLOW_DFLOAT_64: xint64 = 9223372036854775727;
pub const XC_UNDERFLOW_DFLOAT_64: xint64 = -9223372036854775697;
pub const XC_RESERVED_DFLOAT_64_HIGH_1: xint64 = 9223372036854775775;
pub const XC_RESERVED_DFLOAT_64_HIGH_2: xint64 = 9223372036854775759;
pub const XC_RESERVED_DFLOAT_64_HIGH_3: xint64 = 9223372036854775743;
pub const XC_RESERVED_DFLOAT_64_LOW_1: xint64 = -9223372036854775745;
pub const XC_RESERVED_DFLOAT_64_LOW_2: xint64 = -9223372036854775729;
pub const XC_RESERVED_DFLOAT_64_LOW_3: xint64 = -9223372036854775713;
pub const MAX_DFLOAT_64_MANTISSA: xint64 = 576460752303423481;
pub const MIN_DFLOAT_64_MANTISSA: xint64 = -576460752303423481;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_SYMBOL_LABEL"][::std::mem::size_of::<XC_SYMBOL_LABEL>() - 256usize];
    ["Alignment of XC_SYMBOL_LABEL"][::std::mem::align_of::<XC_SYMBOL_LABEL>() - 1usize];
    ["Offset of field: XC_SYMBOL_LABEL::ch"][::std::mem::offset_of!(XC_SYMBOL_LABEL, ch) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_THRESHOLDS"][::std::mem::size_of::<XC_THRESHOLDS>() - 8usize];
    ["Alignment of XC_THRESHOLDS"][::std::mem::align_of::<XC_THRESHOLDS>() - 1usize];
    ["Offset of field: XC_THRESHOLDS::thresholds"]
        [::std::mem::offset_of!(XC_THRESHOLDS, thresholds) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_EVENT_QUALS__bindgen_ty_1"]
        [::std::mem::size_of::<XC_EVENT_QUALS__bindgen_ty_1>() - 4usize];
    ["Alignment of XC_EVENT_QUALS__bindgen_ty_1"]
        [::std::mem::align_of::<XC_EVENT_QUALS__bindgen_ty_1>() - 1usize];
    ["Offset of field: XC_EVENT_QUALS__bindgen_ty_1::q1"]
        [::std::mem::offset_of!(XC_EVENT_QUALS__bindgen_ty_1, q1) - 0usize];
    ["Offset of field: XC_EVENT_QUALS__bindgen_ty_1::q2"]
        [::std::mem::offset_of!(XC_EVENT_QUALS__bindgen_ty_1, q2) - 1usize];
    ["Offset of field: XC_EVENT_QUALS__bindgen_ty_1::q3"]
        [::std::mem::offset_of!(XC_EVENT_QUALS__bindgen_ty_1, q3) - 2usize];
    ["Offset of field: XC_EVENT_QUALS__bindgen_ty_1::q4"]
        [::std::mem::offset_of!(XC_EVENT_QUALS__bindgen_ty_1, q4) - 3usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_EVENT_QUALS"][::std::mem::size_of::<XC_EVENT_QUALS>() - 4usize];
    ["Alignment of XC_EVENT_QUALS"][::std::mem::align_of::<XC_EVENT_QUALS>() - 1usize];
    ["Offset of field: XC_EVENT_QUALS::xq_arr"]
        [::std::mem::offset_of!(XC_EVENT_QUALS, xq_arr) - 0usize];
    ["Offset of field: XC_EVENT_QUALS::xq_u32"]
        [::std::mem::offset_of!(XC_EVENT_QUALS, xq_u32) - 0usize];
    ["Offset of field: XC_EVENT_QUALS::quals"]
        [::std::mem::offset_of!(XC_EVENT_QUALS, quals) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_QUOTE_QUALS__bindgen_ty_1"]
        [::std::mem::size_of::<XC_QUOTE_QUALS__bindgen_ty_1>() - 4usize];
    ["Alignment of XC_QUOTE_QUALS__bindgen_ty_1"]
        [::std::mem::align_of::<XC_QUOTE_QUALS__bindgen_ty_1>() - 1usize];
    ["Offset of field: XC_QUOTE_QUALS__bindgen_ty_1::qq1"]
        [::std::mem::offset_of!(XC_QUOTE_QUALS__bindgen_ty_1, qq1) - 0usize];
    ["Offset of field: XC_QUOTE_QUALS__bindgen_ty_1::qq2"]
        [::std::mem::offset_of!(XC_QUOTE_QUALS__bindgen_ty_1, qq2) - 1usize];
    ["Offset of field: XC_QUOTE_QUALS__bindgen_ty_1::qq3"]
        [::std::mem::offset_of!(XC_QUOTE_QUALS__bindgen_ty_1, qq3) - 2usize];
    ["Offset of field: XC_QUOTE_QUALS__bindgen_ty_1::qq4"]
        [::std::mem::offset_of!(XC_QUOTE_QUALS__bindgen_ty_1, qq4) - 3usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_QUOTE_QUALS"][::std::mem::size_of::<XC_QUOTE_QUALS>() - 4usize];
    ["Alignment of XC_QUOTE_QUALS"][::std::mem::align_of::<XC_QUOTE_QUALS>() - 1usize];
    ["Offset of field: XC_QUOTE_QUALS::xqq_arr"]
        [::std::mem::offset_of!(XC_QUOTE_QUALS, xqq_arr) - 0usize];
    ["Offset of field: XC_QUOTE_QUALS::xqq_u32"]
        [::std::mem::offset_of!(XC_QUOTE_QUALS, xqq_u32) - 0usize];
    ["Offset of field: XC_QUOTE_QUALS::quals"]
        [::std::mem::offset_of!(XC_QUOTE_QUALS, quals) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_TRADE_QUALS__bindgen_ty_1"]
        [::std::mem::size_of::<XC_TRADE_QUALS__bindgen_ty_1>() - 4usize];
    ["Alignment of XC_TRADE_QUALS__bindgen_ty_1"]
        [::std::mem::align_of::<XC_TRADE_QUALS__bindgen_ty_1>() - 1usize];
    ["Offset of field: XC_TRADE_QUALS__bindgen_ty_1::tq1"]
        [::std::mem::offset_of!(XC_TRADE_QUALS__bindgen_ty_1, tq1) - 0usize];
    ["Offset of field: XC_TRADE_QUALS__bindgen_ty_1::tq2"]
        [::std::mem::offset_of!(XC_TRADE_QUALS__bindgen_ty_1, tq2) - 1usize];
    ["Offset of field: XC_TRADE_QUALS__bindgen_ty_1::tq3"]
        [::std::mem::offset_of!(XC_TRADE_QUALS__bindgen_ty_1, tq3) - 2usize];
    ["Offset of field: XC_TRADE_QUALS__bindgen_ty_1::tq4"]
        [::std::mem::offset_of!(XC_TRADE_QUALS__bindgen_ty_1, tq4) - 3usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_TRADE_QUALS"][::std::mem::size_of::<XC_TRADE_QUALS>() - 4usize];
    ["Alignment of XC_TRADE_QUALS"][::std::mem::align_of::<XC_TRADE_QUALS>() - 1usize];
    ["Offset of field: XC_TRADE_QUALS::xtq_arr"]
        [::std::mem::offset_of!(XC_TRADE_QUALS, xtq_arr) - 0usize];
    ["Offset of field: XC_TRADE_QUALS::xtq_u32"]
        [::std::mem::offset_of!(XC_TRADE_QUALS, xtq_u32) - 0usize];
    ["Offset of field: XC_TRADE_QUALS::quals"]
        [::std::mem::offset_of!(XC_TRADE_QUALS, quals) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_REFRESH_QUALS__bindgen_ty_1"]
        [::std::mem::size_of::<XC_REFRESH_QUALS__bindgen_ty_1>() - 4usize];
    ["Alignment of XC_REFRESH_QUALS__bindgen_ty_1"]
        [::std::mem::align_of::<XC_REFRESH_QUALS__bindgen_ty_1>() - 1usize];
    ["Offset of field: XC_REFRESH_QUALS__bindgen_ty_1::rq1"]
        [::std::mem::offset_of!(XC_REFRESH_QUALS__bindgen_ty_1, rq1) - 0usize];
    ["Offset of field: XC_REFRESH_QUALS__bindgen_ty_1::rq2"]
        [::std::mem::offset_of!(XC_REFRESH_QUALS__bindgen_ty_1, rq2) - 1usize];
    ["Offset of field: XC_REFRESH_QUALS__bindgen_ty_1::rq3"]
        [::std::mem::offset_of!(XC_REFRESH_QUALS__bindgen_ty_1, rq3) - 2usize];
    ["Offset of field: XC_REFRESH_QUALS__bindgen_ty_1::rq4"]
        [::std::mem::offset_of!(XC_REFRESH_QUALS__bindgen_ty_1, rq4) - 3usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_REFRESH_QUALS"][::std::mem::size_of::<XC_REFRESH_QUALS>() - 4usize];
    ["Alignment of XC_REFRESH_QUALS"][::std::mem::align_of::<XC_REFRESH_QUALS>() - 1usize];
    ["Offset of field: XC_REFRESH_QUALS::xrq_arr"]
        [::std::mem::offset_of!(XC_REFRESH_QUALS, xrq_arr) - 0usize];
    ["Offset of field: XC_REFRESH_QUALS::xrq_u32"]
        [::std::mem::offset_of!(XC_REFRESH_QUALS, xrq_u32) - 0usize];
    ["Offset of field: XC_REFRESH_QUALS::quals"]
        [::std::mem::offset_of!(XC_REFRESH_QUALS, quals) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_INDICATIVE_QUALS__bindgen_ty_1"]
        [::std::mem::size_of::<XC_INDICATIVE_QUALS__bindgen_ty_1>() - 4usize];
    ["Alignment of XC_INDICATIVE_QUALS__bindgen_ty_1"]
        [::std::mem::align_of::<XC_INDICATIVE_QUALS__bindgen_ty_1>() - 1usize];
    ["Offset of field: XC_INDICATIVE_QUALS__bindgen_ty_1::iq1"]
        [::std::mem::offset_of!(XC_INDICATIVE_QUALS__bindgen_ty_1, iq1) - 0usize];
    ["Offset of field: XC_INDICATIVE_QUALS__bindgen_ty_1::iq2"]
        [::std::mem::offset_of!(XC_INDICATIVE_QUALS__bindgen_ty_1, iq2) - 1usize];
    ["Offset of field: XC_INDICATIVE_QUALS__bindgen_ty_1::iq3"]
        [::std::mem::offset_of!(XC_INDICATIVE_QUALS__bindgen_ty_1, iq3) - 2usize];
    ["Offset of field: XC_INDICATIVE_QUALS__bindgen_ty_1::iq4"]
        [::std::mem::offset_of!(XC_INDICATIVE_QUALS__bindgen_ty_1, iq4) - 3usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_INDICATIVE_QUALS"][::std::mem::size_of::<XC_INDICATIVE_QUALS>() - 4usize];
    ["Alignment of XC_INDICATIVE_QUALS"][::std::mem::align_of::<XC_INDICATIVE_QUALS>() - 1usize];
    ["Offset of field: XC_INDICATIVE_QUALS::xiq_arr"]
        [::std::mem::offset_of!(XC_INDICATIVE_QUALS, xiq_arr) - 0usize];
    ["Offset of field: XC_INDICATIVE_QUALS::xiq_u32"]
        [::std::mem::offset_of!(XC_INDICATIVE_QUALS, xiq_u32) - 0usize];
    ["Offset of field: XC_INDICATIVE_QUALS::quals"]
        [::std::mem::offset_of!(XC_INDICATIVE_QUALS, quals) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_STAT_QUALS__bindgen_ty_1"]
        [::std::mem::size_of::<XC_STAT_QUALS__bindgen_ty_1>() - 4usize];
    ["Alignment of XC_STAT_QUALS__bindgen_ty_1"]
        [::std::mem::align_of::<XC_STAT_QUALS__bindgen_ty_1>() - 1usize];
    ["Offset of field: XC_STAT_QUALS__bindgen_ty_1::eq1"]
        [::std::mem::offset_of!(XC_STAT_QUALS__bindgen_ty_1, eq1) - 0usize];
    ["Offset of field: XC_STAT_QUALS__bindgen_ty_1::eq2"]
        [::std::mem::offset_of!(XC_STAT_QUALS__bindgen_ty_1, eq2) - 1usize];
    ["Offset of field: XC_STAT_QUALS__bindgen_ty_1::eq3"]
        [::std::mem::offset_of!(XC_STAT_QUALS__bindgen_ty_1, eq3) - 2usize];
    ["Offset of field: XC_STAT_QUALS__bindgen_ty_1::eq4"]
        [::std::mem::offset_of!(XC_STAT_QUALS__bindgen_ty_1, eq4) - 3usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_STAT_QUALS"][::std::mem::size_of::<XC_STAT_QUALS>() - 4usize];
    ["Alignment of XC_STAT_QUALS"][::std::mem::align_of::<XC_STAT_QUALS>() - 1usize];
    ["Offset of field: XC_STAT_QUALS::xeq_arr"]
        [::std::mem::offset_of!(XC_STAT_QUALS, xeq_arr) - 0usize];
    ["Offset of field: XC_STAT_QUALS::xeq_u32"]
        [::std::mem::offset_of!(XC_STAT_QUALS, xeq_u32) - 0usize];
    ["Offset of field: XC_STAT_QUALS::quals"]
        [::std::mem::offset_of!(XC_STAT_QUALS, quals) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_QUALIFIERS"][::std::mem::size_of::<XC_QUALIFIERS>() - 16usize];
    ["Alignment of XC_QUALIFIERS"][::std::mem::align_of::<XC_QUALIFIERS>() - 1usize];
    ["Offset of field: XC_QUALIFIERS::entries"]
        [::std::mem::offset_of!(XC_QUALIFIERS, entries) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_QUOTE_QUALIFIERS"][::std::mem::size_of::<XC_QUOTE_QUALIFIERS>() - 16usize];
    ["Alignment of XC_QUOTE_QUALIFIERS"][::std::mem::align_of::<XC_QUOTE_QUALIFIERS>() - 1usize];
    ["Offset of field: XC_QUOTE_QUALIFIERS::entries"]
        [::std::mem::offset_of!(XC_QUOTE_QUALIFIERS, entries) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_TRADE_QUALIFIERS"][::std::mem::size_of::<XC_TRADE_QUALIFIERS>() - 16usize];
    ["Alignment of XC_TRADE_QUALIFIERS"][::std::mem::align_of::<XC_TRADE_QUALIFIERS>() - 1usize];
    ["Offset of field: XC_TRADE_QUALIFIERS::entries"]
        [::std::mem::offset_of!(XC_TRADE_QUALIFIERS, entries) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_REFRESH_QUALIFIERS"][::std::mem::size_of::<XC_REFRESH_QUALIFIERS>() - 16usize];
    ["Alignment of XC_REFRESH_QUALIFIERS"]
        [::std::mem::align_of::<XC_REFRESH_QUALIFIERS>() - 1usize];
    ["Offset of field: XC_REFRESH_QUALIFIERS::entries"]
        [::std::mem::offset_of!(XC_REFRESH_QUALIFIERS, entries) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_INDICATIVE_QUALIFIERS"]
        [::std::mem::size_of::<XC_INDICATIVE_QUALIFIERS>() - 16usize];
    ["Alignment of XC_INDICATIVE_QUALIFIERS"]
        [::std::mem::align_of::<XC_INDICATIVE_QUALIFIERS>() - 1usize];
    ["Offset of field: XC_INDICATIVE_QUALIFIERS::entries"]
        [::std::mem::offset_of!(XC_INDICATIVE_QUALIFIERS, entries) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_TICK_FLAGS"][::std::mem::size_of::<XC_TICK_FLAGS>() - 1usize];
    ["Alignment of XC_TICK_FLAGS"][::std::mem::align_of::<XC_TICK_FLAGS>() - 1usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_TS_REQUEST_TYPE"][::std::mem::size_of::<XC_TS_REQUEST_TYPE>() - 2usize];
    ["Alignment of XC_TS_REQUEST_TYPE"][::std::mem::align_of::<XC_TS_REQUEST_TYPE>() - 1usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_FINANCIAL_STATUS"][::std::mem::size_of::<XC_FINANCIAL_STATUS>() - 1usize];
    ["Alignment of XC_FINANCIAL_STATUS"][::std::mem::align_of::<XC_FINANCIAL_STATUS>() - 1usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_CC_FLAGS"][::std::mem::size_of::<XC_CC_FLAGS>() - 1usize];
    ["Alignment of XC_CC_FLAGS"][::std::mem::align_of::<XC_CC_FLAGS>() - 1usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_TRADING_STATE__bindgen_ty_1"]
        [::std::mem::size_of::<XC_TRADING_STATE__bindgen_ty_1>() - 1usize];
    ["Alignment of XC_TRADING_STATE__bindgen_ty_1"]
        [::std::mem::align_of::<XC_TRADING_STATE__bindgen_ty_1>() - 1usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_TRADING_STATE"][::std::mem::size_of::<XC_TRADING_STATE>() - 1usize];
    ["Alignment of XC_TRADING_STATE"][::std::mem::align_of::<XC_TRADING_STATE>() - 1usize];
    ["Offset of field: XC_TRADING_STATE::u8_"]
        [::std::mem::offset_of!(XC_TRADING_STATE, u8_) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_GROUP_EVENT_COMMON"][::std::mem::size_of::<XC_GROUP_EVENT_COMMON>() - 40usize];
    ["Alignment of XC_GROUP_EVENT_COMMON"]
        [::std::mem::align_of::<XC_GROUP_EVENT_COMMON>() - 1usize];
    ["Offset of field: XC_GROUP_EVENT_COMMON::xev_exchange_code"]
        [::std::mem::offset_of!(XC_GROUP_EVENT_COMMON, xev_exchange_code) - 0usize];
    ["Offset of field: XC_GROUP_EVENT_COMMON::xev_country_code"]
        [::std::mem::offset_of!(XC_GROUP_EVENT_COMMON, xev_country_code) - 2usize];
    ["Offset of field: XC_GROUP_EVENT_COMMON::xev_symbol_type"]
        [::std::mem::offset_of!(XC_GROUP_EVENT_COMMON, xev_symbol_type) - 5usize];
    ["Offset of field: XC_GROUP_EVENT_COMMON::xev_line_id"]
        [::std::mem::offset_of!(XC_GROUP_EVENT_COMMON, xev_line_id) - 6usize];
    ["Offset of field: XC_GROUP_EVENT_COMMON::xev_quals"]
        [::std::mem::offset_of!(XC_GROUP_EVENT_COMMON, xev_quals) - 8usize];
    ["Offset of field: XC_GROUP_EVENT_COMMON::xev_instrument_status"]
        [::std::mem::offset_of!(XC_GROUP_EVENT_COMMON, xev_instrument_status) - 12usize];
    ["Offset of field: XC_GROUP_EVENT_COMMON::xev_market_status"]
        [::std::mem::offset_of!(XC_GROUP_EVENT_COMMON, xev_market_status) - 13usize];
    ["Offset of field: XC_GROUP_EVENT_COMMON::XEV_RESERVED_02"]
        [::std::mem::offset_of!(XC_GROUP_EVENT_COMMON, XEV_RESERVED_02) - 15usize];
    ["Offset of field: XC_GROUP_EVENT_COMMON::xev_exchange_hitime"]
        [::std::mem::offset_of!(XC_GROUP_EVENT_COMMON, xev_exchange_hitime) - 16usize];
    ["Offset of field: XC_GROUP_EVENT_COMMON::xev_receive_hitime"]
        [::std::mem::offset_of!(XC_GROUP_EVENT_COMMON, xev_receive_hitime) - 24usize];
    ["Offset of field: XC_GROUP_EVENT_COMMON::xev_sequence"]
        [::std::mem::offset_of!(XC_GROUP_EVENT_COMMON, xev_sequence) - 32usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_GROUP_EVENT_TIMING"][::std::mem::size_of::<XC_GROUP_EVENT_TIMING>() - 64usize];
    ["Alignment of XC_GROUP_EVENT_TIMING"]
        [::std::mem::align_of::<XC_GROUP_EVENT_TIMING>() - 1usize];
    ["Offset of field: XC_GROUP_EVENT_TIMING::xtev_sequence"]
        [::std::mem::offset_of!(XC_GROUP_EVENT_TIMING, xtev_sequence) - 0usize];
    ["Offset of field: XC_GROUP_EVENT_TIMING::xtev_exchange_hitime"]
        [::std::mem::offset_of!(XC_GROUP_EVENT_TIMING, xtev_exchange_hitime) - 8usize];
    ["Offset of field: XC_GROUP_EVENT_TIMING::xtev_receive_hitime"]
        [::std::mem::offset_of!(XC_GROUP_EVENT_TIMING, xtev_receive_hitime) - 16usize];
    ["Offset of field: XC_GROUP_EVENT_TIMING::xtev_transmit_hitime"]
        [::std::mem::offset_of!(XC_GROUP_EVENT_TIMING, xtev_transmit_hitime) - 24usize];
    ["Offset of field: XC_GROUP_EVENT_TIMING::xtev_xcapi_receive_hitime"]
        [::std::mem::offset_of!(XC_GROUP_EVENT_TIMING, xtev_xcapi_receive_hitime) - 32usize];
    ["Offset of field: XC_GROUP_EVENT_TIMING::xtev_xcapi_callback_hitime"]
        [::std::mem::offset_of!(XC_GROUP_EVENT_TIMING, xtev_xcapi_callback_hitime) - 40usize];
    ["Offset of field: XC_GROUP_EVENT_TIMING::XTEV_RESERVED_00"]
        [::std::mem::offset_of!(XC_GROUP_EVENT_TIMING, XTEV_RESERVED_00) - 48usize];
    ["Offset of field: XC_GROUP_EVENT_TIMING::XTEV_RESERVED_01"]
        [::std::mem::offset_of!(XC_GROUP_EVENT_TIMING, XTEV_RESERVED_01) - 56usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_GROUP_EQUITY_QUOTE"][::std::mem::size_of::<XC_GROUP_EQUITY_QUOTE>() - 24usize];
    ["Alignment of XC_GROUP_EQUITY_QUOTE"]
        [::std::mem::align_of::<XC_GROUP_EQUITY_QUOTE>() - 1usize];
    ["Offset of field: XC_GROUP_EQUITY_QUOTE::XCQ_RESERVED_00"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_QUOTE, XCQ_RESERVED_00) - 0usize];
    ["Offset of field: XC_GROUP_EQUITY_QUOTE::xcq_bid_exch"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_QUOTE, xcq_bid_exch) - 2usize];
    ["Offset of field: XC_GROUP_EQUITY_QUOTE::xcq_bid_price"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_QUOTE, xcq_bid_price) - 4usize];
    ["Offset of field: XC_GROUP_EQUITY_QUOTE::xcq_bid_size"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_QUOTE, xcq_bid_size) - 8usize];
    ["Offset of field: XC_GROUP_EQUITY_QUOTE::xcq_bid_tick_flags"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_QUOTE, xcq_bid_tick_flags) - 12usize];
    ["Offset of field: XC_GROUP_EQUITY_QUOTE::XCQ_RESERVED_01"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_QUOTE, XCQ_RESERVED_01) - 13usize];
    ["Offset of field: XC_GROUP_EQUITY_QUOTE::xcq_ask_exch"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_QUOTE, xcq_ask_exch) - 14usize];
    ["Offset of field: XC_GROUP_EQUITY_QUOTE::xcq_ask_price"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_QUOTE, xcq_ask_price) - 16usize];
    ["Offset of field: XC_GROUP_EQUITY_QUOTE::xcq_ask_size"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_QUOTE, xcq_ask_size) - 20usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_GROUP_EQUITY_QUOTE_ALL"]
        [::std::mem::size_of::<XC_GROUP_EQUITY_QUOTE_ALL>() - 64usize];
    ["Alignment of XC_GROUP_EQUITY_QUOTE_ALL"]
        [::std::mem::align_of::<XC_GROUP_EQUITY_QUOTE_ALL>() - 1usize];
    ["Offset of field: XC_GROUP_EQUITY_QUOTE_ALL::xcq_exchange_code"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_QUOTE_ALL, xcq_exchange_code) - 0usize];
    ["Offset of field: XC_GROUP_EQUITY_QUOTE_ALL::xcq_country_code"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_QUOTE_ALL, xcq_country_code) - 2usize];
    ["Offset of field: XC_GROUP_EQUITY_QUOTE_ALL::xcq_symbol_type"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_QUOTE_ALL, xcq_symbol_type) - 5usize];
    ["Offset of field: XC_GROUP_EQUITY_QUOTE_ALL::xcq_line_id"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_QUOTE_ALL, xcq_line_id) - 6usize];
    ["Offset of field: XC_GROUP_EQUITY_QUOTE_ALL::xcq_quals"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_QUOTE_ALL, xcq_quals) - 8usize];
    ["Offset of field: XC_GROUP_EQUITY_QUOTE_ALL::xcq_instrument_status"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_QUOTE_ALL, xcq_instrument_status) - 12usize];
    ["Offset of field: XC_GROUP_EQUITY_QUOTE_ALL::xcq_market_status"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_QUOTE_ALL, xcq_market_status) - 13usize];
    ["Offset of field: XC_GROUP_EQUITY_QUOTE_ALL::XCQ_RESERVED_02"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_QUOTE_ALL, XCQ_RESERVED_02) - 15usize];
    ["Offset of field: XC_GROUP_EQUITY_QUOTE_ALL::xcq_exchange_hitime"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_QUOTE_ALL, xcq_exchange_hitime) - 16usize];
    ["Offset of field: XC_GROUP_EQUITY_QUOTE_ALL::xcq_receive_hitime"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_QUOTE_ALL, xcq_receive_hitime) - 24usize];
    ["Offset of field: XC_GROUP_EQUITY_QUOTE_ALL::xcq_sequence"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_QUOTE_ALL, xcq_sequence) - 32usize];
    ["Offset of field: XC_GROUP_EQUITY_QUOTE_ALL::XCQ_RESERVED_03"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_QUOTE_ALL, XCQ_RESERVED_03) - 40usize];
    ["Offset of field: XC_GROUP_EQUITY_QUOTE_ALL::xcq_bid_exch"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_QUOTE_ALL, xcq_bid_exch) - 42usize];
    ["Offset of field: XC_GROUP_EQUITY_QUOTE_ALL::xcq_bid_price"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_QUOTE_ALL, xcq_bid_price) - 44usize];
    ["Offset of field: XC_GROUP_EQUITY_QUOTE_ALL::xcq_bid_size"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_QUOTE_ALL, xcq_bid_size) - 48usize];
    ["Offset of field: XC_GROUP_EQUITY_QUOTE_ALL::xcq_bid_tick_flags"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_QUOTE_ALL, xcq_bid_tick_flags) - 52usize];
    ["Offset of field: XC_GROUP_EQUITY_QUOTE_ALL::XCQ_RESERVED_04"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_QUOTE_ALL, XCQ_RESERVED_04) - 53usize];
    ["Offset of field: XC_GROUP_EQUITY_QUOTE_ALL::xcq_ask_exch"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_QUOTE_ALL, xcq_ask_exch) - 54usize];
    ["Offset of field: XC_GROUP_EQUITY_QUOTE_ALL::xcq_ask_price"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_QUOTE_ALL, xcq_ask_price) - 56usize];
    ["Offset of field: XC_GROUP_EQUITY_QUOTE_ALL::xcq_ask_size"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_QUOTE_ALL, xcq_ask_size) - 60usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_GROUP_EQUITY_QUOTE_WITH_CPMVOL_ALL"]
        [::std::mem::size_of::<XC_GROUP_EQUITY_QUOTE_WITH_CPMVOL_ALL>() - 88usize];
    ["Alignment of XC_GROUP_EQUITY_QUOTE_WITH_CPMVOL_ALL"]
        [::std::mem::align_of::<XC_GROUP_EQUITY_QUOTE_WITH_CPMVOL_ALL>() - 1usize];
    ["Offset of field: XC_GROUP_EQUITY_QUOTE_WITH_CPMVOL_ALL::xcq_exchange_code"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_QUOTE_WITH_CPMVOL_ALL, xcq_exchange_code) - 0usize];
    ["Offset of field: XC_GROUP_EQUITY_QUOTE_WITH_CPMVOL_ALL::xcq_country_code"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_QUOTE_WITH_CPMVOL_ALL, xcq_country_code) - 2usize];
    ["Offset of field: XC_GROUP_EQUITY_QUOTE_WITH_CPMVOL_ALL::xcq_symbol_type"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_QUOTE_WITH_CPMVOL_ALL, xcq_symbol_type) - 5usize];
    ["Offset of field: XC_GROUP_EQUITY_QUOTE_WITH_CPMVOL_ALL::xcq_line_id"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_QUOTE_WITH_CPMVOL_ALL, xcq_line_id) - 6usize];
    ["Offset of field: XC_GROUP_EQUITY_QUOTE_WITH_CPMVOL_ALL::xcq_quals"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_QUOTE_WITH_CPMVOL_ALL, xcq_quals) - 8usize];
    ["Offset of field: XC_GROUP_EQUITY_QUOTE_WITH_CPMVOL_ALL::xcq_instrument_status"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_QUOTE_WITH_CPMVOL_ALL,
        xcq_instrument_status
    ) - 12usize];
    ["Offset of field: XC_GROUP_EQUITY_QUOTE_WITH_CPMVOL_ALL::xcq_market_status"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_QUOTE_WITH_CPMVOL_ALL,
        xcq_market_status
    ) - 13usize];
    ["Offset of field: XC_GROUP_EQUITY_QUOTE_WITH_CPMVOL_ALL::XCQ_RESERVED_02"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_QUOTE_WITH_CPMVOL_ALL, XCQ_RESERVED_02) - 15usize];
    ["Offset of field: XC_GROUP_EQUITY_QUOTE_WITH_CPMVOL_ALL::xcq_exchange_hitime"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_QUOTE_WITH_CPMVOL_ALL,
        xcq_exchange_hitime
    ) - 16usize];
    ["Offset of field: XC_GROUP_EQUITY_QUOTE_WITH_CPMVOL_ALL::xcq_receive_hitime"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_QUOTE_WITH_CPMVOL_ALL,
        xcq_receive_hitime
    ) - 24usize];
    ["Offset of field: XC_GROUP_EQUITY_QUOTE_WITH_CPMVOL_ALL::xcq_sequence"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_QUOTE_WITH_CPMVOL_ALL, xcq_sequence) - 32usize];
    ["Offset of field: XC_GROUP_EQUITY_QUOTE_WITH_CPMVOL_ALL::XCQ_RESERVED_03"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_QUOTE_WITH_CPMVOL_ALL, XCQ_RESERVED_03) - 40usize];
    ["Offset of field: XC_GROUP_EQUITY_QUOTE_WITH_CPMVOL_ALL::xcq_bid_exch"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_QUOTE_WITH_CPMVOL_ALL, xcq_bid_exch) - 42usize];
    ["Offset of field: XC_GROUP_EQUITY_QUOTE_WITH_CPMVOL_ALL::xcq_bid_price"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_QUOTE_WITH_CPMVOL_ALL, xcq_bid_price) - 44usize];
    ["Offset of field: XC_GROUP_EQUITY_QUOTE_WITH_CPMVOL_ALL::xcq_bid_size"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_QUOTE_WITH_CPMVOL_ALL, xcq_bid_size) - 48usize];
    ["Offset of field: XC_GROUP_EQUITY_QUOTE_WITH_CPMVOL_ALL::xcq_bid_tick_flags"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_QUOTE_WITH_CPMVOL_ALL,
        xcq_bid_tick_flags
    ) - 52usize];
    ["Offset of field: XC_GROUP_EQUITY_QUOTE_WITH_CPMVOL_ALL::XCQ_RESERVED_04"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_QUOTE_WITH_CPMVOL_ALL, XCQ_RESERVED_04) - 53usize];
    ["Offset of field: XC_GROUP_EQUITY_QUOTE_WITH_CPMVOL_ALL::xcq_ask_exch"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_QUOTE_WITH_CPMVOL_ALL, xcq_ask_exch) - 54usize];
    ["Offset of field: XC_GROUP_EQUITY_QUOTE_WITH_CPMVOL_ALL::xcq_ask_price"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_QUOTE_WITH_CPMVOL_ALL, xcq_ask_price) - 56usize];
    ["Offset of field: XC_GROUP_EQUITY_QUOTE_WITH_CPMVOL_ALL::xcq_ask_size"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_QUOTE_WITH_CPMVOL_ALL, xcq_ask_size) - 60usize];
    ["Offset of field: XC_GROUP_EQUITY_QUOTE_WITH_CPMVOL_ALL::xcq_bid_customer_size"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_QUOTE_WITH_CPMVOL_ALL,
        xcq_bid_customer_size
    ) - 64usize];
    ["Offset of field: XC_GROUP_EQUITY_QUOTE_WITH_CPMVOL_ALL::xcq_bid_professional_size"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_QUOTE_WITH_CPMVOL_ALL,
        xcq_bid_professional_size
    )
        - 68usize];
    ["Offset of field: XC_GROUP_EQUITY_QUOTE_WITH_CPMVOL_ALL::xcq_bid_market_maker_size"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_QUOTE_WITH_CPMVOL_ALL,
        xcq_bid_market_maker_size
    )
        - 72usize];
    ["Offset of field: XC_GROUP_EQUITY_QUOTE_WITH_CPMVOL_ALL::xcq_ask_customer_size"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_QUOTE_WITH_CPMVOL_ALL,
        xcq_ask_customer_size
    ) - 76usize];
    ["Offset of field: XC_GROUP_EQUITY_QUOTE_WITH_CPMVOL_ALL::xcq_ask_professional_size"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_QUOTE_WITH_CPMVOL_ALL,
        xcq_ask_professional_size
    )
        - 80usize];
    ["Offset of field: XC_GROUP_EQUITY_QUOTE_WITH_CPMVOL_ALL::xcq_ask_market_maker_size"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_QUOTE_WITH_CPMVOL_ALL,
        xcq_ask_market_maker_size
    )
        - 84usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_GROUP_EQUITY_TRADE"][::std::mem::size_of::<XC_GROUP_EQUITY_TRADE>() - 16usize];
    ["Alignment of XC_GROUP_EQUITY_TRADE"]
        [::std::mem::align_of::<XC_GROUP_EQUITY_TRADE>() - 1usize];
    ["Offset of field: XC_GROUP_EQUITY_TRADE::XCT_RESERVED_00"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_TRADE, XCT_RESERVED_00) - 0usize];
    ["Offset of field: XC_GROUP_EQUITY_TRADE::xct_sub_market"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_TRADE, xct_sub_market) - 4usize];
    ["Offset of field: XC_GROUP_EQUITY_TRADE::XCT_RESERVED_01"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_TRADE, XCT_RESERVED_01) - 6usize];
    ["Offset of field: XC_GROUP_EQUITY_TRADE::xct_price"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_TRADE, xct_price) - 8usize];
    ["Offset of field: XC_GROUP_EQUITY_TRADE::xct_size"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_TRADE, xct_size) - 12usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_GROUP_EQUITY_TRADE_ACCUM"]
        [::std::mem::size_of::<XC_GROUP_EQUITY_TRADE_ACCUM>() - 40usize];
    ["Alignment of XC_GROUP_EQUITY_TRADE_ACCUM"]
        [::std::mem::align_of::<XC_GROUP_EQUITY_TRADE_ACCUM>() - 1usize];
    ["Offset of field: XC_GROUP_EQUITY_TRADE_ACCUM::xct_close_price"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_TRADE_ACCUM, xct_close_price) - 0usize];
    ["Offset of field: XC_GROUP_EQUITY_TRADE_ACCUM::xct_trade_tick_flags"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_TRADE_ACCUM, xct_trade_tick_flags) - 4usize];
    ["Offset of field: XC_GROUP_EQUITY_TRADE_ACCUM::XCT_RESERVED_00"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_TRADE_ACCUM, XCT_RESERVED_00) - 5usize];
    ["Offset of field: XC_GROUP_EQUITY_TRADE_ACCUM::XCT_RESERVED_01"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_TRADE_ACCUM, XCT_RESERVED_01) - 6usize];
    ["Offset of field: XC_GROUP_EQUITY_TRADE_ACCUM::xct_volume"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_TRADE_ACCUM, xct_volume) - 8usize];
    ["Offset of field: XC_GROUP_EQUITY_TRADE_ACCUM::xct_vwap_volume"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_TRADE_ACCUM, xct_vwap_volume) - 12usize];
    ["Offset of field: XC_GROUP_EQUITY_TRADE_ACCUM::xct_traded_value"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_TRADE_ACCUM, xct_traded_value) - 16usize];
    ["Offset of field: XC_GROUP_EQUITY_TRADE_ACCUM::xct_open_price"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_TRADE_ACCUM, xct_open_price) - 24usize];
    ["Offset of field: XC_GROUP_EQUITY_TRADE_ACCUM::xct_total_change"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_TRADE_ACCUM, xct_total_change) - 28usize];
    ["Offset of field: XC_GROUP_EQUITY_TRADE_ACCUM::xct_high_price"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_TRADE_ACCUM, xct_high_price) - 32usize];
    ["Offset of field: XC_GROUP_EQUITY_TRADE_ACCUM::xct_low_price"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_TRADE_ACCUM, xct_low_price) - 36usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_GROUP_EQUITY_TRADE_ALL"]
        [::std::mem::size_of::<XC_GROUP_EQUITY_TRADE_ALL>() - 96usize];
    ["Alignment of XC_GROUP_EQUITY_TRADE_ALL"]
        [::std::mem::align_of::<XC_GROUP_EQUITY_TRADE_ALL>() - 1usize];
    ["Offset of field: XC_GROUP_EQUITY_TRADE_ALL::xct_exchange_code"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_TRADE_ALL, xct_exchange_code) - 0usize];
    ["Offset of field: XC_GROUP_EQUITY_TRADE_ALL::xct_country_code"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_TRADE_ALL, xct_country_code) - 2usize];
    ["Offset of field: XC_GROUP_EQUITY_TRADE_ALL::xct_symbol_type"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_TRADE_ALL, xct_symbol_type) - 5usize];
    ["Offset of field: XC_GROUP_EQUITY_TRADE_ALL::xct_line_id"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_TRADE_ALL, xct_line_id) - 6usize];
    ["Offset of field: XC_GROUP_EQUITY_TRADE_ALL::xct_quals"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_TRADE_ALL, xct_quals) - 8usize];
    ["Offset of field: XC_GROUP_EQUITY_TRADE_ALL::xct_instrument_status"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_TRADE_ALL, xct_instrument_status) - 12usize];
    ["Offset of field: XC_GROUP_EQUITY_TRADE_ALL::xct_market_status"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_TRADE_ALL, xct_market_status) - 13usize];
    ["Offset of field: XC_GROUP_EQUITY_TRADE_ALL::XCT_RESERVED_02"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_TRADE_ALL, XCT_RESERVED_02) - 15usize];
    ["Offset of field: XC_GROUP_EQUITY_TRADE_ALL::xct_exchange_hitime"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_TRADE_ALL, xct_exchange_hitime) - 16usize];
    ["Offset of field: XC_GROUP_EQUITY_TRADE_ALL::xct_receive_hitime"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_TRADE_ALL, xct_receive_hitime) - 24usize];
    ["Offset of field: XC_GROUP_EQUITY_TRADE_ALL::xct_sequence"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_TRADE_ALL, xct_sequence) - 32usize];
    ["Offset of field: XC_GROUP_EQUITY_TRADE_ALL::XCT_RESERVED_03"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_TRADE_ALL, XCT_RESERVED_03) - 40usize];
    ["Offset of field: XC_GROUP_EQUITY_TRADE_ALL::XCT_RESERVED_05"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_TRADE_ALL, XCT_RESERVED_05) - 42usize];
    ["Offset of field: XC_GROUP_EQUITY_TRADE_ALL::xct_sub_market"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_TRADE_ALL, xct_sub_market) - 44usize];
    ["Offset of field: XC_GROUP_EQUITY_TRADE_ALL::XCT_RESERVED_06"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_TRADE_ALL, XCT_RESERVED_06) - 46usize];
    ["Offset of field: XC_GROUP_EQUITY_TRADE_ALL::xct_price"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_TRADE_ALL, xct_price) - 48usize];
    ["Offset of field: XC_GROUP_EQUITY_TRADE_ALL::xct_size"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_TRADE_ALL, xct_size) - 52usize];
    ["Offset of field: XC_GROUP_EQUITY_TRADE_ALL::xct_close_price"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_TRADE_ALL, xct_close_price) - 56usize];
    ["Offset of field: XC_GROUP_EQUITY_TRADE_ALL::xct_trade_tick_flags"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_TRADE_ALL, xct_trade_tick_flags) - 60usize];
    ["Offset of field: XC_GROUP_EQUITY_TRADE_ALL::XCT_RESERVED_07"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_TRADE_ALL, XCT_RESERVED_07) - 61usize];
    ["Offset of field: XC_GROUP_EQUITY_TRADE_ALL::XCT_RESERVED_08"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_TRADE_ALL, XCT_RESERVED_08) - 62usize];
    ["Offset of field: XC_GROUP_EQUITY_TRADE_ALL::xct_volume"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_TRADE_ALL, xct_volume) - 64usize];
    ["Offset of field: XC_GROUP_EQUITY_TRADE_ALL::xct_vwap_volume"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_TRADE_ALL, xct_vwap_volume) - 68usize];
    ["Offset of field: XC_GROUP_EQUITY_TRADE_ALL::xct_traded_value"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_TRADE_ALL, xct_traded_value) - 72usize];
    ["Offset of field: XC_GROUP_EQUITY_TRADE_ALL::xct_open_price"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_TRADE_ALL, xct_open_price) - 80usize];
    ["Offset of field: XC_GROUP_EQUITY_TRADE_ALL::xct_total_change"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_TRADE_ALL, xct_total_change) - 84usize];
    ["Offset of field: XC_GROUP_EQUITY_TRADE_ALL::xct_high_price"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_TRADE_ALL, xct_high_price) - 88usize];
    ["Offset of field: XC_GROUP_EQUITY_TRADE_ALL::xct_low_price"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_TRADE_ALL, xct_low_price) - 92usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_GROUP_EQUITY_CANCEL_ALL"]
        [::std::mem::size_of::<XC_GROUP_EQUITY_CANCEL_ALL>() - 96usize];
    ["Alignment of XC_GROUP_EQUITY_CANCEL_ALL"]
        [::std::mem::align_of::<XC_GROUP_EQUITY_CANCEL_ALL>() - 1usize];
    ["Offset of field: XC_GROUP_EQUITY_CANCEL_ALL::xca_exchange_code"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_CANCEL_ALL, xca_exchange_code) - 0usize];
    ["Offset of field: XC_GROUP_EQUITY_CANCEL_ALL::xca_country_code"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_CANCEL_ALL, xca_country_code) - 2usize];
    ["Offset of field: XC_GROUP_EQUITY_CANCEL_ALL::xca_symbol_type"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_CANCEL_ALL, xca_symbol_type) - 5usize];
    ["Offset of field: XC_GROUP_EQUITY_CANCEL_ALL::xca_line_id"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_CANCEL_ALL, xca_line_id) - 6usize];
    ["Offset of field: XC_GROUP_EQUITY_CANCEL_ALL::xca_quals"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_CANCEL_ALL, xca_quals) - 8usize];
    ["Offset of field: XC_GROUP_EQUITY_CANCEL_ALL::xca_instrument_status"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_CANCEL_ALL, xca_instrument_status) - 12usize];
    ["Offset of field: XC_GROUP_EQUITY_CANCEL_ALL::xca_market_status"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_CANCEL_ALL, xca_market_status) - 13usize];
    ["Offset of field: XC_GROUP_EQUITY_CANCEL_ALL::XCA_RESERVED_02"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_CANCEL_ALL, XCA_RESERVED_02) - 15usize];
    ["Offset of field: XC_GROUP_EQUITY_CANCEL_ALL::xca_exchange_hitime"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_CANCEL_ALL, xca_exchange_hitime) - 16usize];
    ["Offset of field: XC_GROUP_EQUITY_CANCEL_ALL::xca_receive_hitime"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_CANCEL_ALL, xca_receive_hitime) - 24usize];
    ["Offset of field: XC_GROUP_EQUITY_CANCEL_ALL::xca_sequence"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_CANCEL_ALL, xca_sequence) - 32usize];
    ["Offset of field: XC_GROUP_EQUITY_CANCEL_ALL::XCA_RESERVED_03"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_CANCEL_ALL, XCA_RESERVED_03) - 40usize];
    ["Offset of field: XC_GROUP_EQUITY_CANCEL_ALL::XCA_RESERVED_05"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_CANCEL_ALL, XCA_RESERVED_05) - 42usize];
    ["Offset of field: XC_GROUP_EQUITY_CANCEL_ALL::xca_sub_market"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_CANCEL_ALL, xca_sub_market) - 44usize];
    ["Offset of field: XC_GROUP_EQUITY_CANCEL_ALL::XCA_RESERVED_06"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_CANCEL_ALL, XCA_RESERVED_06) - 46usize];
    ["Offset of field: XC_GROUP_EQUITY_CANCEL_ALL::xca_price"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_CANCEL_ALL, xca_price) - 48usize];
    ["Offset of field: XC_GROUP_EQUITY_CANCEL_ALL::xca_size"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_CANCEL_ALL, xca_size) - 52usize];
    ["Offset of field: XC_GROUP_EQUITY_CANCEL_ALL::xca_close_price"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_CANCEL_ALL, xca_close_price) - 56usize];
    ["Offset of field: XC_GROUP_EQUITY_CANCEL_ALL::xca_trade_tick_flags"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_CANCEL_ALL, xca_trade_tick_flags) - 60usize];
    ["Offset of field: XC_GROUP_EQUITY_CANCEL_ALL::XCA_RESERVED_07"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_CANCEL_ALL, XCA_RESERVED_07) - 61usize];
    ["Offset of field: XC_GROUP_EQUITY_CANCEL_ALL::XCA_RESERVED_08"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_CANCEL_ALL, XCA_RESERVED_08) - 62usize];
    ["Offset of field: XC_GROUP_EQUITY_CANCEL_ALL::xca_volume"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_CANCEL_ALL, xca_volume) - 64usize];
    ["Offset of field: XC_GROUP_EQUITY_CANCEL_ALL::xca_vwap_volume"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_CANCEL_ALL, xca_vwap_volume) - 68usize];
    ["Offset of field: XC_GROUP_EQUITY_CANCEL_ALL::xca_traded_value"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_CANCEL_ALL, xca_traded_value) - 72usize];
    ["Offset of field: XC_GROUP_EQUITY_CANCEL_ALL::xca_open_price"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_CANCEL_ALL, xca_open_price) - 80usize];
    ["Offset of field: XC_GROUP_EQUITY_CANCEL_ALL::xca_total_change"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_CANCEL_ALL, xca_total_change) - 84usize];
    ["Offset of field: XC_GROUP_EQUITY_CANCEL_ALL::xca_high_price"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_CANCEL_ALL, xca_high_price) - 88usize];
    ["Offset of field: XC_GROUP_EQUITY_CANCEL_ALL::xca_low_price"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_CANCEL_ALL, xca_low_price) - 92usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_GROUP_EQUITY_CORRECTION"]
        [::std::mem::size_of::<XC_GROUP_EQUITY_CORRECTION>() - 32usize];
    ["Alignment of XC_GROUP_EQUITY_CORRECTION"]
        [::std::mem::align_of::<XC_GROUP_EQUITY_CORRECTION>() - 1usize];
    ["Offset of field: XC_GROUP_EQUITY_CORRECTION::XCC_RESERVED_00"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_CORRECTION, XCC_RESERVED_00) - 0usize];
    ["Offset of field: XC_GROUP_EQUITY_CORRECTION::xcc_cancel_sub_market"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_CORRECTION, xcc_cancel_sub_market) - 4usize];
    ["Offset of field: XC_GROUP_EQUITY_CORRECTION::XCC_RESERVED_01"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_CORRECTION, XCC_RESERVED_01) - 6usize];
    ["Offset of field: XC_GROUP_EQUITY_CORRECTION::xcc_cancel_price"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_CORRECTION, xcc_cancel_price) - 8usize];
    ["Offset of field: XC_GROUP_EQUITY_CORRECTION::xcc_cancel_size"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_CORRECTION, xcc_cancel_size) - 12usize];
    ["Offset of field: XC_GROUP_EQUITY_CORRECTION::XCC_RESERVED_02"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_CORRECTION, XCC_RESERVED_02) - 16usize];
    ["Offset of field: XC_GROUP_EQUITY_CORRECTION::xcc_correct_sub_market"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_CORRECTION, xcc_correct_sub_market) - 20usize];
    ["Offset of field: XC_GROUP_EQUITY_CORRECTION::XCC_RESERVED_03"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_CORRECTION, XCC_RESERVED_03) - 22usize];
    ["Offset of field: XC_GROUP_EQUITY_CORRECTION::xcc_correct_price"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_CORRECTION, xcc_correct_price) - 24usize];
    ["Offset of field: XC_GROUP_EQUITY_CORRECTION::xcc_correct_size"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_CORRECTION, xcc_correct_size) - 28usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_GROUP_EQUITY_CORRECTION_ALL"]
        [::std::mem::size_of::<XC_GROUP_EQUITY_CORRECTION_ALL>() - 112usize];
    ["Alignment of XC_GROUP_EQUITY_CORRECTION_ALL"]
        [::std::mem::align_of::<XC_GROUP_EQUITY_CORRECTION_ALL>() - 1usize];
    ["Offset of field: XC_GROUP_EQUITY_CORRECTION_ALL::xcc_exchange_code"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_CORRECTION_ALL, xcc_exchange_code) - 0usize];
    ["Offset of field: XC_GROUP_EQUITY_CORRECTION_ALL::xcc_country_code"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_CORRECTION_ALL, xcc_country_code) - 2usize];
    ["Offset of field: XC_GROUP_EQUITY_CORRECTION_ALL::xcc_symbol_type"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_CORRECTION_ALL, xcc_symbol_type) - 5usize];
    ["Offset of field: XC_GROUP_EQUITY_CORRECTION_ALL::xcc_line_id"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_CORRECTION_ALL, xcc_line_id) - 6usize];
    ["Offset of field: XC_GROUP_EQUITY_CORRECTION_ALL::xcc_quals"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_CORRECTION_ALL, xcc_quals) - 8usize];
    ["Offset of field: XC_GROUP_EQUITY_CORRECTION_ALL::xcc_instrument_status"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_CORRECTION_ALL, xcc_instrument_status) - 12usize];
    ["Offset of field: XC_GROUP_EQUITY_CORRECTION_ALL::xcc_market_status"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_CORRECTION_ALL, xcc_market_status) - 13usize];
    ["Offset of field: XC_GROUP_EQUITY_CORRECTION_ALL::XCC_RESERVED_02"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_CORRECTION_ALL, XCC_RESERVED_02) - 15usize];
    ["Offset of field: XC_GROUP_EQUITY_CORRECTION_ALL::xcc_exchange_hitime"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_CORRECTION_ALL, xcc_exchange_hitime) - 16usize];
    ["Offset of field: XC_GROUP_EQUITY_CORRECTION_ALL::xcc_receive_hitime"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_CORRECTION_ALL, xcc_receive_hitime) - 24usize];
    ["Offset of field: XC_GROUP_EQUITY_CORRECTION_ALL::xcc_sequence"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_CORRECTION_ALL, xcc_sequence) - 32usize];
    ["Offset of field: XC_GROUP_EQUITY_CORRECTION_ALL::XCC_RESERVED_03"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_CORRECTION_ALL, XCC_RESERVED_03) - 40usize];
    ["Offset of field: XC_GROUP_EQUITY_CORRECTION_ALL::XCC_RESERVED_05"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_CORRECTION_ALL, XCC_RESERVED_05) - 42usize];
    ["Offset of field: XC_GROUP_EQUITY_CORRECTION_ALL::xcc_cancel_sub_market"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_CORRECTION_ALL, xcc_cancel_sub_market) - 44usize];
    ["Offset of field: XC_GROUP_EQUITY_CORRECTION_ALL::XCC_RESERVED_06"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_CORRECTION_ALL, XCC_RESERVED_06) - 46usize];
    ["Offset of field: XC_GROUP_EQUITY_CORRECTION_ALL::xcc_cancel_price"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_CORRECTION_ALL, xcc_cancel_price) - 48usize];
    ["Offset of field: XC_GROUP_EQUITY_CORRECTION_ALL::xcc_cancel_size"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_CORRECTION_ALL, xcc_cancel_size) - 52usize];
    ["Offset of field: XC_GROUP_EQUITY_CORRECTION_ALL::XCC_RESERVED_07"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_CORRECTION_ALL, XCC_RESERVED_07) - 56usize];
    ["Offset of field: XC_GROUP_EQUITY_CORRECTION_ALL::XCC_RESERVED_09"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_CORRECTION_ALL, XCC_RESERVED_09) - 58usize];
    ["Offset of field: XC_GROUP_EQUITY_CORRECTION_ALL::xcc_correct_sub_market"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_CORRECTION_ALL, xcc_correct_sub_market) - 60usize];
    ["Offset of field: XC_GROUP_EQUITY_CORRECTION_ALL::XCC_RESERVED_10"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_CORRECTION_ALL, XCC_RESERVED_10) - 62usize];
    ["Offset of field: XC_GROUP_EQUITY_CORRECTION_ALL::xcc_correct_price"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_CORRECTION_ALL, xcc_correct_price) - 64usize];
    ["Offset of field: XC_GROUP_EQUITY_CORRECTION_ALL::xcc_correct_size"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_CORRECTION_ALL, xcc_correct_size) - 68usize];
    ["Offset of field: XC_GROUP_EQUITY_CORRECTION_ALL::xcc_close_price"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_CORRECTION_ALL, xcc_close_price) - 72usize];
    ["Offset of field: XC_GROUP_EQUITY_CORRECTION_ALL::xcc_trade_tick_flags"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_CORRECTION_ALL, xcc_trade_tick_flags) - 76usize];
    ["Offset of field: XC_GROUP_EQUITY_CORRECTION_ALL::XCC_RESERVED_11"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_CORRECTION_ALL, XCC_RESERVED_11) - 77usize];
    ["Offset of field: XC_GROUP_EQUITY_CORRECTION_ALL::XCC_RESERVED_12"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_CORRECTION_ALL, XCC_RESERVED_12) - 78usize];
    ["Offset of field: XC_GROUP_EQUITY_CORRECTION_ALL::xcc_volume"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_CORRECTION_ALL, xcc_volume) - 80usize];
    ["Offset of field: XC_GROUP_EQUITY_CORRECTION_ALL::xcc_vwap_volume"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_CORRECTION_ALL, xcc_vwap_volume) - 84usize];
    ["Offset of field: XC_GROUP_EQUITY_CORRECTION_ALL::xcc_traded_value"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_CORRECTION_ALL, xcc_traded_value) - 88usize];
    ["Offset of field: XC_GROUP_EQUITY_CORRECTION_ALL::xcc_open_price"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_CORRECTION_ALL, xcc_open_price) - 96usize];
    ["Offset of field: XC_GROUP_EQUITY_CORRECTION_ALL::xcc_total_change"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_CORRECTION_ALL, xcc_total_change) - 100usize];
    ["Offset of field: XC_GROUP_EQUITY_CORRECTION_ALL::xcc_high_price"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_CORRECTION_ALL, xcc_high_price) - 104usize];
    ["Offset of field: XC_GROUP_EQUITY_CORRECTION_ALL::xcc_low_price"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_CORRECTION_ALL, xcc_low_price) - 108usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME"]
        [::std::mem::size_of::<XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME>() - 360usize];
    ["Alignment of XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME"]
        [::std::mem::align_of::<XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME>() - 1usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME::xcr_exchange_code"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME,
        xcr_exchange_code
    ) - 0usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME::xcr_country_code"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME,
        xcr_country_code
    ) - 2usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME::xcr_symbol_type"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME, xcr_symbol_type) - 5usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME::xcr_line_id"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME, xcr_line_id) - 6usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME::xcr_quals"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME, xcr_quals) - 8usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME::xcr_instrument_status"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME,
        xcr_instrument_status
    )
        - 12usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME::xcr_market_status"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME,
        xcr_market_status
    ) - 13usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME::XCR_RESERVED_02"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME,
        XCR_RESERVED_02
    ) - 15usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME::xcr_exchange_hitime"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME,
        xcr_exchange_hitime
    ) - 16usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME::xcr_receive_hitime"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME,
        xcr_receive_hitime
    ) - 24usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME::xcr_sequence"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME, xcr_sequence) - 32usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME::XCR_RESERVED_03"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME,
        XCR_RESERVED_03
    ) - 40usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME::xcr_alternate_id1"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME,
        xcr_alternate_id1
    ) - 48usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME::xcr_alternate_id2"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME,
        xcr_alternate_id2
    ) - 64usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME::xcr_currency"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME, xcr_currency) - 80usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME::XCR_RESERVED_04"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME,
        XCR_RESERVED_04
    ) - 83usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME::XCR_RESERVED_05"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME,
        XCR_RESERVED_05
    ) - 84usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME::XCR_RESERVED_06"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME,
        XCR_RESERVED_06
    ) - 88usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME::xcr_close_exch"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME, xcr_close_exch) - 90usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME::xcr_close_price"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME,
        xcr_close_price
    ) - 92usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME::xcr_close_size"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME, xcr_close_size) - 96usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME::XCR_RESERVED_07"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME,
        XCR_RESERVED_07
    ) - 100usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME::xcr_ref_close_price"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME,
        xcr_ref_close_price
    ) - 104usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME::xcr_open_interest"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME,
        xcr_open_interest
    ) - 108usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME::xcr_exch_time_offset"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME,
        xcr_exch_time_offset
    )
        - 112usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME::xcr_prime_exch"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME,
        xcr_prime_exch
    ) - 116usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME::xcr_lot_size"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME, xcr_lot_size) - 118usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME::xcr_close_hitime"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME,
        xcr_close_hitime
    ) - 120usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME::XCR_RESERVED_08"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME,
        XCR_RESERVED_08
    ) - 128usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME::xcr_bid_exch"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME, xcr_bid_exch) - 138usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME::xcr_bid_price"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME, xcr_bid_price) - 140usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME::xcr_bid_size"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME, xcr_bid_size) - 144usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME::xcr_bid_tick_flags"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME,
        xcr_bid_tick_flags
    ) - 148usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME::XCR_RESERVED_09"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME,
        XCR_RESERVED_09
    ) - 149usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME::xcr_ask_exch"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME, xcr_ask_exch) - 150usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME::xcr_ask_price"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME, xcr_ask_price) - 152usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME::xcr_ask_size"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME, xcr_ask_size) - 156usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME::xcr_bid_hitime"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME,
        xcr_bid_hitime
    ) - 160usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME::xcr_ask_hitime"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME,
        xcr_ask_hitime
    ) - 168usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME::XCR_RESERVED_10"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME,
        XCR_RESERVED_10
    ) - 176usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME::xcr_prev_close"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME,
        xcr_prev_close
    ) - 184usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME::xcr_last_exch"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME, xcr_last_exch) - 188usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME::xcr_trade_tick_flags"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME,
        xcr_trade_tick_flags
    )
        - 190usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME::XCR_RESERVED_11"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME,
        XCR_RESERVED_11
    ) - 191usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME::xcr_last_price"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME,
        xcr_last_price
    ) - 192usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME::xcr_last_size"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME, xcr_last_size) - 196usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME::xcr_volume"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME, xcr_volume) - 200usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME::xcr_vwap_volume"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME,
        xcr_vwap_volume
    ) - 204usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME::xcr_trading_session_date"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME,
        xcr_trading_session_date
    )
        - 208usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME::XCR_RESERVED_12"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME,
        XCR_RESERVED_12
    ) - 212usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME::xcr_traded_value"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME,
        xcr_traded_value
    ) - 216usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME::XCR_RESERVED_13"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME,
        XCR_RESERVED_13
    ) - 224usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME::XCR_RESERVED_14"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME,
        XCR_RESERVED_14
    ) - 232usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME::xcr_open_price"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME,
        xcr_open_price
    ) - 240usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME::xcr_total_change"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME,
        xcr_total_change
    ) - 244usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME::xcr_high_price"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME,
        xcr_high_price
    ) - 248usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME::xcr_low_price"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME, xcr_low_price) - 252usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME::xcr_high_exch"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME, xcr_high_exch) - 256usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME::xcr_low_exch"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME, xcr_low_exch) - 258usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME::xcr_open_exch"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME, xcr_open_exch) - 260usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME::XCR_RESERVED_15"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME,
        XCR_RESERVED_15
    ) - 262usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME::xcr_last_hitime"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME,
        xcr_last_hitime
    ) - 264usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME::xcr_open_hitime"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME,
        xcr_open_hitime
    ) - 272usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME::xcr_high_hitime"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME,
        xcr_high_hitime
    ) - 280usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME::xcr_low_hitime"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME,
        xcr_low_hitime
    ) - 288usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME::xcr_bid_customer_size"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME,
        xcr_bid_customer_size
    )
        - 296usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME::xcr_bid_professional_size"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME,
        xcr_bid_professional_size
    )
        - 300usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME::xcr_bid_market_maker_size"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME,
        xcr_bid_market_maker_size
    )
        - 304usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME::xcr_ask_customer_size"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME,
        xcr_ask_customer_size
    )
        - 308usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME::xcr_ask_professional_size"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME,
        xcr_ask_professional_size
    )
        - 312usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME::xcr_ask_market_maker_size"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME,
        xcr_ask_market_maker_size
    )
        - 316usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME::xcr_upper_limit_price"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME,
        xcr_upper_limit_price
    )
        - 320usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME::xcr_lower_limit_price"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME,
        xcr_lower_limit_price
    )
        - 324usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME::xcr_limit_price_hitime"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME,
        xcr_limit_price_hitime
    )
        - 328usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME::xcr_quote_quals"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME,
        xcr_quote_quals
    ) - 336usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME::xcr_trade_quals"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME,
        xcr_trade_quals
    ) - 340usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME::xcr_quote_sequence"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME,
        xcr_quote_sequence
    ) - 344usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME::xcr_trade_sequence"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_ALL_WITH_HITIME,
        xcr_trade_sequence
    ) - 352usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_GROUP_EQUITY_REFRESH_ALL"]
        [::std::mem::size_of::<XC_GROUP_EQUITY_REFRESH_ALL>() - 296usize];
    ["Alignment of XC_GROUP_EQUITY_REFRESH_ALL"]
        [::std::mem::align_of::<XC_GROUP_EQUITY_REFRESH_ALL>() - 1usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL::xcr_exchange_code"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_REFRESH_ALL, xcr_exchange_code) - 0usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL::xcr_country_code"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_REFRESH_ALL, xcr_country_code) - 2usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL::xcr_symbol_type"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_REFRESH_ALL, xcr_symbol_type) - 5usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL::xcr_line_id"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_REFRESH_ALL, xcr_line_id) - 6usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL::xcr_quals"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_REFRESH_ALL, xcr_quals) - 8usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL::xcr_instrument_status"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_REFRESH_ALL, xcr_instrument_status) - 12usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL::xcr_market_status"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_REFRESH_ALL, xcr_market_status) - 13usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL::XCR_RESERVED_02"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_REFRESH_ALL, XCR_RESERVED_02) - 15usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL::xcr_exchange_hitime"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_REFRESH_ALL, xcr_exchange_hitime) - 16usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL::xcr_receive_hitime"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_REFRESH_ALL, xcr_receive_hitime) - 24usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL::xcr_sequence"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_REFRESH_ALL, xcr_sequence) - 32usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL::XCR_RESERVED_03"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_REFRESH_ALL, XCR_RESERVED_03) - 40usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL::xcr_alternate_id1"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_REFRESH_ALL, xcr_alternate_id1) - 48usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL::xcr_alternate_id2"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_REFRESH_ALL, xcr_alternate_id2) - 64usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL::xcr_currency"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_REFRESH_ALL, xcr_currency) - 80usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL::XCR_RESERVED_04"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_REFRESH_ALL, XCR_RESERVED_04) - 83usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL::XCR_RESERVED_05"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_REFRESH_ALL, XCR_RESERVED_05) - 84usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL::XCR_RESERVED_06"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_REFRESH_ALL, XCR_RESERVED_06) - 88usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL::xcr_close_exch"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_REFRESH_ALL, xcr_close_exch) - 90usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL::xcr_close_price"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_REFRESH_ALL, xcr_close_price) - 92usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL::xcr_close_size"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_REFRESH_ALL, xcr_close_size) - 96usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL::XCR_RESERVED_07"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_REFRESH_ALL, XCR_RESERVED_07) - 100usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL::xcr_ref_close_price"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_REFRESH_ALL, xcr_ref_close_price) - 104usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL::xcr_open_interest"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_REFRESH_ALL, xcr_open_interest) - 108usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL::xcr_exch_time_offset"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_REFRESH_ALL, xcr_exch_time_offset) - 112usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL::xcr_prime_exch"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_REFRESH_ALL, xcr_prime_exch) - 116usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL::xcr_lot_size"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_REFRESH_ALL, xcr_lot_size) - 118usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL::xcr_close_extime"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_REFRESH_ALL, xcr_close_extime) - 120usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL::XCR_RESERVED_08"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_REFRESH_ALL, XCR_RESERVED_08) - 128usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL::xcr_bid_exch"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_REFRESH_ALL, xcr_bid_exch) - 138usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL::xcr_bid_price"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_REFRESH_ALL, xcr_bid_price) - 140usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL::xcr_bid_size"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_REFRESH_ALL, xcr_bid_size) - 144usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL::xcr_bid_tick_flags"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_REFRESH_ALL, xcr_bid_tick_flags) - 148usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL::XCR_RESERVED_09"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_REFRESH_ALL, XCR_RESERVED_09) - 149usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL::xcr_ask_exch"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_REFRESH_ALL, xcr_ask_exch) - 150usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL::xcr_ask_price"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_REFRESH_ALL, xcr_ask_price) - 152usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL::xcr_ask_size"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_REFRESH_ALL, xcr_ask_size) - 156usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL::xcr_bid_extime"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_REFRESH_ALL, xcr_bid_extime) - 160usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL::xcr_ask_extime"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_REFRESH_ALL, xcr_ask_extime) - 168usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL::XCR_RESERVED_10"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_REFRESH_ALL, XCR_RESERVED_10) - 176usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL::xcr_prev_close"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_REFRESH_ALL, xcr_prev_close) - 184usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL::xcr_last_exch"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_REFRESH_ALL, xcr_last_exch) - 188usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL::xcr_trade_tick_flags"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_REFRESH_ALL, xcr_trade_tick_flags) - 190usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL::XCR_RESERVED_11"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_REFRESH_ALL, XCR_RESERVED_11) - 191usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL::xcr_last_price"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_REFRESH_ALL, xcr_last_price) - 192usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL::xcr_last_size"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_REFRESH_ALL, xcr_last_size) - 196usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL::xcr_volume"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_REFRESH_ALL, xcr_volume) - 200usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL::xcr_vwap_volume"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_REFRESH_ALL, xcr_vwap_volume) - 204usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL::xcr_trading_session_date"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_REFRESH_ALL, xcr_trading_session_date) - 208usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL::XCR_RESERVED_12"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_REFRESH_ALL, XCR_RESERVED_12) - 212usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL::xcr_traded_value"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_REFRESH_ALL, xcr_traded_value) - 216usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL::XCR_RESERVED_13"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_REFRESH_ALL, XCR_RESERVED_13) - 224usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL::XCR_RESERVED_14"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_REFRESH_ALL, XCR_RESERVED_14) - 232usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL::xcr_open_price"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_REFRESH_ALL, xcr_open_price) - 240usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL::xcr_total_change"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_REFRESH_ALL, xcr_total_change) - 244usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL::xcr_high_price"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_REFRESH_ALL, xcr_high_price) - 248usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL::xcr_low_price"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_REFRESH_ALL, xcr_low_price) - 252usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL::xcr_high_exch"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_REFRESH_ALL, xcr_high_exch) - 256usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL::xcr_low_exch"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_REFRESH_ALL, xcr_low_exch) - 258usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL::xcr_open_exch"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_REFRESH_ALL, xcr_open_exch) - 260usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL::XCR_RESERVED_15"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_REFRESH_ALL, XCR_RESERVED_15) - 262usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL::xcr_last_extime"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_REFRESH_ALL, xcr_last_extime) - 264usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL::xcr_open_extime"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_REFRESH_ALL, xcr_open_extime) - 272usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL::xcr_high_extime"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_REFRESH_ALL, xcr_high_extime) - 280usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_ALL::xcr_low_extime"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_REFRESH_ALL, xcr_low_extime) - 288usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL"]
        [::std::mem::size_of::<XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL>() - 360usize];
    ["Alignment of XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL"]
        [::std::mem::align_of::<XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL>() - 1usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL::xcr_exchange_code"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL,
        xcr_exchange_code
    )
        - 0usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL::xcr_country_code"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL,
        xcr_country_code
    ) - 2usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL::xcr_symbol_type"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL,
        xcr_symbol_type
    ) - 5usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL::xcr_line_id"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL,
        xcr_line_id
    ) - 6usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL::xcr_quals"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL, xcr_quals) - 8usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL::xcr_instrument_status"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL,
        xcr_instrument_status
    )
        - 12usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL::xcr_market_status"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL,
        xcr_market_status
    )
        - 13usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL::XCR_RESERVED_02"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL,
        XCR_RESERVED_02
    ) - 15usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL::xcr_exchange_hitime"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL,
        xcr_exchange_hitime
    )
        - 16usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL::xcr_receive_hitime"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL,
        xcr_receive_hitime
    )
        - 24usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL::xcr_sequence"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL,
        xcr_sequence
    ) - 32usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL::XCR_RESERVED_03"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL,
        XCR_RESERVED_03
    ) - 40usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL::xcr_alternate_id1"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL,
        xcr_alternate_id1
    )
        - 48usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL::xcr_alternate_id2"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL,
        xcr_alternate_id2
    )
        - 64usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL::xcr_currency"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL,
        xcr_currency
    ) - 80usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL::XCR_RESERVED_04"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL,
        XCR_RESERVED_04
    ) - 83usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL::XCR_RESERVED_05"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL,
        XCR_RESERVED_05
    ) - 84usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL::XCR_RESERVED_06"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL,
        XCR_RESERVED_06
    ) - 88usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL::xcr_close_exch"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL,
        xcr_close_exch
    ) - 90usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL::xcr_close_price"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL,
        xcr_close_price
    ) - 92usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL::xcr_close_size"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL,
        xcr_close_size
    ) - 96usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL::XCR_RESERVED_07"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL,
        XCR_RESERVED_07
    )
        - 100usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL::xcr_ref_close_price"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL,
        xcr_ref_close_price
    )
        - 104usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL::xcr_open_interest"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL,
        xcr_open_interest
    )
        - 108usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL::xcr_exch_time_offset"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL,
        xcr_exch_time_offset
    )
        - 112usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL::xcr_prime_exch"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL,
        xcr_prime_exch
    ) - 116usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL::xcr_lot_size"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL,
        xcr_lot_size
    ) - 118usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL::xcr_close_extime"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL,
        xcr_close_extime
    )
        - 120usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL::XCR_RESERVED_08"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL,
        XCR_RESERVED_08
    )
        - 128usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL::xcr_bid_exch"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL,
        xcr_bid_exch
    ) - 138usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL::xcr_bid_price"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL,
        xcr_bid_price
    ) - 140usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL::xcr_bid_size"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL,
        xcr_bid_size
    ) - 144usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL::xcr_bid_tick_flags"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL,
        xcr_bid_tick_flags
    )
        - 148usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL::XCR_RESERVED_09"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL,
        XCR_RESERVED_09
    )
        - 149usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL::xcr_ask_exch"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL,
        xcr_ask_exch
    ) - 150usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL::xcr_ask_price"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL,
        xcr_ask_price
    ) - 152usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL::xcr_ask_size"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL,
        xcr_ask_size
    ) - 156usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL::xcr_bid_extime"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL,
        xcr_bid_extime
    ) - 160usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL::xcr_ask_extime"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL,
        xcr_ask_extime
    ) - 168usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL::XCR_RESERVED_10"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL,
        XCR_RESERVED_10
    )
        - 176usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL::xcr_prev_close"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL,
        xcr_prev_close
    ) - 184usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL::xcr_last_exch"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL,
        xcr_last_exch
    ) - 188usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL::xcr_trade_tick_flags"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL,
        xcr_trade_tick_flags
    )
        - 190usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL::XCR_RESERVED_11"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL,
        XCR_RESERVED_11
    )
        - 191usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL::xcr_last_price"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL,
        xcr_last_price
    ) - 192usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL::xcr_last_size"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL,
        xcr_last_size
    ) - 196usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL::xcr_volume"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL,
        xcr_volume
    ) - 200usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL::xcr_vwap_volume"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL,
        xcr_vwap_volume
    )
        - 204usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL::xcr_trading_session_date"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL,
        xcr_trading_session_date
    )
        - 208usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL::XCR_RESERVED_12"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL,
        XCR_RESERVED_12
    )
        - 212usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL::xcr_traded_value"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL,
        xcr_traded_value
    )
        - 216usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL::XCR_RESERVED_13"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL,
        XCR_RESERVED_13
    )
        - 224usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL::XCR_RESERVED_14"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL,
        XCR_RESERVED_14
    )
        - 232usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL::xcr_open_price"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL,
        xcr_open_price
    ) - 240usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL::xcr_total_change"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL,
        xcr_total_change
    )
        - 244usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL::xcr_high_price"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL,
        xcr_high_price
    ) - 248usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL::xcr_low_price"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL,
        xcr_low_price
    ) - 252usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL::xcr_high_exch"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL,
        xcr_high_exch
    ) - 256usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL::xcr_low_exch"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL,
        xcr_low_exch
    ) - 258usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL::xcr_open_exch"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL,
        xcr_open_exch
    ) - 260usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL::XCR_RESERVED_15"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL,
        XCR_RESERVED_15
    )
        - 262usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL::xcr_last_extime"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL,
        xcr_last_extime
    )
        - 264usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL::xcr_open_extime"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL,
        xcr_open_extime
    )
        - 272usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL::xcr_high_extime"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL,
        xcr_high_extime
    )
        - 280usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL::xcr_low_extime"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL,
        xcr_low_extime
    ) - 288usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL::xcr_bid_customer_size"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL,
        xcr_bid_customer_size
    )
        - 296usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL::xcr_bid_professional_size"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL,
        xcr_bid_professional_size
    )
        - 300usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL::xcr_bid_market_maker_size"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL,
        xcr_bid_market_maker_size
    )
        - 304usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL::xcr_ask_customer_size"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL,
        xcr_ask_customer_size
    )
        - 308usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL::xcr_ask_professional_size"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL,
        xcr_ask_professional_size
    )
        - 312usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL::xcr_ask_market_maker_size"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL,
        xcr_ask_market_maker_size
    )
        - 316usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL::xcr_upper_limit_price"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL,
        xcr_upper_limit_price
    )
        - 320usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL::xcr_lower_limit_price"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL,
        xcr_lower_limit_price
    )
        - 324usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL::xcr_limit_price_extime"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL,
        xcr_limit_price_extime
    )
        - 328usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL::xcr_quote_quals"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL,
        xcr_quote_quals
    )
        - 336usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL::xcr_trade_quals"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL,
        xcr_trade_quals
    )
        - 340usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL::xcr_quote_sequence"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL,
        xcr_quote_sequence
    )
        - 344usize];
    ["Offset of field: XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL::xcr_trade_sequence"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_REFRESH_WITH_LULD_CPMVOL_ALL,
        xcr_trade_sequence
    )
        - 352usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME"]
        [::std::mem::size_of::<XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME>() - 288usize];
    ["Alignment of XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME"]
        [::std::mem::align_of::<XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME>() - 1usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME::xci_exchange_code"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME, xci_exchange_code) - 0usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME::xci_country_code"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME, xci_country_code) - 2usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME::xci_symbol"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME, xci_symbol) - 4usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME::xci_symbol_type"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME, xci_symbol_type) - 25usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME::xci_instrument_status"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME,
        xci_instrument_status
    ) - 26usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME::xci_market_status"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME,
        xci_market_status
    ) - 27usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME::XCI_RESERVED_02"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME, XCI_RESERVED_02) - 29usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME::XCI_RESERVED_03"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME, XCI_RESERVED_03) - 30usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME::XCI_RESERVED_04"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME, XCI_RESERVED_04) - 32usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME::xci_alternate_id1"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME,
        xci_alternate_id1
    ) - 40usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME::xci_alternate_id2"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME,
        xci_alternate_id2
    ) - 56usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME::xci_currency"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME, xci_currency) - 72usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME::XCI_RESERVED_05"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME, XCI_RESERVED_05) - 75usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME::XCI_RESERVED_06"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME, XCI_RESERVED_06) - 76usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME::XCI_RESERVED_07"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME, XCI_RESERVED_07) - 80usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME::xci_close_exch"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME, xci_close_exch) - 82usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME::xci_close_price"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME, xci_close_price) - 84usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME::xci_close_size"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME, xci_close_size) - 88usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME::XCI_RESERVED_08"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME, XCI_RESERVED_08) - 92usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME::xci_ref_close_price"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME,
        xci_ref_close_price
    ) - 96usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME::xci_open_interest"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME,
        xci_open_interest
    ) - 100usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME::xci_exch_time_offset"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME,
        xci_exch_time_offset
    ) - 104usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME::xci_prime_exch"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME, xci_prime_exch) - 108usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME::xci_lot_size"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME, xci_lot_size) - 110usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME::xci_close_hitime"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME,
        xci_close_hitime
    ) - 112usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME::XCI_RESERVED_09"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME, XCI_RESERVED_09) - 120usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME::xci_bid_exch"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME, xci_bid_exch) - 130usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME::xci_bid_price"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME, xci_bid_price) - 132usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME::xci_bid_size"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME, xci_bid_size) - 136usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME::xci_bid_tick_flags"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME,
        xci_bid_tick_flags
    ) - 140usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME::XCI_RESERVED_10"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME, XCI_RESERVED_10) - 141usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME::xci_ask_exch"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME, xci_ask_exch) - 142usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME::xci_ask_price"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME, xci_ask_price) - 144usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME::xci_ask_size"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME, xci_ask_size) - 148usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME::xci_bid_hitime"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME, xci_bid_hitime) - 152usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME::xci_ask_hitime"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME, xci_ask_hitime) - 160usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME::XCI_RESERVED_11"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME, XCI_RESERVED_11) - 168usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME::xci_prev_close"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME, xci_prev_close) - 176usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME::xci_last_exch"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME, xci_last_exch) - 180usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME::xci_trade_tick_flags"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME,
        xci_trade_tick_flags
    ) - 182usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME::XCI_RESERVED_12"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME, XCI_RESERVED_12) - 183usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME::xci_last_price"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME, xci_last_price) - 184usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME::xci_last_size"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME, xci_last_size) - 188usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME::xci_volume"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME, xci_volume) - 192usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME::xci_vwap_volume"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME, xci_vwap_volume) - 196usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME::xci_trading_session_date"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME,
        xci_trading_session_date
    )
        - 200usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME::XCI_RESERVED_13"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME, XCI_RESERVED_13) - 204usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME::xci_traded_value"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME,
        xci_traded_value
    ) - 208usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME::XCI_RESERVED_14"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME, XCI_RESERVED_14) - 216usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME::XCI_RESERVED_15"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME, XCI_RESERVED_15) - 224usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME::xci_open_price"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME, xci_open_price) - 232usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME::xci_total_change"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME,
        xci_total_change
    ) - 236usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME::xci_high_price"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME, xci_high_price) - 240usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME::xci_low_price"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME, xci_low_price) - 244usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME::xci_high_exch"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME, xci_high_exch) - 248usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME::xci_low_exch"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME, xci_low_exch) - 250usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME::xci_open_exch"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME, xci_open_exch) - 252usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME::XCI_RESERVED_16"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME, XCI_RESERVED_16) - 254usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME::xci_last_hitime"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME, xci_last_hitime) - 256usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME::xci_open_hitime"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME, xci_open_hitime) - 264usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME::xci_high_hitime"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME, xci_high_hitime) - 272usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME::xci_low_hitime"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL_WITH_HITIME, xci_low_hitime) - 280usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_GROUP_EQUITY_IMAGE_ALL"]
        [::std::mem::size_of::<XC_GROUP_EQUITY_IMAGE_ALL>() - 288usize];
    ["Alignment of XC_GROUP_EQUITY_IMAGE_ALL"]
        [::std::mem::align_of::<XC_GROUP_EQUITY_IMAGE_ALL>() - 1usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL::xci_exchange_code"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL, xci_exchange_code) - 0usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL::xci_country_code"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL, xci_country_code) - 2usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL::xci_symbol"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL, xci_symbol) - 4usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL::xci_symbol_type"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL, xci_symbol_type) - 25usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL::xci_instrument_status"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL, xci_instrument_status) - 26usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL::xci_market_status"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL, xci_market_status) - 27usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL::XCI_RESERVED_02"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL, XCI_RESERVED_02) - 29usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL::XCI_RESERVED_03"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL, XCI_RESERVED_03) - 30usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL::XCI_RESERVED_04"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL, XCI_RESERVED_04) - 32usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL::xci_alternate_id1"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL, xci_alternate_id1) - 40usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL::xci_alternate_id2"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL, xci_alternate_id2) - 56usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL::xci_currency"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL, xci_currency) - 72usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL::XCI_RESERVED_05"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL, XCI_RESERVED_05) - 75usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL::XCI_RESERVED_06"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL, XCI_RESERVED_06) - 76usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL::XCI_RESERVED_07"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL, XCI_RESERVED_07) - 80usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL::xci_close_exch"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL, xci_close_exch) - 82usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL::xci_close_price"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL, xci_close_price) - 84usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL::xci_close_size"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL, xci_close_size) - 88usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL::XCI_RESERVED_08"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL, XCI_RESERVED_08) - 92usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL::xci_ref_close_price"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL, xci_ref_close_price) - 96usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL::xci_open_interest"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL, xci_open_interest) - 100usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL::xci_exch_time_offset"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL, xci_exch_time_offset) - 104usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL::xci_prime_exch"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL, xci_prime_exch) - 108usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL::xci_lot_size"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL, xci_lot_size) - 110usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL::xci_close_extime"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL, xci_close_extime) - 112usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL::XCI_RESERVED_09"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL, XCI_RESERVED_09) - 120usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL::xci_bid_exch"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL, xci_bid_exch) - 130usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL::xci_bid_price"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL, xci_bid_price) - 132usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL::xci_bid_size"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL, xci_bid_size) - 136usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL::xci_bid_tick_flags"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL, xci_bid_tick_flags) - 140usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL::XCI_RESERVED_10"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL, XCI_RESERVED_10) - 141usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL::xci_ask_exch"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL, xci_ask_exch) - 142usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL::xci_ask_price"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL, xci_ask_price) - 144usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL::xci_ask_size"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL, xci_ask_size) - 148usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL::xci_bid_extime"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL, xci_bid_extime) - 152usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL::xci_ask_extime"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL, xci_ask_extime) - 160usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL::XCI_RESERVED_11"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL, XCI_RESERVED_11) - 168usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL::xci_prev_close"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL, xci_prev_close) - 176usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL::xci_last_exch"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL, xci_last_exch) - 180usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL::xci_trade_tick_flags"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL, xci_trade_tick_flags) - 182usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL::XCI_RESERVED_12"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL, XCI_RESERVED_12) - 183usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL::xci_last_price"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL, xci_last_price) - 184usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL::xci_last_size"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL, xci_last_size) - 188usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL::xci_volume"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL, xci_volume) - 192usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL::xci_vwap_volume"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL, xci_vwap_volume) - 196usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL::xci_trading_session_date"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL, xci_trading_session_date) - 200usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL::XCI_RESERVED_13"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL, XCI_RESERVED_13) - 204usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL::xci_traded_value"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL, xci_traded_value) - 208usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL::XCI_RESERVED_14"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL, XCI_RESERVED_14) - 216usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL::XCI_RESERVED_15"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL, XCI_RESERVED_15) - 224usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL::xci_open_price"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL, xci_open_price) - 232usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL::xci_total_change"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL, xci_total_change) - 236usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL::xci_high_price"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL, xci_high_price) - 240usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL::xci_low_price"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL, xci_low_price) - 244usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL::xci_high_exch"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL, xci_high_exch) - 248usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL::xci_low_exch"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL, xci_low_exch) - 250usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL::xci_open_exch"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL, xci_open_exch) - 252usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL::XCI_RESERVED_16"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL, XCI_RESERVED_16) - 254usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL::xci_last_extime"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL, xci_last_extime) - 256usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL::xci_open_extime"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL, xci_open_extime) - 264usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL::xci_high_extime"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL, xci_high_extime) - 272usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_ALL::xci_low_extime"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_ALL, xci_low_extime) - 280usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL"]
        [::std::mem::size_of::<XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL>() - 352usize];
    ["Alignment of XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL"]
        [::std::mem::align_of::<XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL>() - 1usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL::xci_exchange_code"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL,
        xci_exchange_code
    ) - 0usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL::xci_country_code"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL,
        xci_country_code
    ) - 2usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL::xci_symbol"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL, xci_symbol) - 4usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL::xci_symbol_type"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL,
        xci_symbol_type
    ) - 25usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL::xci_instrument_status"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL,
        xci_instrument_status
    )
        - 26usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL::xci_market_status"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL,
        xci_market_status
    ) - 27usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL::XCI_RESERVED_02"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL,
        XCI_RESERVED_02
    ) - 29usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL::XCI_RESERVED_03"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL,
        XCI_RESERVED_03
    ) - 30usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL::XCI_RESERVED_04"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL,
        XCI_RESERVED_04
    ) - 32usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL::xci_alternate_id1"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL,
        xci_alternate_id1
    ) - 40usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL::xci_alternate_id2"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL,
        xci_alternate_id2
    ) - 56usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL::xci_currency"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL,
        xci_currency
    ) - 72usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL::XCI_RESERVED_05"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL,
        XCI_RESERVED_05
    ) - 75usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL::XCI_RESERVED_06"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL,
        XCI_RESERVED_06
    ) - 76usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL::XCI_RESERVED_07"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL,
        XCI_RESERVED_07
    ) - 80usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL::xci_close_exch"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL,
        xci_close_exch
    ) - 82usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL::xci_close_price"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL,
        xci_close_price
    ) - 84usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL::xci_close_size"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL,
        xci_close_size
    ) - 88usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL::XCI_RESERVED_08"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL,
        XCI_RESERVED_08
    ) - 92usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL::xci_ref_close_price"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL,
        xci_ref_close_price
    )
        - 96usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL::xci_open_interest"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL,
        xci_open_interest
    )
        - 100usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL::xci_exch_time_offset"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL,
        xci_exch_time_offset
    )
        - 104usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL::xci_prime_exch"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL,
        xci_prime_exch
    ) - 108usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL::xci_lot_size"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL,
        xci_lot_size
    ) - 110usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL::xci_close_extime"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL,
        xci_close_extime
    ) - 112usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL::XCI_RESERVED_09"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL,
        XCI_RESERVED_09
    ) - 120usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL::xci_bid_exch"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL,
        xci_bid_exch
    ) - 130usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL::xci_bid_price"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL,
        xci_bid_price
    ) - 132usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL::xci_bid_size"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL,
        xci_bid_size
    ) - 136usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL::xci_bid_tick_flags"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL,
        xci_bid_tick_flags
    )
        - 140usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL::XCI_RESERVED_10"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL,
        XCI_RESERVED_10
    ) - 141usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL::xci_ask_exch"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL,
        xci_ask_exch
    ) - 142usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL::xci_ask_price"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL,
        xci_ask_price
    ) - 144usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL::xci_ask_size"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL,
        xci_ask_size
    ) - 148usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL::xci_bid_extime"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL,
        xci_bid_extime
    ) - 152usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL::xci_ask_extime"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL,
        xci_ask_extime
    ) - 160usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL::XCI_RESERVED_11"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL,
        XCI_RESERVED_11
    ) - 168usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL::xci_prev_close"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL,
        xci_prev_close
    ) - 176usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL::xci_last_exch"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL,
        xci_last_exch
    ) - 180usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL::xci_trade_tick_flags"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL,
        xci_trade_tick_flags
    )
        - 182usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL::XCI_RESERVED_12"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL,
        XCI_RESERVED_12
    ) - 183usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL::xci_last_price"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL,
        xci_last_price
    ) - 184usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL::xci_last_size"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL,
        xci_last_size
    ) - 188usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL::xci_volume"]
        [::std::mem::offset_of!(XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL, xci_volume) - 192usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL::xci_vwap_volume"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL,
        xci_vwap_volume
    ) - 196usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL::xci_trading_session_date"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL,
        xci_trading_session_date
    )
        - 200usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL::XCI_RESERVED_13"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL,
        XCI_RESERVED_13
    ) - 204usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL::xci_traded_value"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL,
        xci_traded_value
    ) - 208usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL::XCI_RESERVED_14"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL,
        XCI_RESERVED_14
    ) - 216usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL::XCI_RESERVED_15"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL,
        XCI_RESERVED_15
    ) - 224usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL::xci_open_price"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL,
        xci_open_price
    ) - 232usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL::xci_total_change"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL,
        xci_total_change
    ) - 236usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL::xci_high_price"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL,
        xci_high_price
    ) - 240usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL::xci_low_price"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL,
        xci_low_price
    ) - 244usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL::xci_high_exch"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL,
        xci_high_exch
    ) - 248usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL::xci_low_exch"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL,
        xci_low_exch
    ) - 250usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL::xci_open_exch"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL,
        xci_open_exch
    ) - 252usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL::XCI_RESERVED_16"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL,
        XCI_RESERVED_16
    ) - 254usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL::xci_last_extime"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL,
        xci_last_extime
    ) - 256usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL::xci_open_extime"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL,
        xci_open_extime
    ) - 264usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL::xci_high_extime"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL,
        xci_high_extime
    ) - 272usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL::xci_low_extime"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL,
        xci_low_extime
    ) - 280usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL::xci_bid_customer_size"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL,
        xci_bid_customer_size
    )
        - 288usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL::xci_bid_professional_size"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL,
        xci_bid_professional_size
    )
        - 292usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL::xci_bid_market_maker_size"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL,
        xci_bid_market_maker_size
    )
        - 296usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL::xci_ask_customer_size"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL,
        xci_ask_customer_size
    )
        - 300usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL::xci_ask_professional_size"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL,
        xci_ask_professional_size
    )
        - 304usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL::xci_ask_market_maker_size"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL,
        xci_ask_market_maker_size
    )
        - 308usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL::xci_upper_limit_price"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL,
        xci_upper_limit_price
    )
        - 312usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL::xci_lower_limit_price"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL,
        xci_lower_limit_price
    )
        - 316usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL::xci_limit_price_extime"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL,
        xci_limit_price_extime
    )
        - 320usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL::xci_quote_quals"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL,
        xci_quote_quals
    ) - 328usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL::xci_trade_quals"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL,
        xci_trade_quals
    ) - 332usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL::xci_quote_sequence"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL,
        xci_quote_sequence
    )
        - 336usize];
    ["Offset of field: XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL::xci_trade_sequence"][::std::mem::offset_of!(
        XC_GROUP_EQUITY_IMAGE_WITH_LULD_CPMVOL_ALL,
        xci_trade_sequence
    )
        - 344usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_GROUP_TRADE_REF"][::std::mem::size_of::<XC_GROUP_TRADE_REF>() - 48usize];
    ["Alignment of XC_GROUP_TRADE_REF"][::std::mem::align_of::<XC_GROUP_TRADE_REF>() - 1usize];
    ["Offset of field: XC_GROUP_TRADE_REF::xct_bid_order_ref"]
        [::std::mem::offset_of!(XC_GROUP_TRADE_REF, xct_bid_order_ref) - 0usize];
    ["Offset of field: XC_GROUP_TRADE_REF::xct_ask_order_ref"]
        [::std::mem::offset_of!(XC_GROUP_TRADE_REF, xct_ask_order_ref) - 12usize];
    ["Offset of field: XC_GROUP_TRADE_REF::xct_bid_mmid"]
        [::std::mem::offset_of!(XC_GROUP_TRADE_REF, xct_bid_mmid) - 24usize];
    ["Offset of field: XC_GROUP_TRADE_REF::xct_ask_mmid"]
        [::std::mem::offset_of!(XC_GROUP_TRADE_REF, xct_ask_mmid) - 30usize];
    ["Offset of field: XC_GROUP_TRADE_REF::xct_trade_ref"]
        [::std::mem::offset_of!(XC_GROUP_TRADE_REF, xct_trade_ref) - 36usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_GROUP_COMMODITY_QUOTE"]
        [::std::mem::size_of::<XC_GROUP_COMMODITY_QUOTE>() - 24usize];
    ["Alignment of XC_GROUP_COMMODITY_QUOTE"]
        [::std::mem::align_of::<XC_GROUP_COMMODITY_QUOTE>() - 1usize];
    ["Offset of field: XC_GROUP_COMMODITY_QUOTE::XCQ_RESERVED_00"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_QUOTE, XCQ_RESERVED_00) - 0usize];
    ["Offset of field: XC_GROUP_COMMODITY_QUOTE::xcq_bid_tick_flags"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_QUOTE, xcq_bid_tick_flags) - 2usize];
    ["Offset of field: XC_GROUP_COMMODITY_QUOTE::XCQ_RESERVED_01"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_QUOTE, XCQ_RESERVED_01) - 3usize];
    ["Offset of field: XC_GROUP_COMMODITY_QUOTE::XCQ_RESERVED_02"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_QUOTE, XCQ_RESERVED_02) - 4usize];
    ["Offset of field: XC_GROUP_COMMODITY_QUOTE::xcq_bid_price"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_QUOTE, xcq_bid_price) - 8usize];
    ["Offset of field: XC_GROUP_COMMODITY_QUOTE::xcq_bid_size"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_QUOTE, xcq_bid_size) - 12usize];
    ["Offset of field: XC_GROUP_COMMODITY_QUOTE::xcq_ask_price"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_QUOTE, xcq_ask_price) - 16usize];
    ["Offset of field: XC_GROUP_COMMODITY_QUOTE::xcq_ask_size"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_QUOTE, xcq_ask_size) - 20usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_GROUP_COMMODITY_QUOTE_ALL"]
        [::std::mem::size_of::<XC_GROUP_COMMODITY_QUOTE_ALL>() - 64usize];
    ["Alignment of XC_GROUP_COMMODITY_QUOTE_ALL"]
        [::std::mem::align_of::<XC_GROUP_COMMODITY_QUOTE_ALL>() - 1usize];
    ["Offset of field: XC_GROUP_COMMODITY_QUOTE_ALL::xcq_exchange_code"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_QUOTE_ALL, xcq_exchange_code) - 0usize];
    ["Offset of field: XC_GROUP_COMMODITY_QUOTE_ALL::xcq_country_code"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_QUOTE_ALL, xcq_country_code) - 2usize];
    ["Offset of field: XC_GROUP_COMMODITY_QUOTE_ALL::xcq_symbol_type"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_QUOTE_ALL, xcq_symbol_type) - 5usize];
    ["Offset of field: XC_GROUP_COMMODITY_QUOTE_ALL::xcq_line_id"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_QUOTE_ALL, xcq_line_id) - 6usize];
    ["Offset of field: XC_GROUP_COMMODITY_QUOTE_ALL::xcq_quals"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_QUOTE_ALL, xcq_quals) - 8usize];
    ["Offset of field: XC_GROUP_COMMODITY_QUOTE_ALL::xcq_instrument_status"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_QUOTE_ALL, xcq_instrument_status) - 12usize];
    ["Offset of field: XC_GROUP_COMMODITY_QUOTE_ALL::xcq_market_status"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_QUOTE_ALL, xcq_market_status) - 13usize];
    ["Offset of field: XC_GROUP_COMMODITY_QUOTE_ALL::XCQ_RESERVED_02"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_QUOTE_ALL, XCQ_RESERVED_02) - 15usize];
    ["Offset of field: XC_GROUP_COMMODITY_QUOTE_ALL::xcq_exchange_hitime"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_QUOTE_ALL, xcq_exchange_hitime) - 16usize];
    ["Offset of field: XC_GROUP_COMMODITY_QUOTE_ALL::xcq_receive_hitime"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_QUOTE_ALL, xcq_receive_hitime) - 24usize];
    ["Offset of field: XC_GROUP_COMMODITY_QUOTE_ALL::xcq_sequence"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_QUOTE_ALL, xcq_sequence) - 32usize];
    ["Offset of field: XC_GROUP_COMMODITY_QUOTE_ALL::XCQ_RESERVED_03"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_QUOTE_ALL, XCQ_RESERVED_03) - 40usize];
    ["Offset of field: XC_GROUP_COMMODITY_QUOTE_ALL::xcq_bid_tick_flags"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_QUOTE_ALL, xcq_bid_tick_flags) - 42usize];
    ["Offset of field: XC_GROUP_COMMODITY_QUOTE_ALL::XCQ_RESERVED_04"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_QUOTE_ALL, XCQ_RESERVED_04) - 43usize];
    ["Offset of field: XC_GROUP_COMMODITY_QUOTE_ALL::XCQ_RESERVED_05"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_QUOTE_ALL, XCQ_RESERVED_05) - 44usize];
    ["Offset of field: XC_GROUP_COMMODITY_QUOTE_ALL::xcq_bid_price"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_QUOTE_ALL, xcq_bid_price) - 48usize];
    ["Offset of field: XC_GROUP_COMMODITY_QUOTE_ALL::xcq_bid_size"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_QUOTE_ALL, xcq_bid_size) - 52usize];
    ["Offset of field: XC_GROUP_COMMODITY_QUOTE_ALL::xcq_ask_price"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_QUOTE_ALL, xcq_ask_price) - 56usize];
    ["Offset of field: XC_GROUP_COMMODITY_QUOTE_ALL::xcq_ask_size"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_QUOTE_ALL, xcq_ask_size) - 60usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_GROUP_COMMODITY_TRADE"]
        [::std::mem::size_of::<XC_GROUP_COMMODITY_TRADE>() - 16usize];
    ["Alignment of XC_GROUP_COMMODITY_TRADE"]
        [::std::mem::align_of::<XC_GROUP_COMMODITY_TRADE>() - 1usize];
    ["Offset of field: XC_GROUP_COMMODITY_TRADE::XCT_RESERVED_00"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_TRADE, XCT_RESERVED_00) - 0usize];
    ["Offset of field: XC_GROUP_COMMODITY_TRADE::xct_trade_tick_flags"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_TRADE, xct_trade_tick_flags) - 2usize];
    ["Offset of field: XC_GROUP_COMMODITY_TRADE::XCT_RESERVED_02"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_TRADE, XCT_RESERVED_02) - 3usize];
    ["Offset of field: XC_GROUP_COMMODITY_TRADE::XCT_RESERVED_03"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_TRADE, XCT_RESERVED_03) - 4usize];
    ["Offset of field: XC_GROUP_COMMODITY_TRADE::xct_price"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_TRADE, xct_price) - 8usize];
    ["Offset of field: XC_GROUP_COMMODITY_TRADE::xct_size"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_TRADE, xct_size) - 12usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_GROUP_COMMODITY_TRADE_ACCUM"]
        [::std::mem::size_of::<XC_GROUP_COMMODITY_TRADE_ACCUM>() - 8usize];
    ["Alignment of XC_GROUP_COMMODITY_TRADE_ACCUM"]
        [::std::mem::align_of::<XC_GROUP_COMMODITY_TRADE_ACCUM>() - 1usize];
    ["Offset of field: XC_GROUP_COMMODITY_TRADE_ACCUM::xct_volume"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_TRADE_ACCUM, xct_volume) - 0usize];
    ["Offset of field: XC_GROUP_COMMODITY_TRADE_ACCUM::xct_total_change"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_TRADE_ACCUM, xct_total_change) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_GROUP_COMMODITY_TRADE_ALL"]
        [::std::mem::size_of::<XC_GROUP_COMMODITY_TRADE_ALL>() - 64usize];
    ["Alignment of XC_GROUP_COMMODITY_TRADE_ALL"]
        [::std::mem::align_of::<XC_GROUP_COMMODITY_TRADE_ALL>() - 1usize];
    ["Offset of field: XC_GROUP_COMMODITY_TRADE_ALL::xct_exchange_code"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_TRADE_ALL, xct_exchange_code) - 0usize];
    ["Offset of field: XC_GROUP_COMMODITY_TRADE_ALL::xct_country_code"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_TRADE_ALL, xct_country_code) - 2usize];
    ["Offset of field: XC_GROUP_COMMODITY_TRADE_ALL::xct_symbol_type"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_TRADE_ALL, xct_symbol_type) - 5usize];
    ["Offset of field: XC_GROUP_COMMODITY_TRADE_ALL::xct_line_id"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_TRADE_ALL, xct_line_id) - 6usize];
    ["Offset of field: XC_GROUP_COMMODITY_TRADE_ALL::xct_quals"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_TRADE_ALL, xct_quals) - 8usize];
    ["Offset of field: XC_GROUP_COMMODITY_TRADE_ALL::xct_instrument_status"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_TRADE_ALL, xct_instrument_status) - 12usize];
    ["Offset of field: XC_GROUP_COMMODITY_TRADE_ALL::xct_market_status"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_TRADE_ALL, xct_market_status) - 13usize];
    ["Offset of field: XC_GROUP_COMMODITY_TRADE_ALL::XCT_RESERVED_02"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_TRADE_ALL, XCT_RESERVED_02) - 15usize];
    ["Offset of field: XC_GROUP_COMMODITY_TRADE_ALL::xct_exchange_hitime"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_TRADE_ALL, xct_exchange_hitime) - 16usize];
    ["Offset of field: XC_GROUP_COMMODITY_TRADE_ALL::xct_receive_hitime"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_TRADE_ALL, xct_receive_hitime) - 24usize];
    ["Offset of field: XC_GROUP_COMMODITY_TRADE_ALL::xct_sequence"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_TRADE_ALL, xct_sequence) - 32usize];
    ["Offset of field: XC_GROUP_COMMODITY_TRADE_ALL::XCT_RESERVED_03"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_TRADE_ALL, XCT_RESERVED_03) - 40usize];
    ["Offset of field: XC_GROUP_COMMODITY_TRADE_ALL::xct_trade_tick_flags"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_TRADE_ALL, xct_trade_tick_flags) - 42usize];
    ["Offset of field: XC_GROUP_COMMODITY_TRADE_ALL::XCT_RESERVED_05"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_TRADE_ALL, XCT_RESERVED_05) - 43usize];
    ["Offset of field: XC_GROUP_COMMODITY_TRADE_ALL::XCT_RESERVED_06"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_TRADE_ALL, XCT_RESERVED_06) - 44usize];
    ["Offset of field: XC_GROUP_COMMODITY_TRADE_ALL::xct_price"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_TRADE_ALL, xct_price) - 48usize];
    ["Offset of field: XC_GROUP_COMMODITY_TRADE_ALL::xct_size"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_TRADE_ALL, xct_size) - 52usize];
    ["Offset of field: XC_GROUP_COMMODITY_TRADE_ALL::xct_volume"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_TRADE_ALL, xct_volume) - 56usize];
    ["Offset of field: XC_GROUP_COMMODITY_TRADE_ALL::xct_total_change"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_TRADE_ALL, xct_total_change) - 60usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_GROUP_COMMODITY_CANCEL_ALL"]
        [::std::mem::size_of::<XC_GROUP_COMMODITY_CANCEL_ALL>() - 64usize];
    ["Alignment of XC_GROUP_COMMODITY_CANCEL_ALL"]
        [::std::mem::align_of::<XC_GROUP_COMMODITY_CANCEL_ALL>() - 1usize];
    ["Offset of field: XC_GROUP_COMMODITY_CANCEL_ALL::xca_exchange_code"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_CANCEL_ALL, xca_exchange_code) - 0usize];
    ["Offset of field: XC_GROUP_COMMODITY_CANCEL_ALL::xca_country_code"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_CANCEL_ALL, xca_country_code) - 2usize];
    ["Offset of field: XC_GROUP_COMMODITY_CANCEL_ALL::xca_symbol_type"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_CANCEL_ALL, xca_symbol_type) - 5usize];
    ["Offset of field: XC_GROUP_COMMODITY_CANCEL_ALL::xca_line_id"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_CANCEL_ALL, xca_line_id) - 6usize];
    ["Offset of field: XC_GROUP_COMMODITY_CANCEL_ALL::xca_quals"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_CANCEL_ALL, xca_quals) - 8usize];
    ["Offset of field: XC_GROUP_COMMODITY_CANCEL_ALL::xca_instrument_status"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_CANCEL_ALL, xca_instrument_status) - 12usize];
    ["Offset of field: XC_GROUP_COMMODITY_CANCEL_ALL::xca_market_status"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_CANCEL_ALL, xca_market_status) - 13usize];
    ["Offset of field: XC_GROUP_COMMODITY_CANCEL_ALL::XCA_RESERVED_02"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_CANCEL_ALL, XCA_RESERVED_02) - 15usize];
    ["Offset of field: XC_GROUP_COMMODITY_CANCEL_ALL::xca_exchange_hitime"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_CANCEL_ALL, xca_exchange_hitime) - 16usize];
    ["Offset of field: XC_GROUP_COMMODITY_CANCEL_ALL::xca_receive_hitime"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_CANCEL_ALL, xca_receive_hitime) - 24usize];
    ["Offset of field: XC_GROUP_COMMODITY_CANCEL_ALL::xca_sequence"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_CANCEL_ALL, xca_sequence) - 32usize];
    ["Offset of field: XC_GROUP_COMMODITY_CANCEL_ALL::XCA_RESERVED_03"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_CANCEL_ALL, XCA_RESERVED_03) - 40usize];
    ["Offset of field: XC_GROUP_COMMODITY_CANCEL_ALL::xca_trade_tick_flags"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_CANCEL_ALL, xca_trade_tick_flags) - 42usize];
    ["Offset of field: XC_GROUP_COMMODITY_CANCEL_ALL::XCA_RESERVED_05"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_CANCEL_ALL, XCA_RESERVED_05) - 43usize];
    ["Offset of field: XC_GROUP_COMMODITY_CANCEL_ALL::XCA_RESERVED_06"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_CANCEL_ALL, XCA_RESERVED_06) - 44usize];
    ["Offset of field: XC_GROUP_COMMODITY_CANCEL_ALL::xca_price"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_CANCEL_ALL, xca_price) - 48usize];
    ["Offset of field: XC_GROUP_COMMODITY_CANCEL_ALL::xca_size"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_CANCEL_ALL, xca_size) - 52usize];
    ["Offset of field: XC_GROUP_COMMODITY_CANCEL_ALL::xca_volume"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_CANCEL_ALL, xca_volume) - 56usize];
    ["Offset of field: XC_GROUP_COMMODITY_CANCEL_ALL::xca_total_change"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_CANCEL_ALL, xca_total_change) - 60usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_GROUP_COMMODITY_CORRECTION"]
        [::std::mem::size_of::<XC_GROUP_COMMODITY_CORRECTION>() - 32usize];
    ["Alignment of XC_GROUP_COMMODITY_CORRECTION"]
        [::std::mem::align_of::<XC_GROUP_COMMODITY_CORRECTION>() - 1usize];
    ["Offset of field: XC_GROUP_COMMODITY_CORRECTION::XCC_RESERVED_00"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_CORRECTION, XCC_RESERVED_00) - 0usize];
    ["Offset of field: XC_GROUP_COMMODITY_CORRECTION::xcc_cancel_trade_tick_flags"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_CORRECTION,
        xcc_cancel_trade_tick_flags
    ) - 2usize];
    ["Offset of field: XC_GROUP_COMMODITY_CORRECTION::XCC_RESERVED_02"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_CORRECTION, XCC_RESERVED_02) - 3usize];
    ["Offset of field: XC_GROUP_COMMODITY_CORRECTION::XCC_RESERVED_03"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_CORRECTION, XCC_RESERVED_03) - 4usize];
    ["Offset of field: XC_GROUP_COMMODITY_CORRECTION::xcc_cancel_price"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_CORRECTION, xcc_cancel_price) - 8usize];
    ["Offset of field: XC_GROUP_COMMODITY_CORRECTION::xcc_cancel_size"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_CORRECTION, xcc_cancel_size) - 12usize];
    ["Offset of field: XC_GROUP_COMMODITY_CORRECTION::XCC_RESERVED_04"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_CORRECTION, XCC_RESERVED_04) - 16usize];
    ["Offset of field: XC_GROUP_COMMODITY_CORRECTION::xcc_correct_trade_tick_flags"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_CORRECTION,
        xcc_correct_trade_tick_flags
    ) - 18usize];
    ["Offset of field: XC_GROUP_COMMODITY_CORRECTION::XCC_RESERVED_06"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_CORRECTION, XCC_RESERVED_06) - 19usize];
    ["Offset of field: XC_GROUP_COMMODITY_CORRECTION::XCC_RESERVED_07"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_CORRECTION, XCC_RESERVED_07) - 20usize];
    ["Offset of field: XC_GROUP_COMMODITY_CORRECTION::xcc_correct_price"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_CORRECTION, xcc_correct_price) - 24usize];
    ["Offset of field: XC_GROUP_COMMODITY_CORRECTION::xcc_correct_size"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_CORRECTION, xcc_correct_size) - 28usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_GROUP_COMMODITY_CORRECTION_ALL"]
        [::std::mem::size_of::<XC_GROUP_COMMODITY_CORRECTION_ALL>() - 80usize];
    ["Alignment of XC_GROUP_COMMODITY_CORRECTION_ALL"]
        [::std::mem::align_of::<XC_GROUP_COMMODITY_CORRECTION_ALL>() - 1usize];
    ["Offset of field: XC_GROUP_COMMODITY_CORRECTION_ALL::xcc_exchange_code"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_CORRECTION_ALL, xcc_exchange_code) - 0usize];
    ["Offset of field: XC_GROUP_COMMODITY_CORRECTION_ALL::xcc_country_code"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_CORRECTION_ALL, xcc_country_code) - 2usize];
    ["Offset of field: XC_GROUP_COMMODITY_CORRECTION_ALL::xcc_symbol_type"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_CORRECTION_ALL, xcc_symbol_type) - 5usize];
    ["Offset of field: XC_GROUP_COMMODITY_CORRECTION_ALL::xcc_line_id"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_CORRECTION_ALL, xcc_line_id) - 6usize];
    ["Offset of field: XC_GROUP_COMMODITY_CORRECTION_ALL::xcc_quals"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_CORRECTION_ALL, xcc_quals) - 8usize];
    ["Offset of field: XC_GROUP_COMMODITY_CORRECTION_ALL::xcc_instrument_status"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_CORRECTION_ALL,
        xcc_instrument_status
    ) - 12usize];
    ["Offset of field: XC_GROUP_COMMODITY_CORRECTION_ALL::xcc_market_status"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_CORRECTION_ALL, xcc_market_status) - 13usize];
    ["Offset of field: XC_GROUP_COMMODITY_CORRECTION_ALL::XCC_RESERVED_02"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_CORRECTION_ALL, XCC_RESERVED_02) - 15usize];
    ["Offset of field: XC_GROUP_COMMODITY_CORRECTION_ALL::xcc_exchange_hitime"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_CORRECTION_ALL, xcc_exchange_hitime) - 16usize];
    ["Offset of field: XC_GROUP_COMMODITY_CORRECTION_ALL::xcc_receive_hitime"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_CORRECTION_ALL, xcc_receive_hitime) - 24usize];
    ["Offset of field: XC_GROUP_COMMODITY_CORRECTION_ALL::xcc_sequence"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_CORRECTION_ALL, xcc_sequence) - 32usize];
    ["Offset of field: XC_GROUP_COMMODITY_CORRECTION_ALL::XCC_RESERVED_03"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_CORRECTION_ALL, XCC_RESERVED_03) - 40usize];
    ["Offset of field: XC_GROUP_COMMODITY_CORRECTION_ALL::xcc_cancel_trade_tick_flags"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_CORRECTION_ALL,
        xcc_cancel_trade_tick_flags
    )
        - 42usize];
    ["Offset of field: XC_GROUP_COMMODITY_CORRECTION_ALL::XCC_RESERVED_05"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_CORRECTION_ALL, XCC_RESERVED_05) - 43usize];
    ["Offset of field: XC_GROUP_COMMODITY_CORRECTION_ALL::XCC_RESERVED_06"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_CORRECTION_ALL, XCC_RESERVED_06) - 44usize];
    ["Offset of field: XC_GROUP_COMMODITY_CORRECTION_ALL::xcc_cancel_price"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_CORRECTION_ALL, xcc_cancel_price) - 48usize];
    ["Offset of field: XC_GROUP_COMMODITY_CORRECTION_ALL::xcc_cancel_size"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_CORRECTION_ALL, xcc_cancel_size) - 52usize];
    ["Offset of field: XC_GROUP_COMMODITY_CORRECTION_ALL::XCC_RESERVED_07"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_CORRECTION_ALL, XCC_RESERVED_07) - 56usize];
    ["Offset of field: XC_GROUP_COMMODITY_CORRECTION_ALL::xcc_correct_trade_tick_flags"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_CORRECTION_ALL,
        xcc_correct_trade_tick_flags
    )
        - 58usize];
    ["Offset of field: XC_GROUP_COMMODITY_CORRECTION_ALL::XCC_RESERVED_09"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_CORRECTION_ALL, XCC_RESERVED_09) - 59usize];
    ["Offset of field: XC_GROUP_COMMODITY_CORRECTION_ALL::XCC_RESERVED_10"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_CORRECTION_ALL, XCC_RESERVED_10) - 60usize];
    ["Offset of field: XC_GROUP_COMMODITY_CORRECTION_ALL::xcc_correct_price"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_CORRECTION_ALL, xcc_correct_price) - 64usize];
    ["Offset of field: XC_GROUP_COMMODITY_CORRECTION_ALL::xcc_correct_size"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_CORRECTION_ALL, xcc_correct_size) - 68usize];
    ["Offset of field: XC_GROUP_COMMODITY_CORRECTION_ALL::xcc_volume"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_CORRECTION_ALL, xcc_volume) - 72usize];
    ["Offset of field: XC_GROUP_COMMODITY_CORRECTION_ALL::xcc_total_change"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_CORRECTION_ALL, xcc_total_change) - 76usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME"]
        [::std::mem::size_of::<XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME>() - 304usize];
    ["Alignment of XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME"]
        [::std::mem::align_of::<XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME>() - 1usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME::xcr_exchange_code"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME,
        xcr_exchange_code
    ) - 0usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME::xcr_country_code"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME,
        xcr_country_code
    ) - 2usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME::xcr_symbol_type"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME,
        xcr_symbol_type
    ) - 5usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME::xcr_line_id"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME, xcr_line_id) - 6usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME::xcr_quals"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME, xcr_quals) - 8usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME::xcr_instrument_status"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME,
        xcr_instrument_status
    )
        - 12usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME::xcr_market_status"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME,
        xcr_market_status
    ) - 13usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME::XCR_RESERVED_02"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME,
        XCR_RESERVED_02
    ) - 15usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME::xcr_exchange_hitime"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME,
        xcr_exchange_hitime
    )
        - 16usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME::xcr_receive_hitime"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME,
        xcr_receive_hitime
    )
        - 24usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME::xcr_sequence"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME,
        xcr_sequence
    ) - 32usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME::XCR_RESERVED_03"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME,
        XCR_RESERVED_03
    ) - 40usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME::xcr_alternate_id1"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME,
        xcr_alternate_id1
    ) - 48usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME::xcr_alternate_id2"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME,
        xcr_alternate_id2
    ) - 64usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME::xcr_currency"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME,
        xcr_currency
    ) - 80usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME::XCR_RESERVED_04"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME,
        XCR_RESERVED_04
    ) - 83usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME::XCR_RESERVED_05"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME,
        XCR_RESERVED_05
    ) - 84usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME::XCR_RESERVED_06"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME,
        XCR_RESERVED_06
    ) - 88usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME::xcr_exch_time_offset"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME,
        xcr_exch_time_offset
    )
        - 92usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME::XCR_RESERVED_07"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME,
        XCR_RESERVED_07
    ) - 96usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME::xcr_bid_tick_flags"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME,
        xcr_bid_tick_flags
    )
        - 106usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME::XCR_RESERVED_08"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME,
        XCR_RESERVED_08
    ) - 107usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME::xcr_expiration"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME,
        xcr_expiration
    ) - 108usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME::xcr_bid_price"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME,
        xcr_bid_price
    ) - 112usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME::xcr_bid_size"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME,
        xcr_bid_size
    ) - 116usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME::xcr_ask_price"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME,
        xcr_ask_price
    ) - 120usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME::xcr_ask_size"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME,
        xcr_ask_size
    ) - 124usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME::xcr_bid_hitime"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME,
        xcr_bid_hitime
    ) - 128usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME::xcr_ask_hitime"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME,
        xcr_ask_hitime
    ) - 136usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME::xcr_bid_implied_size"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME,
        xcr_bid_implied_size
    )
        - 144usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME::xcr_ask_implied_size"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME,
        xcr_ask_implied_size
    )
        - 148usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME::xcr_pd_setl_price"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME,
        xcr_pd_setl_price
    )
        - 152usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME::XCR_RESERVED_09"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME,
        XCR_RESERVED_09
    ) - 157usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME::xcr_trade_tick_flags"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME,
        xcr_trade_tick_flags
    )
        - 158usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME::XCR_RESERVED_10"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME,
        XCR_RESERVED_10
    ) - 159usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME::xcr_last_price"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME,
        xcr_last_price
    ) - 160usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME::xcr_last_size"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME,
        xcr_last_size
    ) - 164usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME::xcr_volume"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME, xcr_volume) - 168usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME::xcr_total_change"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME,
        xcr_total_change
    ) - 172usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME::xcr_high_price"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME,
        xcr_high_price
    ) - 176usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME::xcr_low_price"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME,
        xcr_low_price
    ) - 180usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME::xcr_open_price_high"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME,
        xcr_open_price_high
    )
        - 184usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME::xcr_open_price_low"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME,
        xcr_open_price_low
    )
        - 188usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME::xcr_close_price_high"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME,
        xcr_close_price_high
    )
        - 192usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME::xcr_close_price_low"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME,
        xcr_close_price_low
    )
        - 196usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME::xcr_pd_setl_hitime"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME,
        xcr_pd_setl_hitime
    )
        - 200usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME::xcr_last_hitime"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME,
        xcr_last_hitime
    ) - 208usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME::xcr_high_hitime"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME,
        xcr_high_hitime
    ) - 216usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME::xcr_low_hitime"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME,
        xcr_low_hitime
    ) - 224usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME::xcr_open_hitime"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME,
        xcr_open_hitime
    ) - 232usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME::xcr_close_hitime"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME,
        xcr_close_hitime
    ) - 240usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME::xcr_setl_hitime"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME,
        xcr_setl_hitime
    ) - 248usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME::xcr_setl_price"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME,
        xcr_setl_price
    ) - 256usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME::xcr_trading_session_date"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME,
        xcr_trading_session_date
    )
        - 260usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME::xcr_open_interest"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME,
        xcr_open_interest
    )
        - 264usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME::xcr_pd_volume"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME,
        xcr_pd_volume
    ) - 268usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME::XCR_RESERVED_11"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME,
        XCR_RESERVED_11
    ) - 272usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME::xcr_quote_quals"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME,
        xcr_quote_quals
    ) - 280usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME::xcr_trade_quals"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME,
        xcr_trade_quals
    ) - 284usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME::xcr_quote_sequence"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME,
        xcr_quote_sequence
    )
        - 288usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME::xcr_trade_sequence"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_ALL_WITH_HITIME,
        xcr_trade_sequence
    )
        - 296usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_GROUP_COMMODITY_REFRESH_ALL"]
        [::std::mem::size_of::<XC_GROUP_COMMODITY_REFRESH_ALL>() - 280usize];
    ["Alignment of XC_GROUP_COMMODITY_REFRESH_ALL"]
        [::std::mem::align_of::<XC_GROUP_COMMODITY_REFRESH_ALL>() - 1usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL::xcr_exchange_code"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_REFRESH_ALL, xcr_exchange_code) - 0usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL::xcr_country_code"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_REFRESH_ALL, xcr_country_code) - 2usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL::xcr_symbol_type"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_REFRESH_ALL, xcr_symbol_type) - 5usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL::xcr_line_id"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_REFRESH_ALL, xcr_line_id) - 6usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL::xcr_quals"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_REFRESH_ALL, xcr_quals) - 8usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL::xcr_instrument_status"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_REFRESH_ALL, xcr_instrument_status) - 12usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL::xcr_market_status"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_REFRESH_ALL, xcr_market_status) - 13usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL::XCR_RESERVED_02"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_REFRESH_ALL, XCR_RESERVED_02) - 15usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL::xcr_exchange_hitime"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_REFRESH_ALL, xcr_exchange_hitime) - 16usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL::xcr_receive_hitime"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_REFRESH_ALL, xcr_receive_hitime) - 24usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL::xcr_sequence"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_REFRESH_ALL, xcr_sequence) - 32usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL::XCR_RESERVED_03"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_REFRESH_ALL, XCR_RESERVED_03) - 40usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL::xcr_alternate_id1"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_REFRESH_ALL, xcr_alternate_id1) - 48usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL::xcr_alternate_id2"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_REFRESH_ALL, xcr_alternate_id2) - 64usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL::xcr_currency"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_REFRESH_ALL, xcr_currency) - 80usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL::XCR_RESERVED_04"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_REFRESH_ALL, XCR_RESERVED_04) - 83usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL::XCR_RESERVED_05"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_REFRESH_ALL, XCR_RESERVED_05) - 84usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL::XCR_RESERVED_06"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_REFRESH_ALL, XCR_RESERVED_06) - 88usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL::xcr_exch_time_offset"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_REFRESH_ALL, xcr_exch_time_offset) - 92usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL::XCR_RESERVED_07"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_REFRESH_ALL, XCR_RESERVED_07) - 96usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL::xcr_bid_tick_flags"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_REFRESH_ALL, xcr_bid_tick_flags) - 106usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL::XCR_RESERVED_08"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_REFRESH_ALL, XCR_RESERVED_08) - 107usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL::xcr_expiration"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_REFRESH_ALL, xcr_expiration) - 108usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL::xcr_bid_price"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_REFRESH_ALL, xcr_bid_price) - 112usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL::xcr_bid_size"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_REFRESH_ALL, xcr_bid_size) - 116usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL::xcr_ask_price"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_REFRESH_ALL, xcr_ask_price) - 120usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL::xcr_ask_size"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_REFRESH_ALL, xcr_ask_size) - 124usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL::xcr_bid_extime"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_REFRESH_ALL, xcr_bid_extime) - 128usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL::xcr_ask_extime"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_REFRESH_ALL, xcr_ask_extime) - 136usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL::xcr_bid_implied_size"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_REFRESH_ALL, xcr_bid_implied_size) - 144usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL::xcr_ask_implied_size"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_REFRESH_ALL, xcr_ask_implied_size) - 148usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL::xcr_pd_setl_price"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_REFRESH_ALL, xcr_pd_setl_price) - 152usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL::XCR_RESERVED_09"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_REFRESH_ALL, XCR_RESERVED_09) - 157usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL::xcr_trade_tick_flags"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_REFRESH_ALL, xcr_trade_tick_flags) - 158usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL::XCR_RESERVED_10"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_REFRESH_ALL, XCR_RESERVED_10) - 159usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL::xcr_last_price"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_REFRESH_ALL, xcr_last_price) - 160usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL::xcr_last_size"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_REFRESH_ALL, xcr_last_size) - 164usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL::xcr_volume"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_REFRESH_ALL, xcr_volume) - 168usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL::xcr_total_change"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_REFRESH_ALL, xcr_total_change) - 172usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL::xcr_high_price"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_REFRESH_ALL, xcr_high_price) - 176usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL::xcr_low_price"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_REFRESH_ALL, xcr_low_price) - 180usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL::xcr_open_price_high"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_REFRESH_ALL, xcr_open_price_high) - 184usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL::xcr_open_price_low"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_REFRESH_ALL, xcr_open_price_low) - 188usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL::xcr_close_price_high"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_REFRESH_ALL, xcr_close_price_high) - 192usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL::xcr_close_price_low"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_REFRESH_ALL, xcr_close_price_low) - 196usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL::xcr_pd_setl_extime"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_REFRESH_ALL, xcr_pd_setl_extime) - 200usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL::xcr_last_extime"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_REFRESH_ALL, xcr_last_extime) - 208usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL::xcr_high_extime"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_REFRESH_ALL, xcr_high_extime) - 216usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL::xcr_low_extime"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_REFRESH_ALL, xcr_low_extime) - 224usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL::xcr_open_extime"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_REFRESH_ALL, xcr_open_extime) - 232usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL::xcr_close_extime"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_REFRESH_ALL, xcr_close_extime) - 240usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL::xcr_setl_extime"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_REFRESH_ALL, xcr_setl_extime) - 248usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL::xcr_setl_price"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_REFRESH_ALL, xcr_setl_price) - 256usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL::xcr_trading_session_date"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_ALL,
        xcr_trading_session_date
    ) - 260usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL::xcr_open_interest"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_REFRESH_ALL, xcr_open_interest) - 264usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL::xcr_pd_volume"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_REFRESH_ALL, xcr_pd_volume) - 268usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_ALL::XCR_RESERVED_11"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_REFRESH_ALL, XCR_RESERVED_11) - 272usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL"]
        [::std::mem::size_of::<XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL>() - 304usize];
    ["Alignment of XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL"]
        [::std::mem::align_of::<XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL>() - 1usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL::xcr_exchange_code"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL,
        xcr_exchange_code
    ) - 0usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL::xcr_country_code"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL,
        xcr_country_code
    ) - 2usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL::xcr_symbol_type"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL,
        xcr_symbol_type
    ) - 5usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL::xcr_line_id"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL, xcr_line_id) - 6usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL::xcr_quals"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL, xcr_quals) - 8usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL::xcr_instrument_status"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL,
        xcr_instrument_status
    )
        - 12usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL::xcr_market_status"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL,
        xcr_market_status
    ) - 13usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL::XCR_RESERVED_02"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL,
        XCR_RESERVED_02
    ) - 15usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL::xcr_exchange_hitime"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL,
        xcr_exchange_hitime
    )
        - 16usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL::xcr_receive_hitime"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL,
        xcr_receive_hitime
    ) - 24usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL::xcr_sequence"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL, xcr_sequence) - 32usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL::XCR_RESERVED_03"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL,
        XCR_RESERVED_03
    ) - 40usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL::xcr_alternate_id1"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL,
        xcr_alternate_id1
    ) - 48usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL::xcr_alternate_id2"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL,
        xcr_alternate_id2
    ) - 64usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL::xcr_currency"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL, xcr_currency) - 80usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL::XCR_RESERVED_04"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL,
        XCR_RESERVED_04
    ) - 83usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL::XCR_RESERVED_05"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL,
        XCR_RESERVED_05
    ) - 84usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL::XCR_RESERVED_06"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL,
        XCR_RESERVED_06
    ) - 88usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL::xcr_exch_time_offset"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL,
        xcr_exch_time_offset
    )
        - 92usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL::XCR_RESERVED_07"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL,
        XCR_RESERVED_07
    ) - 96usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL::xcr_bid_tick_flags"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL,
        xcr_bid_tick_flags
    )
        - 106usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL::XCR_RESERVED_08"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL,
        XCR_RESERVED_08
    ) - 107usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL::xcr_expiration"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL,
        xcr_expiration
    ) - 108usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL::xcr_bid_price"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL,
        xcr_bid_price
    ) - 112usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL::xcr_bid_size"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL,
        xcr_bid_size
    ) - 116usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL::xcr_ask_price"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL,
        xcr_ask_price
    ) - 120usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL::xcr_ask_size"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL,
        xcr_ask_size
    ) - 124usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL::xcr_bid_extime"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL,
        xcr_bid_extime
    ) - 128usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL::xcr_ask_extime"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL,
        xcr_ask_extime
    ) - 136usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL::xcr_bid_implied_size"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL,
        xcr_bid_implied_size
    )
        - 144usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL::xcr_ask_implied_size"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL,
        xcr_ask_implied_size
    )
        - 148usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL::xcr_pd_setl_price"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL,
        xcr_pd_setl_price
    ) - 152usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL::XCR_RESERVED_09"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL,
        XCR_RESERVED_09
    ) - 157usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL::xcr_trade_tick_flags"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL,
        xcr_trade_tick_flags
    )
        - 158usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL::XCR_RESERVED_10"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL,
        XCR_RESERVED_10
    ) - 159usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL::xcr_last_price"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL,
        xcr_last_price
    ) - 160usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL::xcr_last_size"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL,
        xcr_last_size
    ) - 164usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL::xcr_volume"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL, xcr_volume) - 168usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL::xcr_total_change"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL,
        xcr_total_change
    ) - 172usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL::xcr_high_price"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL,
        xcr_high_price
    ) - 176usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL::xcr_low_price"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL,
        xcr_low_price
    ) - 180usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL::xcr_open_price_high"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL,
        xcr_open_price_high
    )
        - 184usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL::xcr_open_price_low"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL,
        xcr_open_price_low
    )
        - 188usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL::xcr_close_price_high"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL,
        xcr_close_price_high
    )
        - 192usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL::xcr_close_price_low"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL,
        xcr_close_price_low
    )
        - 196usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL::xcr_pd_setl_extime"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL,
        xcr_pd_setl_extime
    )
        - 200usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL::xcr_last_extime"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL,
        xcr_last_extime
    ) - 208usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL::xcr_high_extime"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL,
        xcr_high_extime
    ) - 216usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL::xcr_low_extime"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL,
        xcr_low_extime
    ) - 224usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL::xcr_open_extime"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL,
        xcr_open_extime
    ) - 232usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL::xcr_close_extime"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL,
        xcr_close_extime
    ) - 240usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL::xcr_setl_extime"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL,
        xcr_setl_extime
    ) - 248usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL::xcr_setl_price"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL,
        xcr_setl_price
    ) - 256usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL::xcr_trading_session_date"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL,
        xcr_trading_session_date
    )
        - 260usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL::xcr_open_interest"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL,
        xcr_open_interest
    ) - 264usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL::xcr_pd_volume"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL,
        xcr_pd_volume
    ) - 268usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL::XCR_RESERVED_11"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL,
        XCR_RESERVED_11
    ) - 272usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL::xcr_quote_quals"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL,
        xcr_quote_quals
    ) - 280usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL::xcr_trade_quals"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL,
        xcr_trade_quals
    ) - 284usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL::xcr_quote_sequence"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL,
        xcr_quote_sequence
    )
        - 288usize];
    ["Offset of field: XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL::xcr_trade_sequence"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_REFRESH_WITH_QUALS_ALL,
        xcr_trade_sequence
    )
        - 296usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME"]
        [::std::mem::size_of::<XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME>() - 272usize];
    ["Alignment of XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME"]
        [::std::mem::align_of::<XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME>() - 1usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME::xci_exchange_code"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME,
        xci_exchange_code
    ) - 0usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME::xci_country_code"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME,
        xci_country_code
    ) - 2usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME::xci_symbol"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME, xci_symbol) - 4usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME::xci_symbol_type"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME,
        xci_symbol_type
    ) - 25usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME::xci_instrument_status"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME,
        xci_instrument_status
    )
        - 26usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME::xci_market_status"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME,
        xci_market_status
    ) - 27usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME::XCI_RESERVED_02"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME,
        XCI_RESERVED_02
    ) - 29usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME::XCI_RESERVED_03"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME,
        XCI_RESERVED_03
    ) - 30usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME::XCI_RESERVED_04"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME,
        XCI_RESERVED_04
    ) - 32usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME::xci_alternate_id1"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME,
        xci_alternate_id1
    ) - 40usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME::xci_alternate_id2"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME,
        xci_alternate_id2
    ) - 56usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME::xci_currency"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME, xci_currency) - 72usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME::XCI_RESERVED_05"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME,
        XCI_RESERVED_05
    ) - 75usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME::XCI_RESERVED_06"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME,
        XCI_RESERVED_06
    ) - 76usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME::XCI_RESERVED_07"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME,
        XCI_RESERVED_07
    ) - 80usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME::xci_exch_time_offset"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME,
        xci_exch_time_offset
    )
        - 84usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME::XCI_RESERVED_08"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME,
        XCI_RESERVED_08
    ) - 88usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME::xci_bid_tick_flags"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME,
        xci_bid_tick_flags
    ) - 98usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME::XCI_RESERVED_09"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME,
        XCI_RESERVED_09
    ) - 99usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME::xci_expiration"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME,
        xci_expiration
    ) - 100usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME::xci_bid_price"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME,
        xci_bid_price
    ) - 104usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME::xci_bid_size"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME, xci_bid_size) - 108usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME::xci_ask_price"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME,
        xci_ask_price
    ) - 112usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME::xci_ask_size"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME, xci_ask_size) - 116usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME::xci_bid_hitime"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME,
        xci_bid_hitime
    ) - 120usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME::xci_ask_hitime"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME,
        xci_ask_hitime
    ) - 128usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME::xci_bid_implied_size"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME,
        xci_bid_implied_size
    )
        - 136usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME::xci_ask_implied_size"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME,
        xci_ask_implied_size
    )
        - 140usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME::xci_pd_setl_price"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME,
        xci_pd_setl_price
    ) - 144usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME::XCI_RESERVED_10"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME,
        XCI_RESERVED_10
    ) - 149usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME::xci_trade_tick_flags"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME,
        xci_trade_tick_flags
    )
        - 150usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME::XCI_RESERVED_11"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME,
        XCI_RESERVED_11
    ) - 151usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME::xci_last_price"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME,
        xci_last_price
    ) - 152usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME::xci_last_size"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME,
        xci_last_size
    ) - 156usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME::xci_volume"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME, xci_volume) - 160usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME::xci_total_change"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME,
        xci_total_change
    ) - 164usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME::xci_high_price"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME,
        xci_high_price
    ) - 168usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME::xci_low_price"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME,
        xci_low_price
    ) - 172usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME::xci_open_price_high"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME,
        xci_open_price_high
    )
        - 176usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME::xci_open_price_low"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME,
        xci_open_price_low
    ) - 180usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME::xci_close_price_high"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME,
        xci_close_price_high
    )
        - 184usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME::xci_close_price_low"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME,
        xci_close_price_low
    )
        - 188usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME::xci_pd_setl_hitime"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME,
        xci_pd_setl_hitime
    ) - 192usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME::xci_last_hitime"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME,
        xci_last_hitime
    ) - 200usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME::xci_high_hitime"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME,
        xci_high_hitime
    ) - 208usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME::xci_low_hitime"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME,
        xci_low_hitime
    ) - 216usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME::xci_open_hitime"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME,
        xci_open_hitime
    ) - 224usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME::xci_close_hitime"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME,
        xci_close_hitime
    ) - 232usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME::xci_setl_hitime"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME,
        xci_setl_hitime
    ) - 240usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME::xci_setl_price"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME,
        xci_setl_price
    ) - 248usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME::xci_trading_session_date"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME,
        xci_trading_session_date
    )
        - 252usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME::xci_open_interest"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME,
        xci_open_interest
    ) - 256usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME::xci_pd_volume"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME,
        xci_pd_volume
    ) - 260usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME::XCI_RESERVED_12"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_IMAGE_ALL_WITH_HITIME,
        XCI_RESERVED_12
    ) - 264usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_GROUP_COMMODITY_IMAGE_ALL"]
        [::std::mem::size_of::<XC_GROUP_COMMODITY_IMAGE_ALL>() - 272usize];
    ["Alignment of XC_GROUP_COMMODITY_IMAGE_ALL"]
        [::std::mem::align_of::<XC_GROUP_COMMODITY_IMAGE_ALL>() - 1usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL::xci_exchange_code"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_IMAGE_ALL, xci_exchange_code) - 0usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL::xci_country_code"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_IMAGE_ALL, xci_country_code) - 2usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL::xci_symbol"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_IMAGE_ALL, xci_symbol) - 4usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL::xci_symbol_type"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_IMAGE_ALL, xci_symbol_type) - 25usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL::xci_instrument_status"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_IMAGE_ALL, xci_instrument_status) - 26usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL::xci_market_status"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_IMAGE_ALL, xci_market_status) - 27usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL::XCI_RESERVED_02"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_IMAGE_ALL, XCI_RESERVED_02) - 29usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL::XCI_RESERVED_03"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_IMAGE_ALL, XCI_RESERVED_03) - 30usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL::XCI_RESERVED_04"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_IMAGE_ALL, XCI_RESERVED_04) - 32usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL::xci_alternate_id1"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_IMAGE_ALL, xci_alternate_id1) - 40usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL::xci_alternate_id2"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_IMAGE_ALL, xci_alternate_id2) - 56usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL::xci_currency"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_IMAGE_ALL, xci_currency) - 72usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL::XCI_RESERVED_05"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_IMAGE_ALL, XCI_RESERVED_05) - 75usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL::XCI_RESERVED_06"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_IMAGE_ALL, XCI_RESERVED_06) - 76usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL::XCI_RESERVED_07"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_IMAGE_ALL, XCI_RESERVED_07) - 80usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL::xci_exch_time_offset"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_IMAGE_ALL, xci_exch_time_offset) - 84usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL::XCI_RESERVED_08"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_IMAGE_ALL, XCI_RESERVED_08) - 88usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL::xci_bid_tick_flags"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_IMAGE_ALL, xci_bid_tick_flags) - 98usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL::XCI_RESERVED_09"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_IMAGE_ALL, XCI_RESERVED_09) - 99usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL::xci_expiration"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_IMAGE_ALL, xci_expiration) - 100usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL::xci_bid_price"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_IMAGE_ALL, xci_bid_price) - 104usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL::xci_bid_size"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_IMAGE_ALL, xci_bid_size) - 108usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL::xci_ask_price"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_IMAGE_ALL, xci_ask_price) - 112usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL::xci_ask_size"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_IMAGE_ALL, xci_ask_size) - 116usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL::xci_bid_extime"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_IMAGE_ALL, xci_bid_extime) - 120usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL::xci_ask_extime"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_IMAGE_ALL, xci_ask_extime) - 128usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL::xci_bid_implied_size"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_IMAGE_ALL, xci_bid_implied_size) - 136usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL::xci_ask_implied_size"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_IMAGE_ALL, xci_ask_implied_size) - 140usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL::xci_pd_setl_price"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_IMAGE_ALL, xci_pd_setl_price) - 144usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL::XCI_RESERVED_10"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_IMAGE_ALL, XCI_RESERVED_10) - 149usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL::xci_trade_tick_flags"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_IMAGE_ALL, xci_trade_tick_flags) - 150usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL::XCI_RESERVED_11"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_IMAGE_ALL, XCI_RESERVED_11) - 151usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL::xci_last_price"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_IMAGE_ALL, xci_last_price) - 152usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL::xci_last_size"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_IMAGE_ALL, xci_last_size) - 156usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL::xci_volume"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_IMAGE_ALL, xci_volume) - 160usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL::xci_total_change"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_IMAGE_ALL, xci_total_change) - 164usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL::xci_high_price"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_IMAGE_ALL, xci_high_price) - 168usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL::xci_low_price"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_IMAGE_ALL, xci_low_price) - 172usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL::xci_open_price_high"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_IMAGE_ALL, xci_open_price_high) - 176usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL::xci_open_price_low"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_IMAGE_ALL, xci_open_price_low) - 180usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL::xci_close_price_high"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_IMAGE_ALL, xci_close_price_high) - 184usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL::xci_close_price_low"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_IMAGE_ALL, xci_close_price_low) - 188usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL::xci_pd_setl_extime"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_IMAGE_ALL, xci_pd_setl_extime) - 192usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL::xci_last_extime"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_IMAGE_ALL, xci_last_extime) - 200usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL::xci_high_extime"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_IMAGE_ALL, xci_high_extime) - 208usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL::xci_low_extime"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_IMAGE_ALL, xci_low_extime) - 216usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL::xci_open_extime"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_IMAGE_ALL, xci_open_extime) - 224usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL::xci_close_extime"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_IMAGE_ALL, xci_close_extime) - 232usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL::xci_setl_extime"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_IMAGE_ALL, xci_setl_extime) - 240usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL::xci_setl_price"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_IMAGE_ALL, xci_setl_price) - 248usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL::xci_trading_session_date"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_IMAGE_ALL, xci_trading_session_date) - 252usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL::xci_open_interest"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_IMAGE_ALL, xci_open_interest) - 256usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL::xci_pd_volume"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_IMAGE_ALL, xci_pd_volume) - 260usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_ALL::XCI_RESERVED_12"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_IMAGE_ALL, XCI_RESERVED_12) - 264usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL"]
        [::std::mem::size_of::<XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL>() - 296usize];
    ["Alignment of XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL"]
        [::std::mem::align_of::<XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL>() - 1usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL::xci_exchange_code"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL,
        xci_exchange_code
    ) - 0usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL::xci_country_code"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL,
        xci_country_code
    ) - 2usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL::xci_symbol"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL, xci_symbol) - 4usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL::xci_symbol_type"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL,
        xci_symbol_type
    ) - 25usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL::xci_instrument_status"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL,
        xci_instrument_status
    )
        - 26usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL::xci_market_status"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL,
        xci_market_status
    ) - 27usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL::XCI_RESERVED_02"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL,
        XCI_RESERVED_02
    ) - 29usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL::XCI_RESERVED_03"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL,
        XCI_RESERVED_03
    ) - 30usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL::XCI_RESERVED_04"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL,
        XCI_RESERVED_04
    ) - 32usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL::xci_alternate_id1"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL,
        xci_alternate_id1
    ) - 40usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL::xci_alternate_id2"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL,
        xci_alternate_id2
    ) - 56usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL::xci_currency"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL, xci_currency) - 72usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL::XCI_RESERVED_05"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL,
        XCI_RESERVED_05
    ) - 75usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL::XCI_RESERVED_06"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL,
        XCI_RESERVED_06
    ) - 76usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL::XCI_RESERVED_07"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL,
        XCI_RESERVED_07
    ) - 80usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL::xci_exch_time_offset"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL,
        xci_exch_time_offset
    ) - 84usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL::XCI_RESERVED_08"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL,
        XCI_RESERVED_08
    ) - 88usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL::xci_bid_tick_flags"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL,
        xci_bid_tick_flags
    ) - 98usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL::XCI_RESERVED_09"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL,
        XCI_RESERVED_09
    ) - 99usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL::xci_expiration"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL,
        xci_expiration
    ) - 100usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL::xci_bid_price"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL, xci_bid_price) - 104usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL::xci_bid_size"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL, xci_bid_size) - 108usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL::xci_ask_price"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL, xci_ask_price) - 112usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL::xci_ask_size"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL, xci_ask_size) - 116usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL::xci_bid_extime"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL,
        xci_bid_extime
    ) - 120usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL::xci_ask_extime"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL,
        xci_ask_extime
    ) - 128usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL::xci_bid_implied_size"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL,
        xci_bid_implied_size
    )
        - 136usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL::xci_ask_implied_size"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL,
        xci_ask_implied_size
    )
        - 140usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL::xci_pd_setl_price"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL,
        xci_pd_setl_price
    ) - 144usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL::XCI_RESERVED_10"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL,
        XCI_RESERVED_10
    ) - 149usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL::xci_trade_tick_flags"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL,
        xci_trade_tick_flags
    )
        - 150usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL::XCI_RESERVED_11"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL,
        XCI_RESERVED_11
    ) - 151usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL::xci_last_price"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL,
        xci_last_price
    ) - 152usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL::xci_last_size"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL, xci_last_size) - 156usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL::xci_volume"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL, xci_volume) - 160usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL::xci_total_change"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL,
        xci_total_change
    ) - 164usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL::xci_high_price"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL,
        xci_high_price
    ) - 168usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL::xci_low_price"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL, xci_low_price) - 172usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL::xci_open_price_high"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL,
        xci_open_price_high
    ) - 176usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL::xci_open_price_low"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL,
        xci_open_price_low
    ) - 180usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL::xci_close_price_high"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL,
        xci_close_price_high
    )
        - 184usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL::xci_close_price_low"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL,
        xci_close_price_low
    ) - 188usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL::xci_pd_setl_extime"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL,
        xci_pd_setl_extime
    ) - 192usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL::xci_last_extime"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL,
        xci_last_extime
    ) - 200usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL::xci_high_extime"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL,
        xci_high_extime
    ) - 208usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL::xci_low_extime"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL,
        xci_low_extime
    ) - 216usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL::xci_open_extime"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL,
        xci_open_extime
    ) - 224usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL::xci_close_extime"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL,
        xci_close_extime
    ) - 232usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL::xci_setl_extime"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL,
        xci_setl_extime
    ) - 240usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL::xci_setl_price"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL,
        xci_setl_price
    ) - 248usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL::xci_trading_session_date"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL,
        xci_trading_session_date
    )
        - 252usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL::xci_open_interest"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL,
        xci_open_interest
    ) - 256usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL::xci_pd_volume"]
        [::std::mem::offset_of!(XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL, xci_pd_volume) - 260usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL::XCI_RESERVED_12"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL,
        XCI_RESERVED_12
    ) - 264usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL::xci_quote_quals"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL,
        xci_quote_quals
    ) - 272usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL::xci_trade_quals"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL,
        xci_trade_quals
    ) - 276usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL::xci_quote_sequence"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL,
        xci_quote_sequence
    ) - 280usize];
    ["Offset of field: XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL::xci_trade_sequence"][::std::mem::offset_of!(
        XC_GROUP_COMMODITY_IMAGE_WITH_QUALS_ALL,
        xci_trade_sequence
    ) - 288usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_GROUP_ORDER_BOOK_ENTRY"]
        [::std::mem::size_of::<XC_GROUP_ORDER_BOOK_ENTRY>() - 48usize];
    ["Alignment of XC_GROUP_ORDER_BOOK_ENTRY"]
        [::std::mem::align_of::<XC_GROUP_ORDER_BOOK_ENTRY>() - 1usize];
    ["Offset of field: XC_GROUP_ORDER_BOOK_ENTRY::XOB_RESERVED_01"]
        [::std::mem::offset_of!(XC_GROUP_ORDER_BOOK_ENTRY, XOB_RESERVED_01) - 1usize];
    ["Offset of field: XC_GROUP_ORDER_BOOK_ENTRY::xob_mmid"]
        [::std::mem::offset_of!(XC_GROUP_ORDER_BOOK_ENTRY, xob_mmid) - 2usize];
    ["Offset of field: XC_GROUP_ORDER_BOOK_ENTRY::xob_price"]
        [::std::mem::offset_of!(XC_GROUP_ORDER_BOOK_ENTRY, xob_price) - 8usize];
    ["Offset of field: XC_GROUP_ORDER_BOOK_ENTRY::xob_size"]
        [::std::mem::offset_of!(XC_GROUP_ORDER_BOOK_ENTRY, xob_size) - 12usize];
    ["Offset of field: XC_GROUP_ORDER_BOOK_ENTRY::xob_order_quals"]
        [::std::mem::offset_of!(XC_GROUP_ORDER_BOOK_ENTRY, xob_order_quals) - 16usize];
    ["Offset of field: XC_GROUP_ORDER_BOOK_ENTRY::xob_order_ref"]
        [::std::mem::offset_of!(XC_GROUP_ORDER_BOOK_ENTRY, xob_order_ref) - 20usize];
    ["Offset of field: XC_GROUP_ORDER_BOOK_ENTRY::xob_origin_extime"]
        [::std::mem::offset_of!(XC_GROUP_ORDER_BOOK_ENTRY, xob_origin_extime) - 32usize];
    ["Offset of field: XC_GROUP_ORDER_BOOK_ENTRY::xob_exch"]
        [::std::mem::offset_of!(XC_GROUP_ORDER_BOOK_ENTRY, xob_exch) - 40usize];
    ["Offset of field: XC_GROUP_ORDER_BOOK_ENTRY::xob_country"]
        [::std::mem::offset_of!(XC_GROUP_ORDER_BOOK_ENTRY, xob_country) - 42usize];
    ["Offset of field: XC_GROUP_ORDER_BOOK_ENTRY::XOB_RESERVED_02"]
        [::std::mem::offset_of!(XC_GROUP_ORDER_BOOK_ENTRY, XOB_RESERVED_02) - 44usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_GROUP_ORDER_BOOK_ENTRY_WITH_PRIORITY"]
        [::std::mem::size_of::<XC_GROUP_ORDER_BOOK_ENTRY_WITH_PRIORITY>() - 56usize];
    ["Alignment of XC_GROUP_ORDER_BOOK_ENTRY_WITH_PRIORITY"]
        [::std::mem::align_of::<XC_GROUP_ORDER_BOOK_ENTRY_WITH_PRIORITY>() - 1usize];
    ["Offset of field: XC_GROUP_ORDER_BOOK_ENTRY_WITH_PRIORITY::XOB_RESERVED_01"]
        [::std::mem::offset_of!(XC_GROUP_ORDER_BOOK_ENTRY_WITH_PRIORITY, XOB_RESERVED_01) - 1usize];
    ["Offset of field: XC_GROUP_ORDER_BOOK_ENTRY_WITH_PRIORITY::xob_mmid"]
        [::std::mem::offset_of!(XC_GROUP_ORDER_BOOK_ENTRY_WITH_PRIORITY, xob_mmid) - 2usize];
    ["Offset of field: XC_GROUP_ORDER_BOOK_ENTRY_WITH_PRIORITY::xob_price"]
        [::std::mem::offset_of!(XC_GROUP_ORDER_BOOK_ENTRY_WITH_PRIORITY, xob_price) - 8usize];
    ["Offset of field: XC_GROUP_ORDER_BOOK_ENTRY_WITH_PRIORITY::xob_size"]
        [::std::mem::offset_of!(XC_GROUP_ORDER_BOOK_ENTRY_WITH_PRIORITY, xob_size) - 12usize];
    ["Offset of field: XC_GROUP_ORDER_BOOK_ENTRY_WITH_PRIORITY::xob_order_quals"][::std::mem::offset_of!(
        XC_GROUP_ORDER_BOOK_ENTRY_WITH_PRIORITY,
        xob_order_quals
    ) - 16usize];
    ["Offset of field: XC_GROUP_ORDER_BOOK_ENTRY_WITH_PRIORITY::xob_order_ref"]
        [::std::mem::offset_of!(XC_GROUP_ORDER_BOOK_ENTRY_WITH_PRIORITY, xob_order_ref) - 20usize];
    ["Offset of field: XC_GROUP_ORDER_BOOK_ENTRY_WITH_PRIORITY::xob_origin_extime"][::std::mem::offset_of!(
        XC_GROUP_ORDER_BOOK_ENTRY_WITH_PRIORITY,
        xob_origin_extime
    ) - 32usize];
    ["Offset of field: XC_GROUP_ORDER_BOOK_ENTRY_WITH_PRIORITY::xob_exch"]
        [::std::mem::offset_of!(XC_GROUP_ORDER_BOOK_ENTRY_WITH_PRIORITY, xob_exch) - 40usize];
    ["Offset of field: XC_GROUP_ORDER_BOOK_ENTRY_WITH_PRIORITY::xob_country"]
        [::std::mem::offset_of!(XC_GROUP_ORDER_BOOK_ENTRY_WITH_PRIORITY, xob_country) - 42usize];
    ["Offset of field: XC_GROUP_ORDER_BOOK_ENTRY_WITH_PRIORITY::XOB_RESERVED_02"][::std::mem::offset_of!(
        XC_GROUP_ORDER_BOOK_ENTRY_WITH_PRIORITY,
        XOB_RESERVED_02
    ) - 44usize];
    ["Offset of field: XC_GROUP_ORDER_BOOK_ENTRY_WITH_PRIORITY::xob_order_priority"][::std::mem::offset_of!(
        XC_GROUP_ORDER_BOOK_ENTRY_WITH_PRIORITY,
        xob_order_priority
    ) - 48usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_GROUP_PRICE_BOOK_ENTRY"]
        [::std::mem::size_of::<XC_GROUP_PRICE_BOOK_ENTRY>() - 24usize];
    ["Alignment of XC_GROUP_PRICE_BOOK_ENTRY"]
        [::std::mem::align_of::<XC_GROUP_PRICE_BOOK_ENTRY>() - 1usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_ENTRY::XPB_RESERVED_01"]
        [::std::mem::offset_of!(XC_GROUP_PRICE_BOOK_ENTRY, XPB_RESERVED_01) - 1usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_ENTRY::xpb_order_count"]
        [::std::mem::offset_of!(XC_GROUP_PRICE_BOOK_ENTRY, xpb_order_count) - 2usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_ENTRY::xpb_exch"]
        [::std::mem::offset_of!(XC_GROUP_PRICE_BOOK_ENTRY, xpb_exch) - 4usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_ENTRY::xpb_country"]
        [::std::mem::offset_of!(XC_GROUP_PRICE_BOOK_ENTRY, xpb_country) - 6usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_ENTRY::xpb_price"]
        [::std::mem::offset_of!(XC_GROUP_PRICE_BOOK_ENTRY, xpb_price) - 8usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_ENTRY::xpb_volume"]
        [::std::mem::offset_of!(XC_GROUP_PRICE_BOOK_ENTRY, xpb_volume) - 12usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_ENTRY::xpb_extime"]
        [::std::mem::offset_of!(XC_GROUP_PRICE_BOOK_ENTRY, xpb_extime) - 16usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_GROUP_PRICE_BOOK_ENTRY_WITH_CPMVOL"]
        [::std::mem::size_of::<XC_GROUP_PRICE_BOOK_ENTRY_WITH_CPMVOL>() - 40usize];
    ["Alignment of XC_GROUP_PRICE_BOOK_ENTRY_WITH_CPMVOL"]
        [::std::mem::align_of::<XC_GROUP_PRICE_BOOK_ENTRY_WITH_CPMVOL>() - 1usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_ENTRY_WITH_CPMVOL::XPB_RESERVED_01"]
        [::std::mem::offset_of!(XC_GROUP_PRICE_BOOK_ENTRY_WITH_CPMVOL, XPB_RESERVED_01) - 1usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_ENTRY_WITH_CPMVOL::xpb_order_count"]
        [::std::mem::offset_of!(XC_GROUP_PRICE_BOOK_ENTRY_WITH_CPMVOL, xpb_order_count) - 2usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_ENTRY_WITH_CPMVOL::xpb_exch"]
        [::std::mem::offset_of!(XC_GROUP_PRICE_BOOK_ENTRY_WITH_CPMVOL, xpb_exch) - 4usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_ENTRY_WITH_CPMVOL::xpb_country"]
        [::std::mem::offset_of!(XC_GROUP_PRICE_BOOK_ENTRY_WITH_CPMVOL, xpb_country) - 6usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_ENTRY_WITH_CPMVOL::xpb_price"]
        [::std::mem::offset_of!(XC_GROUP_PRICE_BOOK_ENTRY_WITH_CPMVOL, xpb_price) - 8usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_ENTRY_WITH_CPMVOL::xpb_volume"]
        [::std::mem::offset_of!(XC_GROUP_PRICE_BOOK_ENTRY_WITH_CPMVOL, xpb_volume) - 12usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_ENTRY_WITH_CPMVOL::xpb_extime"]
        [::std::mem::offset_of!(XC_GROUP_PRICE_BOOK_ENTRY_WITH_CPMVOL, xpb_extime) - 16usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_ENTRY_WITH_CPMVOL::xpb_customer_volume"][::std::mem::offset_of!(
        XC_GROUP_PRICE_BOOK_ENTRY_WITH_CPMVOL,
        xpb_customer_volume
    ) - 24usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_ENTRY_WITH_CPMVOL::xpb_professional_volume"][::std::mem::offset_of!(
        XC_GROUP_PRICE_BOOK_ENTRY_WITH_CPMVOL,
        xpb_professional_volume
    )
        - 28usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_ENTRY_WITH_CPMVOL::xpb_market_maker_volume"][::std::mem::offset_of!(
        XC_GROUP_PRICE_BOOK_ENTRY_WITH_CPMVOL,
        xpb_market_maker_volume
    )
        - 32usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_ENTRY_WITH_CPMVOL::XPB_RESERVED_02"]
        [::std::mem::offset_of!(XC_GROUP_PRICE_BOOK_ENTRY_WITH_CPMVOL, XPB_RESERVED_02) - 36usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_GROUP_PRICE_BOOK_LEVEL"]
        [::std::mem::size_of::<XC_GROUP_PRICE_BOOK_LEVEL>() - 32usize];
    ["Alignment of XC_GROUP_PRICE_BOOK_LEVEL"]
        [::std::mem::align_of::<XC_GROUP_PRICE_BOOK_LEVEL>() - 1usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_LEVEL::XPB_RESERVED_01"]
        [::std::mem::offset_of!(XC_GROUP_PRICE_BOOK_LEVEL, XPB_RESERVED_01) - 1usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_LEVEL::xpb_order_count"]
        [::std::mem::offset_of!(XC_GROUP_PRICE_BOOK_LEVEL, xpb_order_count) - 2usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_LEVEL::xpb_exch"]
        [::std::mem::offset_of!(XC_GROUP_PRICE_BOOK_LEVEL, xpb_exch) - 4usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_LEVEL::xpb_country"]
        [::std::mem::offset_of!(XC_GROUP_PRICE_BOOK_LEVEL, xpb_country) - 6usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_LEVEL::xpb_price"]
        [::std::mem::offset_of!(XC_GROUP_PRICE_BOOK_LEVEL, xpb_price) - 8usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_LEVEL::xpb_volume"]
        [::std::mem::offset_of!(XC_GROUP_PRICE_BOOK_LEVEL, xpb_volume) - 12usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_LEVEL::xpb_extime"]
        [::std::mem::offset_of!(XC_GROUP_PRICE_BOOK_LEVEL, xpb_extime) - 16usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_LEVEL::XPB_RESERVED_02"]
        [::std::mem::offset_of!(XC_GROUP_PRICE_BOOK_LEVEL, XPB_RESERVED_02) - 24usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_LEVEL::xpb_implied_volume"]
        [::std::mem::offset_of!(XC_GROUP_PRICE_BOOK_LEVEL, xpb_implied_volume) - 28usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_GROUP_PRICE_BOOK_LEVEL_WITH_CPMVOL"]
        [::std::mem::size_of::<XC_GROUP_PRICE_BOOK_LEVEL_WITH_CPMVOL>() - 48usize];
    ["Alignment of XC_GROUP_PRICE_BOOK_LEVEL_WITH_CPMVOL"]
        [::std::mem::align_of::<XC_GROUP_PRICE_BOOK_LEVEL_WITH_CPMVOL>() - 1usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_LEVEL_WITH_CPMVOL::XPB_RESERVED_01"]
        [::std::mem::offset_of!(XC_GROUP_PRICE_BOOK_LEVEL_WITH_CPMVOL, XPB_RESERVED_01) - 1usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_LEVEL_WITH_CPMVOL::xpb_order_count"]
        [::std::mem::offset_of!(XC_GROUP_PRICE_BOOK_LEVEL_WITH_CPMVOL, xpb_order_count) - 2usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_LEVEL_WITH_CPMVOL::xpb_exch"]
        [::std::mem::offset_of!(XC_GROUP_PRICE_BOOK_LEVEL_WITH_CPMVOL, xpb_exch) - 4usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_LEVEL_WITH_CPMVOL::xpb_country"]
        [::std::mem::offset_of!(XC_GROUP_PRICE_BOOK_LEVEL_WITH_CPMVOL, xpb_country) - 6usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_LEVEL_WITH_CPMVOL::xpb_price"]
        [::std::mem::offset_of!(XC_GROUP_PRICE_BOOK_LEVEL_WITH_CPMVOL, xpb_price) - 8usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_LEVEL_WITH_CPMVOL::xpb_volume"]
        [::std::mem::offset_of!(XC_GROUP_PRICE_BOOK_LEVEL_WITH_CPMVOL, xpb_volume) - 12usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_LEVEL_WITH_CPMVOL::xpb_extime"]
        [::std::mem::offset_of!(XC_GROUP_PRICE_BOOK_LEVEL_WITH_CPMVOL, xpb_extime) - 16usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_LEVEL_WITH_CPMVOL::XPB_RESERVED_02"]
        [::std::mem::offset_of!(XC_GROUP_PRICE_BOOK_LEVEL_WITH_CPMVOL, XPB_RESERVED_02) - 24usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_LEVEL_WITH_CPMVOL::xpb_implied_volume"][::std::mem::offset_of!(
        XC_GROUP_PRICE_BOOK_LEVEL_WITH_CPMVOL,
        xpb_implied_volume
    ) - 28usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_LEVEL_WITH_CPMVOL::xpb_customer_volume"][::std::mem::offset_of!(
        XC_GROUP_PRICE_BOOK_LEVEL_WITH_CPMVOL,
        xpb_customer_volume
    ) - 32usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_LEVEL_WITH_CPMVOL::xpb_professional_volume"][::std::mem::offset_of!(
        XC_GROUP_PRICE_BOOK_LEVEL_WITH_CPMVOL,
        xpb_professional_volume
    )
        - 36usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_LEVEL_WITH_CPMVOL::xpb_market_maker_volume"][::std::mem::offset_of!(
        XC_GROUP_PRICE_BOOK_LEVEL_WITH_CPMVOL,
        xpb_market_maker_volume
    )
        - 40usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_LEVEL_WITH_CPMVOL::XPB_RESERVED_03"]
        [::std::mem::offset_of!(XC_GROUP_PRICE_BOOK_LEVEL_WITH_CPMVOL, XPB_RESERVED_03) - 44usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_GROUP_ORDER_BOOK_UPDATE"]
        [::std::mem::size_of::<XC_GROUP_ORDER_BOOK_UPDATE>() - 40usize];
    ["Alignment of XC_GROUP_ORDER_BOOK_UPDATE"]
        [::std::mem::align_of::<XC_GROUP_ORDER_BOOK_UPDATE>() - 1usize];
    ["Offset of field: XC_GROUP_ORDER_BOOK_UPDATE::xobu_mmid"]
        [::std::mem::offset_of!(XC_GROUP_ORDER_BOOK_UPDATE, xobu_mmid) - 2usize];
    ["Offset of field: XC_GROUP_ORDER_BOOK_UPDATE::xobu_price"]
        [::std::mem::offset_of!(XC_GROUP_ORDER_BOOK_UPDATE, xobu_price) - 8usize];
    ["Offset of field: XC_GROUP_ORDER_BOOK_UPDATE::xobu_size"]
        [::std::mem::offset_of!(XC_GROUP_ORDER_BOOK_UPDATE, xobu_size) - 12usize];
    ["Offset of field: XC_GROUP_ORDER_BOOK_UPDATE::XOBU_RESERVED_03"]
        [::std::mem::offset_of!(XC_GROUP_ORDER_BOOK_UPDATE, XOBU_RESERVED_03) - 16usize];
    ["Offset of field: XC_GROUP_ORDER_BOOK_UPDATE::xobu_order_ref"]
        [::std::mem::offset_of!(XC_GROUP_ORDER_BOOK_UPDATE, xobu_order_ref) - 20usize];
    ["Offset of field: XC_GROUP_ORDER_BOOK_UPDATE::xobu_origin_extime"]
        [::std::mem::offset_of!(XC_GROUP_ORDER_BOOK_UPDATE, xobu_origin_extime) - 32usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_GROUP_ORDER_BOOK_UPDATE_WITH_PRIORITY"]
        [::std::mem::size_of::<XC_GROUP_ORDER_BOOK_UPDATE_WITH_PRIORITY>() - 48usize];
    ["Alignment of XC_GROUP_ORDER_BOOK_UPDATE_WITH_PRIORITY"]
        [::std::mem::align_of::<XC_GROUP_ORDER_BOOK_UPDATE_WITH_PRIORITY>() - 1usize];
    ["Offset of field: XC_GROUP_ORDER_BOOK_UPDATE_WITH_PRIORITY::xobu_mmid"]
        [::std::mem::offset_of!(XC_GROUP_ORDER_BOOK_UPDATE_WITH_PRIORITY, xobu_mmid) - 2usize];
    ["Offset of field: XC_GROUP_ORDER_BOOK_UPDATE_WITH_PRIORITY::xobu_price"]
        [::std::mem::offset_of!(XC_GROUP_ORDER_BOOK_UPDATE_WITH_PRIORITY, xobu_price) - 8usize];
    ["Offset of field: XC_GROUP_ORDER_BOOK_UPDATE_WITH_PRIORITY::xobu_size"]
        [::std::mem::offset_of!(XC_GROUP_ORDER_BOOK_UPDATE_WITH_PRIORITY, xobu_size) - 12usize];
    ["Offset of field: XC_GROUP_ORDER_BOOK_UPDATE_WITH_PRIORITY::XOBU_RESERVED_03"][::std::mem::offset_of!(
        XC_GROUP_ORDER_BOOK_UPDATE_WITH_PRIORITY,
        XOBU_RESERVED_03
    ) - 16usize];
    ["Offset of field: XC_GROUP_ORDER_BOOK_UPDATE_WITH_PRIORITY::xobu_order_ref"][::std::mem::offset_of!(
        XC_GROUP_ORDER_BOOK_UPDATE_WITH_PRIORITY,
        xobu_order_ref
    ) - 20usize];
    ["Offset of field: XC_GROUP_ORDER_BOOK_UPDATE_WITH_PRIORITY::xobu_origin_extime"][::std::mem::offset_of!(
        XC_GROUP_ORDER_BOOK_UPDATE_WITH_PRIORITY,
        xobu_origin_extime
    ) - 32usize];
    ["Offset of field: XC_GROUP_ORDER_BOOK_UPDATE_WITH_PRIORITY::xobu_order_priority"][::std::mem::offset_of!(
        XC_GROUP_ORDER_BOOK_UPDATE_WITH_PRIORITY,
        xobu_order_priority
    ) - 40usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_GROUP_ORDER_BOOK_UPDATE_ALL"]
        [::std::mem::size_of::<XC_GROUP_ORDER_BOOK_UPDATE_ALL>() - 80usize];
    ["Alignment of XC_GROUP_ORDER_BOOK_UPDATE_ALL"]
        [::std::mem::align_of::<XC_GROUP_ORDER_BOOK_UPDATE_ALL>() - 1usize];
    ["Offset of field: XC_GROUP_ORDER_BOOK_UPDATE_ALL::xobu_exchange_code"]
        [::std::mem::offset_of!(XC_GROUP_ORDER_BOOK_UPDATE_ALL, xobu_exchange_code) - 0usize];
    ["Offset of field: XC_GROUP_ORDER_BOOK_UPDATE_ALL::xobu_country_code"]
        [::std::mem::offset_of!(XC_GROUP_ORDER_BOOK_UPDATE_ALL, xobu_country_code) - 2usize];
    ["Offset of field: XC_GROUP_ORDER_BOOK_UPDATE_ALL::xobu_symbol_type"]
        [::std::mem::offset_of!(XC_GROUP_ORDER_BOOK_UPDATE_ALL, xobu_symbol_type) - 5usize];
    ["Offset of field: XC_GROUP_ORDER_BOOK_UPDATE_ALL::xobu_line_id"]
        [::std::mem::offset_of!(XC_GROUP_ORDER_BOOK_UPDATE_ALL, xobu_line_id) - 6usize];
    ["Offset of field: XC_GROUP_ORDER_BOOK_UPDATE_ALL::xobu_quals"]
        [::std::mem::offset_of!(XC_GROUP_ORDER_BOOK_UPDATE_ALL, xobu_quals) - 8usize];
    ["Offset of field: XC_GROUP_ORDER_BOOK_UPDATE_ALL::xobu_instrument_status"]
        [::std::mem::offset_of!(XC_GROUP_ORDER_BOOK_UPDATE_ALL, xobu_instrument_status) - 12usize];
    ["Offset of field: XC_GROUP_ORDER_BOOK_UPDATE_ALL::xobu_market_status"]
        [::std::mem::offset_of!(XC_GROUP_ORDER_BOOK_UPDATE_ALL, xobu_market_status) - 13usize];
    ["Offset of field: XC_GROUP_ORDER_BOOK_UPDATE_ALL::XOBU_RESERVED_02"]
        [::std::mem::offset_of!(XC_GROUP_ORDER_BOOK_UPDATE_ALL, XOBU_RESERVED_02) - 15usize];
    ["Offset of field: XC_GROUP_ORDER_BOOK_UPDATE_ALL::xobu_exchange_hitime"]
        [::std::mem::offset_of!(XC_GROUP_ORDER_BOOK_UPDATE_ALL, xobu_exchange_hitime) - 16usize];
    ["Offset of field: XC_GROUP_ORDER_BOOK_UPDATE_ALL::xobu_receive_hitime"]
        [::std::mem::offset_of!(XC_GROUP_ORDER_BOOK_UPDATE_ALL, xobu_receive_hitime) - 24usize];
    ["Offset of field: XC_GROUP_ORDER_BOOK_UPDATE_ALL::xobu_sequence"]
        [::std::mem::offset_of!(XC_GROUP_ORDER_BOOK_UPDATE_ALL, xobu_sequence) - 32usize];
    ["Offset of field: XC_GROUP_ORDER_BOOK_UPDATE_ALL::xobu_mmid"]
        [::std::mem::offset_of!(XC_GROUP_ORDER_BOOK_UPDATE_ALL, xobu_mmid) - 42usize];
    ["Offset of field: XC_GROUP_ORDER_BOOK_UPDATE_ALL::xobu_price"]
        [::std::mem::offset_of!(XC_GROUP_ORDER_BOOK_UPDATE_ALL, xobu_price) - 48usize];
    ["Offset of field: XC_GROUP_ORDER_BOOK_UPDATE_ALL::xobu_size"]
        [::std::mem::offset_of!(XC_GROUP_ORDER_BOOK_UPDATE_ALL, xobu_size) - 52usize];
    ["Offset of field: XC_GROUP_ORDER_BOOK_UPDATE_ALL::XOBU_RESERVED_06"]
        [::std::mem::offset_of!(XC_GROUP_ORDER_BOOK_UPDATE_ALL, XOBU_RESERVED_06) - 56usize];
    ["Offset of field: XC_GROUP_ORDER_BOOK_UPDATE_ALL::xobu_order_ref"]
        [::std::mem::offset_of!(XC_GROUP_ORDER_BOOK_UPDATE_ALL, xobu_order_ref) - 60usize];
    ["Offset of field: XC_GROUP_ORDER_BOOK_UPDATE_ALL::xobu_origin_extime"]
        [::std::mem::offset_of!(XC_GROUP_ORDER_BOOK_UPDATE_ALL, xobu_origin_extime) - 72usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_GROUP_PRICE_BOOK_UPDATE"]
        [::std::mem::size_of::<XC_GROUP_PRICE_BOOK_UPDATE>() - 20usize];
    ["Alignment of XC_GROUP_PRICE_BOOK_UPDATE"]
        [::std::mem::align_of::<XC_GROUP_PRICE_BOOK_UPDATE>() - 1usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_UPDATE::xpbu_order_count"]
        [::std::mem::offset_of!(XC_GROUP_PRICE_BOOK_UPDATE, xpbu_order_count) - 2usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_UPDATE::xpbu_price"]
        [::std::mem::offset_of!(XC_GROUP_PRICE_BOOK_UPDATE, xpbu_price) - 4usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_UPDATE::xpbu_volume"]
        [::std::mem::offset_of!(XC_GROUP_PRICE_BOOK_UPDATE, xpbu_volume) - 8usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_UPDATE::xpbu_extime"]
        [::std::mem::offset_of!(XC_GROUP_PRICE_BOOK_UPDATE, xpbu_extime) - 12usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_GROUP_CPMVOL"][::std::mem::size_of::<XC_GROUP_CPMVOL>() - 16usize];
    ["Alignment of XC_GROUP_CPMVOL"][::std::mem::align_of::<XC_GROUP_CPMVOL>() - 1usize];
    ["Offset of field: XC_GROUP_CPMVOL::xcpm_customer_volume"]
        [::std::mem::offset_of!(XC_GROUP_CPMVOL, xcpm_customer_volume) - 0usize];
    ["Offset of field: XC_GROUP_CPMVOL::xcpm_professional_volume"]
        [::std::mem::offset_of!(XC_GROUP_CPMVOL, xcpm_professional_volume) - 4usize];
    ["Offset of field: XC_GROUP_CPMVOL::xcpm_market_maker_volume"]
        [::std::mem::offset_of!(XC_GROUP_CPMVOL, xcpm_market_maker_volume) - 8usize];
    ["Offset of field: XC_GROUP_CPMVOL::XCPM_RESERVED_00"]
        [::std::mem::offset_of!(XC_GROUP_CPMVOL, XCPM_RESERVED_00) - 12usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_GROUP_PRICE_BOOK_UPDATE_ALL"]
        [::std::mem::size_of::<XC_GROUP_PRICE_BOOK_UPDATE_ALL>() - 60usize];
    ["Alignment of XC_GROUP_PRICE_BOOK_UPDATE_ALL"]
        [::std::mem::align_of::<XC_GROUP_PRICE_BOOK_UPDATE_ALL>() - 1usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_UPDATE_ALL::xpbu_exchange_code"]
        [::std::mem::offset_of!(XC_GROUP_PRICE_BOOK_UPDATE_ALL, xpbu_exchange_code) - 0usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_UPDATE_ALL::xpbu_country_code"]
        [::std::mem::offset_of!(XC_GROUP_PRICE_BOOK_UPDATE_ALL, xpbu_country_code) - 2usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_UPDATE_ALL::xpbu_symbol_type"]
        [::std::mem::offset_of!(XC_GROUP_PRICE_BOOK_UPDATE_ALL, xpbu_symbol_type) - 5usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_UPDATE_ALL::xpbu_line_id"]
        [::std::mem::offset_of!(XC_GROUP_PRICE_BOOK_UPDATE_ALL, xpbu_line_id) - 6usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_UPDATE_ALL::xpbu_quals"]
        [::std::mem::offset_of!(XC_GROUP_PRICE_BOOK_UPDATE_ALL, xpbu_quals) - 8usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_UPDATE_ALL::xpbu_instrument_status"]
        [::std::mem::offset_of!(XC_GROUP_PRICE_BOOK_UPDATE_ALL, xpbu_instrument_status) - 12usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_UPDATE_ALL::xpbu_market_status"]
        [::std::mem::offset_of!(XC_GROUP_PRICE_BOOK_UPDATE_ALL, xpbu_market_status) - 13usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_UPDATE_ALL::XPBU_RESERVED_02"]
        [::std::mem::offset_of!(XC_GROUP_PRICE_BOOK_UPDATE_ALL, XPBU_RESERVED_02) - 15usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_UPDATE_ALL::xpbu_exchange_hitime"]
        [::std::mem::offset_of!(XC_GROUP_PRICE_BOOK_UPDATE_ALL, xpbu_exchange_hitime) - 16usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_UPDATE_ALL::xpbu_receive_hitime"]
        [::std::mem::offset_of!(XC_GROUP_PRICE_BOOK_UPDATE_ALL, xpbu_receive_hitime) - 24usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_UPDATE_ALL::xpbu_sequence"]
        [::std::mem::offset_of!(XC_GROUP_PRICE_BOOK_UPDATE_ALL, xpbu_sequence) - 32usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_UPDATE_ALL::xpbu_order_count"]
        [::std::mem::offset_of!(XC_GROUP_PRICE_BOOK_UPDATE_ALL, xpbu_order_count) - 42usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_UPDATE_ALL::xpbu_price"]
        [::std::mem::offset_of!(XC_GROUP_PRICE_BOOK_UPDATE_ALL, xpbu_price) - 44usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_UPDATE_ALL::xpbu_volume"]
        [::std::mem::offset_of!(XC_GROUP_PRICE_BOOK_UPDATE_ALL, xpbu_volume) - 48usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_UPDATE_ALL::xpbu_extime"]
        [::std::mem::offset_of!(XC_GROUP_PRICE_BOOK_UPDATE_ALL, xpbu_extime) - 52usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_GROUP_PRICE_BOOK_UPDATE_WITH_CPMVOL_ALL"]
        [::std::mem::size_of::<XC_GROUP_PRICE_BOOK_UPDATE_WITH_CPMVOL_ALL>() - 76usize];
    ["Alignment of XC_GROUP_PRICE_BOOK_UPDATE_WITH_CPMVOL_ALL"]
        [::std::mem::align_of::<XC_GROUP_PRICE_BOOK_UPDATE_WITH_CPMVOL_ALL>() - 1usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_UPDATE_WITH_CPMVOL_ALL::xpbu_exchange_code"][::std::mem::offset_of!(
        XC_GROUP_PRICE_BOOK_UPDATE_WITH_CPMVOL_ALL,
        xpbu_exchange_code
    ) - 0usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_UPDATE_WITH_CPMVOL_ALL::xpbu_country_code"][::std::mem::offset_of!(
        XC_GROUP_PRICE_BOOK_UPDATE_WITH_CPMVOL_ALL,
        xpbu_country_code
    ) - 2usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_UPDATE_WITH_CPMVOL_ALL::xpbu_symbol_type"][::std::mem::offset_of!(
        XC_GROUP_PRICE_BOOK_UPDATE_WITH_CPMVOL_ALL,
        xpbu_symbol_type
    ) - 5usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_UPDATE_WITH_CPMVOL_ALL::xpbu_line_id"]
        [::std::mem::offset_of!(XC_GROUP_PRICE_BOOK_UPDATE_WITH_CPMVOL_ALL, xpbu_line_id) - 6usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_UPDATE_WITH_CPMVOL_ALL::xpbu_quals"]
        [::std::mem::offset_of!(XC_GROUP_PRICE_BOOK_UPDATE_WITH_CPMVOL_ALL, xpbu_quals) - 8usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_UPDATE_WITH_CPMVOL_ALL::xpbu_instrument_status"][::std::mem::offset_of!(
        XC_GROUP_PRICE_BOOK_UPDATE_WITH_CPMVOL_ALL,
        xpbu_instrument_status
    )
        - 12usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_UPDATE_WITH_CPMVOL_ALL::xpbu_market_status"][::std::mem::offset_of!(
        XC_GROUP_PRICE_BOOK_UPDATE_WITH_CPMVOL_ALL,
        xpbu_market_status
    )
        - 13usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_UPDATE_WITH_CPMVOL_ALL::XPBU_RESERVED_02"][::std::mem::offset_of!(
        XC_GROUP_PRICE_BOOK_UPDATE_WITH_CPMVOL_ALL,
        XPBU_RESERVED_02
    ) - 15usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_UPDATE_WITH_CPMVOL_ALL::xpbu_exchange_hitime"][::std::mem::offset_of!(
        XC_GROUP_PRICE_BOOK_UPDATE_WITH_CPMVOL_ALL,
        xpbu_exchange_hitime
    )
        - 16usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_UPDATE_WITH_CPMVOL_ALL::xpbu_receive_hitime"][::std::mem::offset_of!(
        XC_GROUP_PRICE_BOOK_UPDATE_WITH_CPMVOL_ALL,
        xpbu_receive_hitime
    )
        - 24usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_UPDATE_WITH_CPMVOL_ALL::xpbu_sequence"][::std::mem::offset_of!(
        XC_GROUP_PRICE_BOOK_UPDATE_WITH_CPMVOL_ALL,
        xpbu_sequence
    ) - 32usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_UPDATE_WITH_CPMVOL_ALL::xpbu_order_count"][::std::mem::offset_of!(
        XC_GROUP_PRICE_BOOK_UPDATE_WITH_CPMVOL_ALL,
        xpbu_order_count
    ) - 42usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_UPDATE_WITH_CPMVOL_ALL::xpbu_price"]
        [::std::mem::offset_of!(XC_GROUP_PRICE_BOOK_UPDATE_WITH_CPMVOL_ALL, xpbu_price) - 44usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_UPDATE_WITH_CPMVOL_ALL::xpbu_volume"]
        [::std::mem::offset_of!(XC_GROUP_PRICE_BOOK_UPDATE_WITH_CPMVOL_ALL, xpbu_volume) - 48usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_UPDATE_WITH_CPMVOL_ALL::xpbu_extime"]
        [::std::mem::offset_of!(XC_GROUP_PRICE_BOOK_UPDATE_WITH_CPMVOL_ALL, xpbu_extime) - 52usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_UPDATE_WITH_CPMVOL_ALL::xpbu_customer_volume"][::std::mem::offset_of!(
        XC_GROUP_PRICE_BOOK_UPDATE_WITH_CPMVOL_ALL,
        xpbu_customer_volume
    )
        - 60usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_UPDATE_WITH_CPMVOL_ALL::xpbu_professional_volume"][::std::mem::offset_of!(
        XC_GROUP_PRICE_BOOK_UPDATE_WITH_CPMVOL_ALL,
        xpbu_professional_volume
    )
        - 64usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_UPDATE_WITH_CPMVOL_ALL::xpbu_market_maker_volume"][::std::mem::offset_of!(
        XC_GROUP_PRICE_BOOK_UPDATE_WITH_CPMVOL_ALL,
        xpbu_market_maker_volume
    )
        - 68usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_UPDATE_WITH_CPMVOL_ALL::XPBU_RESERVED_05"][::std::mem::offset_of!(
        XC_GROUP_PRICE_BOOK_UPDATE_WITH_CPMVOL_ALL,
        XPBU_RESERVED_05
    ) - 72usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL"]
        [::std::mem::size_of::<XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL>() - 24usize];
    ["Alignment of XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL"]
        [::std::mem::align_of::<XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL>() - 1usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL::xpbu_order_count"][::std::mem::offset_of!(
        XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL,
        xpbu_order_count
    ) - 2usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL::xpbu_price"]
        [::std::mem::offset_of!(XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL, xpbu_price) - 4usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL::xpbu_volume"]
        [::std::mem::offset_of!(XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL, xpbu_volume) - 8usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL::xpbu_extime"]
        [::std::mem::offset_of!(XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL, xpbu_extime) - 12usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL::xpbu_row_level"][::std::mem::offset_of!(
        XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL,
        xpbu_row_level
    ) - 20usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL::XPBU_RESERVED_02"][::std::mem::offset_of!(
        XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL,
        XPBU_RESERVED_02
    ) - 22usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL_ALL"]
        [::std::mem::size_of::<XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL_ALL>() - 64usize];
    ["Alignment of XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL_ALL"]
        [::std::mem::align_of::<XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL_ALL>() - 1usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL_ALL::xpbu_exchange_code"][::std::mem::offset_of!(
        XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL_ALL,
        xpbu_exchange_code
    )
        - 0usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL_ALL::xpbu_country_code"][::std::mem::offset_of!(
        XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL_ALL,
        xpbu_country_code
    )
        - 2usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL_ALL::xpbu_symbol_type"][::std::mem::offset_of!(
        XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL_ALL,
        xpbu_symbol_type
    )
        - 5usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL_ALL::xpbu_line_id"][::std::mem::offset_of!(
        XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL_ALL,
        xpbu_line_id
    ) - 6usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL_ALL::xpbu_quals"][::std::mem::offset_of!(
        XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL_ALL,
        xpbu_quals
    ) - 8usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL_ALL::xpbu_instrument_status"][::std::mem::offset_of!(
        XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL_ALL,
        xpbu_instrument_status
    )
        - 12usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL_ALL::xpbu_market_status"][::std::mem::offset_of!(
        XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL_ALL,
        xpbu_market_status
    )
        - 13usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL_ALL::XPBU_RESERVED_02"][::std::mem::offset_of!(
        XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL_ALL,
        XPBU_RESERVED_02
    )
        - 15usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL_ALL::xpbu_exchange_hitime"][::std::mem::offset_of!(
        XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL_ALL,
        xpbu_exchange_hitime
    )
        - 16usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL_ALL::xpbu_receive_hitime"][::std::mem::offset_of!(
        XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL_ALL,
        xpbu_receive_hitime
    )
        - 24usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL_ALL::xpbu_sequence"][::std::mem::offset_of!(
        XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL_ALL,
        xpbu_sequence
    ) - 32usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL_ALL::xpbu_order_count"][::std::mem::offset_of!(
        XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL_ALL,
        xpbu_order_count
    )
        - 42usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL_ALL::xpbu_price"][::std::mem::offset_of!(
        XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL_ALL,
        xpbu_price
    ) - 44usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL_ALL::xpbu_volume"][::std::mem::offset_of!(
        XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL_ALL,
        xpbu_volume
    ) - 48usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL_ALL::xpbu_extime"][::std::mem::offset_of!(
        XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL_ALL,
        xpbu_extime
    ) - 52usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL_ALL::xpbu_row_level"][::std::mem::offset_of!(
        XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL_ALL,
        xpbu_row_level
    ) - 60usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL_ALL::XPBU_RESERVED_05"][::std::mem::offset_of!(
        XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL_ALL,
        XPBU_RESERVED_05
    )
        - 62usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL_CPMVOL_ALL"]
        [::std::mem::size_of::<XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL_CPMVOL_ALL>() - 80usize];
    ["Alignment of XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL_CPMVOL_ALL"]
        [::std::mem::align_of::<XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL_CPMVOL_ALL>() - 1usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL_CPMVOL_ALL::xpbu_exchange_code"][::std::mem::offset_of!(
        XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL_CPMVOL_ALL,
        xpbu_exchange_code
    )
        - 0usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL_CPMVOL_ALL::xpbu_country_code"][::std::mem::offset_of!(
        XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL_CPMVOL_ALL,
        xpbu_country_code
    )
        - 2usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL_CPMVOL_ALL::xpbu_symbol_type"][::std::mem::offset_of!(
        XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL_CPMVOL_ALL,
        xpbu_symbol_type
    )
        - 5usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL_CPMVOL_ALL::xpbu_line_id"][::std::mem::offset_of!(
        XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL_CPMVOL_ALL,
        xpbu_line_id
    )
        - 6usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL_CPMVOL_ALL::xpbu_quals"][::std::mem::offset_of!(
        XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL_CPMVOL_ALL,
        xpbu_quals
    )
        - 8usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL_CPMVOL_ALL::xpbu_instrument_status"] [:: std :: mem :: offset_of ! (XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL_CPMVOL_ALL , xpbu_instrument_status) - 12usize] ;
    ["Offset of field: XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL_CPMVOL_ALL::xpbu_market_status"][::std::mem::offset_of!(
        XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL_CPMVOL_ALL,
        xpbu_market_status
    )
        - 13usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL_CPMVOL_ALL::XPBU_RESERVED_02"][::std::mem::offset_of!(
        XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL_CPMVOL_ALL,
        XPBU_RESERVED_02
    )
        - 15usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL_CPMVOL_ALL::xpbu_exchange_hitime"] [:: std :: mem :: offset_of ! (XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL_CPMVOL_ALL , xpbu_exchange_hitime) - 16usize] ;
    ["Offset of field: XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL_CPMVOL_ALL::xpbu_receive_hitime"] [:: std :: mem :: offset_of ! (XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL_CPMVOL_ALL , xpbu_receive_hitime) - 24usize] ;
    ["Offset of field: XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL_CPMVOL_ALL::xpbu_sequence"][::std::mem::offset_of!(
        XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL_CPMVOL_ALL,
        xpbu_sequence
    )
        - 32usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL_CPMVOL_ALL::xpbu_order_count"][::std::mem::offset_of!(
        XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL_CPMVOL_ALL,
        xpbu_order_count
    )
        - 42usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL_CPMVOL_ALL::xpbu_price"][::std::mem::offset_of!(
        XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL_CPMVOL_ALL,
        xpbu_price
    )
        - 44usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL_CPMVOL_ALL::xpbu_volume"][::std::mem::offset_of!(
        XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL_CPMVOL_ALL,
        xpbu_volume
    )
        - 48usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL_CPMVOL_ALL::xpbu_extime"][::std::mem::offset_of!(
        XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL_CPMVOL_ALL,
        xpbu_extime
    )
        - 52usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL_CPMVOL_ALL::xpbu_row_level"][::std::mem::offset_of!(
        XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL_CPMVOL_ALL,
        xpbu_row_level
    )
        - 60usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL_CPMVOL_ALL::XPBU_RESERVED_05"][::std::mem::offset_of!(
        XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL_CPMVOL_ALL,
        XPBU_RESERVED_05
    )
        - 62usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL_CPMVOL_ALL::xpbu_customer_volume"] [:: std :: mem :: offset_of ! (XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL_CPMVOL_ALL , xpbu_customer_volume) - 64usize] ;
    ["Offset of field: XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL_CPMVOL_ALL::xpbu_professional_volume"] [:: std :: mem :: offset_of ! (XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL_CPMVOL_ALL , xpbu_professional_volume) - 68usize] ;
    ["Offset of field: XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL_CPMVOL_ALL::xpbu_market_maker_volume"] [:: std :: mem :: offset_of ! (XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL_CPMVOL_ALL , xpbu_market_maker_volume) - 72usize] ;
    ["Offset of field: XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL_CPMVOL_ALL::XPBU_RESERVED_06"][::std::mem::offset_of!(
        XC_GROUP_PRICE_BOOK_UPDATE_WITH_ROW_LEVEL_CPMVOL_ALL,
        XPBU_RESERVED_06
    )
        - 76usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_GROUP_ORDER_BOOK_ENTRY_WITH_HITIME"]
        [::std::mem::size_of::<XC_GROUP_ORDER_BOOK_ENTRY_WITH_HITIME>() - 48usize];
    ["Alignment of XC_GROUP_ORDER_BOOK_ENTRY_WITH_HITIME"]
        [::std::mem::align_of::<XC_GROUP_ORDER_BOOK_ENTRY_WITH_HITIME>() - 1usize];
    ["Offset of field: XC_GROUP_ORDER_BOOK_ENTRY_WITH_HITIME::XOB_RESERVED_01"]
        [::std::mem::offset_of!(XC_GROUP_ORDER_BOOK_ENTRY_WITH_HITIME, XOB_RESERVED_01) - 1usize];
    ["Offset of field: XC_GROUP_ORDER_BOOK_ENTRY_WITH_HITIME::xob_mmid"]
        [::std::mem::offset_of!(XC_GROUP_ORDER_BOOK_ENTRY_WITH_HITIME, xob_mmid) - 2usize];
    ["Offset of field: XC_GROUP_ORDER_BOOK_ENTRY_WITH_HITIME::xob_price"]
        [::std::mem::offset_of!(XC_GROUP_ORDER_BOOK_ENTRY_WITH_HITIME, xob_price) - 8usize];
    ["Offset of field: XC_GROUP_ORDER_BOOK_ENTRY_WITH_HITIME::xob_size"]
        [::std::mem::offset_of!(XC_GROUP_ORDER_BOOK_ENTRY_WITH_HITIME, xob_size) - 12usize];
    ["Offset of field: XC_GROUP_ORDER_BOOK_ENTRY_WITH_HITIME::xob_order_quals"]
        [::std::mem::offset_of!(XC_GROUP_ORDER_BOOK_ENTRY_WITH_HITIME, xob_order_quals) - 16usize];
    ["Offset of field: XC_GROUP_ORDER_BOOK_ENTRY_WITH_HITIME::xob_order_ref"]
        [::std::mem::offset_of!(XC_GROUP_ORDER_BOOK_ENTRY_WITH_HITIME, xob_order_ref) - 20usize];
    ["Offset of field: XC_GROUP_ORDER_BOOK_ENTRY_WITH_HITIME::xob_origin_hitime"][::std::mem::offset_of!(
        XC_GROUP_ORDER_BOOK_ENTRY_WITH_HITIME,
        xob_origin_hitime
    ) - 32usize];
    ["Offset of field: XC_GROUP_ORDER_BOOK_ENTRY_WITH_HITIME::xob_exch"]
        [::std::mem::offset_of!(XC_GROUP_ORDER_BOOK_ENTRY_WITH_HITIME, xob_exch) - 40usize];
    ["Offset of field: XC_GROUP_ORDER_BOOK_ENTRY_WITH_HITIME::xob_country"]
        [::std::mem::offset_of!(XC_GROUP_ORDER_BOOK_ENTRY_WITH_HITIME, xob_country) - 42usize];
    ["Offset of field: XC_GROUP_ORDER_BOOK_ENTRY_WITH_HITIME::XOB_RESERVED_02"]
        [::std::mem::offset_of!(XC_GROUP_ORDER_BOOK_ENTRY_WITH_HITIME, XOB_RESERVED_02) - 44usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_GROUP_ORDER_BOOK_ENTRY_WITH_PRIORITY_HITIME"]
        [::std::mem::size_of::<XC_GROUP_ORDER_BOOK_ENTRY_WITH_PRIORITY_HITIME>() - 56usize];
    ["Alignment of XC_GROUP_ORDER_BOOK_ENTRY_WITH_PRIORITY_HITIME"]
        [::std::mem::align_of::<XC_GROUP_ORDER_BOOK_ENTRY_WITH_PRIORITY_HITIME>() - 1usize];
    ["Offset of field: XC_GROUP_ORDER_BOOK_ENTRY_WITH_PRIORITY_HITIME::XOB_RESERVED_01"][::std::mem::offset_of!(
        XC_GROUP_ORDER_BOOK_ENTRY_WITH_PRIORITY_HITIME,
        XOB_RESERVED_01
    )
        - 1usize];
    ["Offset of field: XC_GROUP_ORDER_BOOK_ENTRY_WITH_PRIORITY_HITIME::xob_mmid"]
        [::std::mem::offset_of!(XC_GROUP_ORDER_BOOK_ENTRY_WITH_PRIORITY_HITIME, xob_mmid) - 2usize];
    ["Offset of field: XC_GROUP_ORDER_BOOK_ENTRY_WITH_PRIORITY_HITIME::xob_price"][::std::mem::offset_of!(
        XC_GROUP_ORDER_BOOK_ENTRY_WITH_PRIORITY_HITIME,
        xob_price
    ) - 8usize];
    ["Offset of field: XC_GROUP_ORDER_BOOK_ENTRY_WITH_PRIORITY_HITIME::xob_size"][::std::mem::offset_of!(
        XC_GROUP_ORDER_BOOK_ENTRY_WITH_PRIORITY_HITIME,
        xob_size
    ) - 12usize];
    ["Offset of field: XC_GROUP_ORDER_BOOK_ENTRY_WITH_PRIORITY_HITIME::xob_order_quals"][::std::mem::offset_of!(
        XC_GROUP_ORDER_BOOK_ENTRY_WITH_PRIORITY_HITIME,
        xob_order_quals
    )
        - 16usize];
    ["Offset of field: XC_GROUP_ORDER_BOOK_ENTRY_WITH_PRIORITY_HITIME::xob_order_ref"][::std::mem::offset_of!(
        XC_GROUP_ORDER_BOOK_ENTRY_WITH_PRIORITY_HITIME,
        xob_order_ref
    ) - 20usize];
    ["Offset of field: XC_GROUP_ORDER_BOOK_ENTRY_WITH_PRIORITY_HITIME::xob_origin_hitime"][::std::mem::offset_of!(
        XC_GROUP_ORDER_BOOK_ENTRY_WITH_PRIORITY_HITIME,
        xob_origin_hitime
    )
        - 32usize];
    ["Offset of field: XC_GROUP_ORDER_BOOK_ENTRY_WITH_PRIORITY_HITIME::xob_exch"][::std::mem::offset_of!(
        XC_GROUP_ORDER_BOOK_ENTRY_WITH_PRIORITY_HITIME,
        xob_exch
    ) - 40usize];
    ["Offset of field: XC_GROUP_ORDER_BOOK_ENTRY_WITH_PRIORITY_HITIME::xob_country"][::std::mem::offset_of!(
        XC_GROUP_ORDER_BOOK_ENTRY_WITH_PRIORITY_HITIME,
        xob_country
    ) - 42usize];
    ["Offset of field: XC_GROUP_ORDER_BOOK_ENTRY_WITH_PRIORITY_HITIME::XOB_RESERVED_02"][::std::mem::offset_of!(
        XC_GROUP_ORDER_BOOK_ENTRY_WITH_PRIORITY_HITIME,
        XOB_RESERVED_02
    )
        - 44usize];
    ["Offset of field: XC_GROUP_ORDER_BOOK_ENTRY_WITH_PRIORITY_HITIME::xob_order_priority"][::std::mem::offset_of!(
        XC_GROUP_ORDER_BOOK_ENTRY_WITH_PRIORITY_HITIME,
        xob_order_priority
    )
        - 48usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_GROUP_PRICE_BOOK_ENTRY_WITH_HITIME"]
        [::std::mem::size_of::<XC_GROUP_PRICE_BOOK_ENTRY_WITH_HITIME>() - 24usize];
    ["Alignment of XC_GROUP_PRICE_BOOK_ENTRY_WITH_HITIME"]
        [::std::mem::align_of::<XC_GROUP_PRICE_BOOK_ENTRY_WITH_HITIME>() - 1usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_ENTRY_WITH_HITIME::XPB_RESERVED_01"]
        [::std::mem::offset_of!(XC_GROUP_PRICE_BOOK_ENTRY_WITH_HITIME, XPB_RESERVED_01) - 1usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_ENTRY_WITH_HITIME::xpb_order_count"]
        [::std::mem::offset_of!(XC_GROUP_PRICE_BOOK_ENTRY_WITH_HITIME, xpb_order_count) - 2usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_ENTRY_WITH_HITIME::xpb_exch"]
        [::std::mem::offset_of!(XC_GROUP_PRICE_BOOK_ENTRY_WITH_HITIME, xpb_exch) - 4usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_ENTRY_WITH_HITIME::xpb_country"]
        [::std::mem::offset_of!(XC_GROUP_PRICE_BOOK_ENTRY_WITH_HITIME, xpb_country) - 6usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_ENTRY_WITH_HITIME::xpb_price"]
        [::std::mem::offset_of!(XC_GROUP_PRICE_BOOK_ENTRY_WITH_HITIME, xpb_price) - 8usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_ENTRY_WITH_HITIME::xpb_volume"]
        [::std::mem::offset_of!(XC_GROUP_PRICE_BOOK_ENTRY_WITH_HITIME, xpb_volume) - 12usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_ENTRY_WITH_HITIME::xpb_hitime"]
        [::std::mem::offset_of!(XC_GROUP_PRICE_BOOK_ENTRY_WITH_HITIME, xpb_hitime) - 16usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_GROUP_PRICE_BOOK_ENTRY_WITH_CPMVOL_HITIME"]
        [::std::mem::size_of::<XC_GROUP_PRICE_BOOK_ENTRY_WITH_CPMVOL_HITIME>() - 40usize];
    ["Alignment of XC_GROUP_PRICE_BOOK_ENTRY_WITH_CPMVOL_HITIME"]
        [::std::mem::align_of::<XC_GROUP_PRICE_BOOK_ENTRY_WITH_CPMVOL_HITIME>() - 1usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_ENTRY_WITH_CPMVOL_HITIME::XPB_RESERVED_01"][::std::mem::offset_of!(
        XC_GROUP_PRICE_BOOK_ENTRY_WITH_CPMVOL_HITIME,
        XPB_RESERVED_01
    ) - 1usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_ENTRY_WITH_CPMVOL_HITIME::xpb_order_count"][::std::mem::offset_of!(
        XC_GROUP_PRICE_BOOK_ENTRY_WITH_CPMVOL_HITIME,
        xpb_order_count
    ) - 2usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_ENTRY_WITH_CPMVOL_HITIME::xpb_exch"]
        [::std::mem::offset_of!(XC_GROUP_PRICE_BOOK_ENTRY_WITH_CPMVOL_HITIME, xpb_exch) - 4usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_ENTRY_WITH_CPMVOL_HITIME::xpb_country"][::std::mem::offset_of!(
        XC_GROUP_PRICE_BOOK_ENTRY_WITH_CPMVOL_HITIME,
        xpb_country
    ) - 6usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_ENTRY_WITH_CPMVOL_HITIME::xpb_price"]
        [::std::mem::offset_of!(XC_GROUP_PRICE_BOOK_ENTRY_WITH_CPMVOL_HITIME, xpb_price) - 8usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_ENTRY_WITH_CPMVOL_HITIME::xpb_volume"][::std::mem::offset_of!(
        XC_GROUP_PRICE_BOOK_ENTRY_WITH_CPMVOL_HITIME,
        xpb_volume
    ) - 12usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_ENTRY_WITH_CPMVOL_HITIME::xpb_hitime"][::std::mem::offset_of!(
        XC_GROUP_PRICE_BOOK_ENTRY_WITH_CPMVOL_HITIME,
        xpb_hitime
    ) - 16usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_ENTRY_WITH_CPMVOL_HITIME::xpb_customer_volume"][::std::mem::offset_of!(
        XC_GROUP_PRICE_BOOK_ENTRY_WITH_CPMVOL_HITIME,
        xpb_customer_volume
    )
        - 24usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_ENTRY_WITH_CPMVOL_HITIME::xpb_professional_volume"][::std::mem::offset_of!(
        XC_GROUP_PRICE_BOOK_ENTRY_WITH_CPMVOL_HITIME,
        xpb_professional_volume
    )
        - 28usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_ENTRY_WITH_CPMVOL_HITIME::xpb_market_maker_volume"][::std::mem::offset_of!(
        XC_GROUP_PRICE_BOOK_ENTRY_WITH_CPMVOL_HITIME,
        xpb_market_maker_volume
    )
        - 32usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_ENTRY_WITH_CPMVOL_HITIME::XPB_RESERVED_02"][::std::mem::offset_of!(
        XC_GROUP_PRICE_BOOK_ENTRY_WITH_CPMVOL_HITIME,
        XPB_RESERVED_02
    ) - 36usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_GROUP_PRICE_BOOK_LEVEL_WITH_HITIME"]
        [::std::mem::size_of::<XC_GROUP_PRICE_BOOK_LEVEL_WITH_HITIME>() - 32usize];
    ["Alignment of XC_GROUP_PRICE_BOOK_LEVEL_WITH_HITIME"]
        [::std::mem::align_of::<XC_GROUP_PRICE_BOOK_LEVEL_WITH_HITIME>() - 1usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_LEVEL_WITH_HITIME::XPB_RESERVED_01"]
        [::std::mem::offset_of!(XC_GROUP_PRICE_BOOK_LEVEL_WITH_HITIME, XPB_RESERVED_01) - 1usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_LEVEL_WITH_HITIME::xpb_order_count"]
        [::std::mem::offset_of!(XC_GROUP_PRICE_BOOK_LEVEL_WITH_HITIME, xpb_order_count) - 2usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_LEVEL_WITH_HITIME::xpb_exch"]
        [::std::mem::offset_of!(XC_GROUP_PRICE_BOOK_LEVEL_WITH_HITIME, xpb_exch) - 4usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_LEVEL_WITH_HITIME::xpb_country"]
        [::std::mem::offset_of!(XC_GROUP_PRICE_BOOK_LEVEL_WITH_HITIME, xpb_country) - 6usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_LEVEL_WITH_HITIME::xpb_price"]
        [::std::mem::offset_of!(XC_GROUP_PRICE_BOOK_LEVEL_WITH_HITIME, xpb_price) - 8usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_LEVEL_WITH_HITIME::xpb_volume"]
        [::std::mem::offset_of!(XC_GROUP_PRICE_BOOK_LEVEL_WITH_HITIME, xpb_volume) - 12usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_LEVEL_WITH_HITIME::xpb_hitime"]
        [::std::mem::offset_of!(XC_GROUP_PRICE_BOOK_LEVEL_WITH_HITIME, xpb_hitime) - 16usize];
    ["Offset of field: XC_GROUP_PRICE_BOOK_LEVEL_WITH_HITIME::XPB_RESERVED_02"]
