/* automatically generated by rust-bindgen 0.71.1 */

pub type XCFMT_GLOBAL_OPTIONS = xuint32;
pub type XCFMT_ENUM_OPTIONS = xuint32;
pub type XCFMT_KEY_OPTIONS = xuint32;
pub type XCFMT_NUMERIC_OPTIONS = xuint32;
pub type XCFMT_TIMEDATE_OPTIONS = xuint32;
pub type XCFMT_PRICE_OPTIONS = xuint32;
pub type XCFMT_EXCHANGE_ID_OPTIONS = xuint32;
pub type XCFMT_COUNTRY_ID_OPTIONS = xuint32;
pub type XCFMT_CURRENCY_ID_OPTIONS = xuint32;
pub type XCFMT_SYMBOL_OPTIONS = xuint32;
pub type XCFMT_STRING_OPTIONS = xuint32;
pub type XCFMT_STRUCT_OPTIONS = xuint32;
#[doc = "Note that there are separate options for each thread; therefore,\nchanges made to the options in one thread will not affect the options\nused in any other thread.\n\nBy default, all the listed options are off."]
pub type XCPRS_OPTIONS = xuint32;
#[doc = " @brief String Conversion Control/State Block\n\n Maintain state for the suite of string conversion routines.  Fields\n can be read or written at will, although it's certainly possible to\n cause unintended results by so doing!\n"]
#[repr(C)]
pub struct XC_FORMAT_CONTROL {
    #[doc = "< pointer to output buffer"]
    pub xfc_obuf: *mut ::std::os::raw::c_char,
    #[doc = "< size of output buffer (in bytes)"]
    pub xfc_obufsiz: xuint32,
    #[doc = "< current output pointer (within xfc_obuf)"]
    pub xfc_optr: *mut ::std::os::raw::c_char,
    #[doc = "< output pointer before most recent conversion"]
    pub xfc_oprevptr: *mut ::std::os::raw::c_char,

pub const XFNUM_ZEROFILL: u32 = 65536;
pub const XFNUM_SIGNPLUS: u32 = 131072;
pub const XFNUM_SIGNRIGHT: u32 = 262144;
pub const XFNUM_SIGNSEP: u32 = 524288;
pub const XFNUM_NEGPARENS: u32 = 1048576;
pub const XFNUM_COMMAS: u32 = 2097152;
pub const XFNUM_EURO: u32 = 4194304;
pub const XFNUM_SCALED_DEC: u32 = 8388608;
pub const XFNUM_SCALED_BIN: u32 = 16777216;
pub const XFNUM_TRUNCATE: u32 = 33554432;
pub const XFNUM_TRUNCATE_ALL: u32 = 67108864;
pub const XFNUM_HEX: u32 = 2147483648;
pub const XFDT_NODELIM: u32 = 65536;
pub const XFDT_NOORDINAL: u32 = 131072;
pub const XFDT_NOYEAR: u32 = 262144;
pub const XFDT_NOMONTH: u32 = 524288;
pub const XFDT_NODAY: u32 = 1048576;
pub const XFDT_NUMERIC: u32 = 2097152;
pub const XFDT_NODATE: u32 = 4063232;
pub const XFDT_NONANOSECONDS: u32 = 4194304;
pub const XFDT_NOMICROSECONDS: u32 = 12582912;
pub const XFDT_NOMILLISECONDS: u32 = 29360128;
pub const XFDT_NOSUBSECONDS: u32 = 29360128;
pub const XFDT_NOSECONDS: u32 = 62914560;
pub const XFDT_NOMINUTES: u32 = 130023424;
pub const XFDT_NOTIME: u32 = 264241152;
pub const XFDT_NOAUTOSENSE: u32 = 2147483648;
pub const XFPRI_ZEROFILL: u32 = 65536;
pub const XFPRI_SIGNPLUS: u32 = 131072;
pub const XFPRI_SIGNRIGHT: u32 = 262144;
pub const XFPRI_SIGNSEP: u32 = 524288;
pub const XFPRI_NEGPARENS: u32 = 1048576;
pub const XFPRI_COMMAS: u32 = 2097152;
pub const XFPRI_EURO: u32 = 4194304;
pub const XFPRI_SCALED_DEC: u32 = 8388608;
pub const XFPRI_SCALED_BIN: u32 = 16777216;
pub const XFPRI_TRUNCATE: u32 = 33554432;
pub const XFEXCH_BLANKNULS: u32 = 65536;
pub const XFEXCH_PARENS: u32 = 131072;
pub const XFCC_BLANKNULS: u32 = 65536;
pub const XFCUR_BLANKNULS: u32 = 65536;
pub const XFSYM_BLANKNULS: u32 = 65536;
pub const XFSTR_UPCASE: u32 = 65536;
pub const XFSTR_DOWNCASE: u32 = 131072;
pub const XFSTR_VERBATIM: u32 = 262144;
pub const XFSTR_TRUNCATE: u32 = 524288;
pub const XFSTRUCT_HEXDUMP: u32 = 65536;
pub const XFSTRUCT_RESERVED: u32 = 131072;
pub const XFSTRUCT_NORECUR: u32 = 262144;
pub const XCFMT_ALTERNATE_ID_DEFOPT: u32 = 1;
pub const XCFMT_ORDER_REF_ID_DEFOPT: u32 = 1;
pub const XCFMT_MMID_DEFOPT: u32 = 1;
pub const XCFMT_COUNTRY_ID_DEFOPT: u32 = 1;
pub const XCFMT_CURRENCY_ID_DEFOPT: u32 = 1;
pub const XCFMT_ENUM_DEFOPT: u32 = 1;
pub const XCFMT_EXCHANGE_ID_DEFOPT: u32 = 1;
pub const XCFMT_KEY_DEFOPT: u32 = 1;
pub const XCFMT_NUMERIC_DEFOPT: u32 = 1;
pub const XCFMT_PRICE_DEFOPT: u32 = 1;
pub const XCFMT_STRING_DEFOPT: u32 = 1;
pub const XCFMT_SYMBOL_DEFOPT: u32 = 1;
pub const XCFMT_TIMEDATE_DEFOPT: u32 = 1;
pub const XCFMT_TRADED_VALUE_DEFOPT: u32 = 1;
pub const XCFMT_VOLUME_DEFOPT: u32 = 2097153;
pub const XCFMT_STRUCT_DEFOPT: u32 = 1;
pub const XFW_UNLIMITED: u32 = 0;
pub const XFW_DEFAULT: i32 = -1;
pub const XPT_DEFAULT: u32 = 255;
pub const XPRSOPT_EURO_NUMBERS: u32 = 1;
pub const XPRSOPT_EURO_DATES: u32 = 2;
pub const XPRSOPT_ENUM_ABBREV: u32 = 4;
pub const XPRSOPT_ENUM_CASE_MATCH: u32 = 8;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XC_FORMAT_CONTROL"][::std::mem::size_of::<XC_FORMAT_CONTROL>() - 248usize];
    ["Alignment of XC_FORMAT_CONTROL"][::std::mem::align_of::<XC_FORMAT_CONTROL>() - 8usize];
    ["Offset of field: XC_FORMAT_CONTROL::xfc_obuf"]
        [::std::mem::offset_of!(XC_FORMAT_CONTROL, xfc_obuf) - 0usize];
    ["Offset of field: XC_FORMAT_CONTROL::xfc_obufsiz"]
        [::std::mem::offset_of!(XC_FORMAT_CONTROL, xfc_obufsiz) - 8usize];
    ["Offset of field: XC_FORMAT_CONTROL::xfc_optr"]
        [::std::mem::offset_of!(XC_FORMAT_CONTROL, xfc_optr) - 16usize];
    ["Offset of field: XC_FORMAT_CONTROL::xfc_oprevptr"]
        [::std::mem::offset_of!(XC_FORMAT_CONTROL, xfc_oprevptr) - 24usize];
    ["Offset of field: XC_FORMAT_CONTROL::XFC_RESERVED_00"]
        [::std::mem::offset_of!(XC_FORMAT_CONTROL, XFC_RESERVED_00) - 32usize];
    ["Offset of field: XC_FORMAT_CONTROL::xfc_no_nul_term"]
        [::std::mem::offset_of!(XC_FORMAT_CONTROL, xfc_no_nul_term) - 48usize];
    ["Offset of field: XC_FORMAT_CONTROL::xfc_add_space_after"]
        [::std::mem::offset_of!(XC_FORMAT_CONTROL, xfc_add_space_after) - 49usize];
    ["Offset of field: XC_FORMAT_CONTROL::xfc_auto_expand"]
        [::std::mem::offset_of!(XC_FORMAT_CONTROL, xfc_auto_expand) - 50usize];
    ["Offset of field: XC_FORMAT_CONTROL::xfc_field_width"]
        [::std::mem::offset_of!(XC_FORMAT_CONTROL, xfc_field_width) - 52usize];
    ["Offset of field: XC_FORMAT_CONTROL::XFC_RESERVED_01"]
        [::std::mem::offset_of!(XC_FORMAT_CONTROL, XFC_RESERVED_01) - 56usize];
    ["Offset of field: XC_FORMAT_CONTROL::xfc_fw_alternate_id"]
        [::std::mem::offset_of!(XC_FORMAT_CONTROL, xfc_fw_alternate_id) - 72usize];
    ["Offset of field: XC_FORMAT_CONTROL::xfc_fw_country_id"]
        [::std::mem::offset_of!(XC_FORMAT_CONTROL, xfc_fw_country_id) - 76usize];
    ["Offset of field: XC_FORMAT_CONTROL::xfc_fw_currency_id"]
        [::std::mem::offset_of!(XC_FORMAT_CONTROL, xfc_fw_currency_id) - 80usize];
    ["Offset of field: XC_FORMAT_CONTROL::xfc_fw_date"]
        [::std::mem::offset_of!(XC_FORMAT_CONTROL, xfc_fw_date) - 84usize];
    ["Offset of field: XC_FORMAT_CONTROL::xfc_fw_enum"]
        [::std::mem::offset_of!(XC_FORMAT_CONTROL, xfc_fw_enum) - 88usize];
    ["Offset of field: XC_FORMAT_CONTROL::xfc_fw_exchange_id"]
        [::std::mem::offset_of!(XC_FORMAT_CONTROL, xfc_fw_exchange_id) - 92usize];
    ["Offset of field: XC_FORMAT_CONTROL::xfc_fw_key"]
        [::std::mem::offset_of!(XC_FORMAT_CONTROL, xfc_fw_key) - 96usize];
    ["Offset of field: XC_FORMAT_CONTROL::xfc_fw_numeric"]
        [::std::mem::offset_of!(XC_FORMAT_CONTROL, xfc_fw_numeric) - 100usize];
    ["Offset of field: XC_FORMAT_CONTROL::xfc_fw_price"]
        [::std::mem::offset_of!(XC_FORMAT_CONTROL, xfc_fw_price) - 104usize];
    ["Offset of field: XC_FORMAT_CONTROL::xfc_fw_string"]
        [::std::mem::offset_of!(XC_FORMAT_CONTROL, xfc_fw_string) - 108usize];
    ["Offset of field: XC_FORMAT_CONTROL::xfc_fw_symbol"]
        [::std::mem::offset_of!(XC_FORMAT_CONTROL, xfc_fw_symbol) - 112usize];
    ["Offset of field: XC_FORMAT_CONTROL::xfc_fw_time"]
        [::std::mem::offset_of!(XC_FORMAT_CONTROL, xfc_fw_time) - 116usize];
    ["Offset of field: XC_FORMAT_CONTROL::xfc_fw_timedate"]
        [::std::mem::offset_of!(XC_FORMAT_CONTROL, xfc_fw_timedate) - 120usize];
    ["Offset of field: XC_FORMAT_CONTROL::xfc_fw_traded_value"]
        [::std::mem::offset_of!(XC_FORMAT_CONTROL, xfc_fw_traded_value) - 124usize];
    ["Offset of field: XC_FORMAT_CONTROL::xfc_fw_volume"]
        [::std::mem::offset_of!(XC_FORMAT_CONTROL, xfc_fw_volume) - 128usize];
    ["Offset of field: XC_FORMAT_CONTROL::xfc_indent_struct"]
        [::std::mem::offset_of!(XC_FORMAT_CONTROL, xfc_indent_struct) - 132usize];
    ["Offset of field: XC_FORMAT_CONTROL::xfc_fw_order_ref_id"]
        [::std::mem::offset_of!(XC_FORMAT_CONTROL, xfc_fw_order_ref_id) - 136usize];
    ["Offset of field: XC_FORMAT_CONTROL::xfc_fw_mmid"]
        [::std::mem::offset_of!(XC_FORMAT_CONTROL, xfc_fw_mmid) - 140usize];
    ["Offset of field: XC_FORMAT_CONTROL::XFC_RESERVED_02"]
        [::std::mem::offset_of!(XC_FORMAT_CONTROL, XFC_RESERVED_02) - 144usize];
    ["Offset of field: XC_FORMAT_CONTROL::xfc_opt_alternate_id"]
        [::std::mem::offset_of!(XC_FORMAT_CONTROL, xfc_opt_alternate_id) - 152usize];
    ["Offset of field: XC_FORMAT_CONTROL::xfc_opt_country_id"]
        [::std::mem::offset_of!(XC_FORMAT_CONTROL, xfc_opt_country_id) - 156usize];
    ["Offset of field: XC_FORMAT_CONTROL::xfc_opt_currency_id"]
        [::std::mem::offset_of!(XC_FORMAT_CONTROL, xfc_opt_currency_id) - 160usize];
    ["Offset of field: XC_FORMAT_CONTROL::xfc_opt_enum"]
        [::std::mem::offset_of!(XC_FORMAT_CONTROL, xfc_opt_enum) - 164usize];
    ["Offset of field: XC_FORMAT_CONTROL::xfc_opt_exchange_id"]
        [::std::mem::offset_of!(XC_FORMAT_CONTROL, xfc_opt_exchange_id) - 168usize];
    ["Offset of field: XC_FORMAT_CONTROL::xfc_opt_key"]
        [::std::mem::offset_of!(XC_FORMAT_CONTROL, xfc_opt_key) - 172usize];
    ["Offset of field: XC_FORMAT_CONTROL::xfc_opt_numeric"]
        [::std::mem::offset_of!(XC_FORMAT_CONTROL, xfc_opt_numeric) - 176usize];
    ["Offset of field: XC_FORMAT_CONTROL::xfc_opt_price"]
        [::std::mem::offset_of!(XC_FORMAT_CONTROL, xfc_opt_price) - 180usize];
    ["Offset of field: XC_FORMAT_CONTROL::xfc_opt_string"]
        [::std::mem::offset_of!(XC_FORMAT_CONTROL, xfc_opt_string) - 184usize];
    ["Offset of field: XC_FORMAT_CONTROL::xfc_opt_symbol"]
        [::std::mem::offset_of!(XC_FORMAT_CONTROL, xfc_opt_symbol) - 188usize];
    ["Offset of field: XC_FORMAT_CONTROL::xfc_opt_timedate"]
        [::std::mem::offset_of!(XC_FORMAT_CONTROL, xfc_opt_timedate) - 192usize];
    ["Offset of field: XC_FORMAT_CONTROL::xfc_opt_traded_value"]
        [::std::mem::offset_of!(XC_FORMAT_CONTROL, xfc_opt_traded_value) - 196usize];
    ["Offset of field: XC_FORMAT_CONTROL::xfc_opt_volume"]
        [::std::mem::offset_of!(XC_FORMAT_CONTROL, xfc_opt_volume) - 200usize];
    ["Offset of field: XC_FORMAT_CONTROL::xfc_opt_struct"]
        [::std::mem::offset_of!(XC_FORMAT_CONTROL, xfc_opt_struct) - 204usize];
    ["Offset of field: XC_FORMAT_CONTROL::xfc_opt_order_ref_id"]
        [::std::mem::offset_of!(XC_FORMAT_CONTROL, xfc_opt_order_ref_id) - 208usize];
    ["Offset of field: XC_FORMAT_CONTROL::xfc_opt_mmid"]
        [::std::mem::offset_of!(XC_FORMAT_CONTROL, xfc_opt_mmid) - 212usize];
    ["Offset of field: XC_FORMAT_CONTROL::XFC_RESERVED_03"]
        [::std::mem::offset_of!(XC_FORMAT_CONTROL, XFC_RESERVED_03) - 216usize];
    ["Offset of field: XC_FORMAT_CONTROL::xfc_def_price_type"]
        [::std::mem::offset_of!(XC_FORMAT_CONTROL, xfc_def_price_type) - 220usize];
    ["Offset of field: XC_FORMAT_CONTROL::xfc_def_qual_type"]
        [::std::mem::offset_of!(XC_FORMAT_CONTROL, xfc_def_qual_type) - 222usize];
    ["Offset of field: XC_FORMAT_CONTROL::XFC_RESERVED_04"]
        [::std::mem::offset_of!(XC_FORMAT_CONTROL, XFC_RESERVED_04) - 224usize];
    ["Offset of field: XC_FORMAT_CONTROL::XFC_RESERVED_05"]
        [::std::mem::offset_of!(XC_FORMAT_CONTROL, XFC_RESERVED_05) - 228usize];
    ["Offset of field: XC_FORMAT_CONTROL::xfc_magic_cookie"]
        [::std::mem::offset_of!(XC_FORMAT_CONTROL, xfc_magic_cookie) - 240usize];
};
impl ::std::fmt::Debug for XC_FORMAT_CONTROL {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "XC_FORMAT_CONTROL {{ xfc_obuf: {:?}, xfc_optr: {:?}, xfc_oprevptr: {:?}, XFC_RESERVED_00: {:?}, XFC_RESERVED_01: {:?}, XFC_RESERVED_02: {:?}, XFC_RESERVED_05: {:?} }}",
            self.xfc_obuf,
            self.xfc_optr,
            self.xfc_oprevptr,
            self.XFC_RESERVED_00,
            self.XFC_RESERVED_01,
            self.XFC_RESERVED_02,
            self.XFC_RESERVED_05
        )
    }
}
unsafe extern "C" {
    pub fn xcFmtInitialize(
        fmtCtrl: *mut XC_FORMAT_CONTROL,
        obuf: *mut ::std::os::raw::c_char,
        osiz: xuint32,
    ) -> xerr;
}
unsafe extern "C" {
    pub fn xcFmtSetBuffer(
        fmtCtrl: *mut XC_FORMAT_CONTROL,
